BI.org
-*- mode: Org; fill-column: 110; coding: utf-8; -*-
oracle account
Chepelev_VS@bel-rusnarbank.ru
00Mortal00

Виктор галицкий - доступк ЦФТ
Саша попов запрос для процедур

Александр Шаповалов - отчеты
Басиев марат - дублирующий Airflow, качество данных

Конфлюенце
