BI.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-16 Wed 19:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0f239e">1. english terms</a></li>
<li><a href="#org488a613">2. Основные определения</a></li>
<li><a href="#org66a0d2b">3. level of sophistication of a Data Warehouse</a></li>
<li><a href="#org8b436ec">4. History</a></li>
<li><a href="#org958e48e">5. Teory</a>
<ul>
<li><a href="#org605ad8f">5.1. evolution</a></li>
<li><a href="#org8a9f2a3">5.2. DW Development Approaches</a></li>
<li><a href="#org7b5001c">5.3. Architecture - Организационная зрелость</a></li>
<li><a href="#org073a45b">5.4. Best Practices</a></li>
<li><a href="#orgd00d71f">5.5. Dimensional modeling</a></li>
<li><a href="#orge5d2299">5.6. Loading</a></li>
</ul>
</li>
<li><a href="#orgfadb817">6. OLAP</a>
<ul>
<li><a href="#org6e70e2e">6.1. OLAP terms:</a></li>
<li><a href="#org1290a81">6.2. Типы OLAP </a></li>
<li><a href="#org6d45199">6.3. SQL OLAP extension</a></li>
<li><a href="#org1a02f53">6.4. Oracle OLAP</a>
<ul>
<li><a href="#org51616ee">6.4.1. links</a></li>
</ul>
</li>
<li><a href="#org55bb27b">6.5. API</a></li>
<li><a href="#orgc9d2c6a">6.6. features</a></li>
</ul>
</li>
<li><a href="#org8926b46">7. data warehouse and any data intergration system modeling</a>
<ul>
<li><a href="#org2152125">7.1. <span class="todo TODO">TODO</span> Normalization vs. denormalization</a></li>
<li><a href="#org30b36a3">7.2. star schema - best data warehouse model  </a></li>
<li><a href="#org14ab139">7.3. Data Model</a></li>
<li><a href="#orgc9f27cc">7.4. data mart</a></li>
<li><a href="#org9568ee3">7.5. Dimensional modeling</a>
<ul>
<li><a href="#org27d4956">7.5.1. Моделирование многомерных кубов на реляционной модели данных:</a></li>
<li><a href="#orgd388836">7.5.2. виды fact table</a></li>
</ul>
</li>
<li><a href="#org5baef94">7.6. <span class="todo TODO">TODO</span> links</a></li>
</ul>
</li>
<li><a href="#org987bd4d">8. <span class="todo TODO">TODO</span> Predictive analytics</a></li>
<li><a href="#orgd2324c1">9. виды софта</a></li>
<li><a href="#org6eff08e">10. Types of database management software</a></li>
<li><a href="#org9ade97b">11. <span class="todo TODO">TODO</span> problem Change-Data Capture (DELETE UPDATE)</a></li>
<li><a href="#orge1e76f1">12. time-to-market</a></li>
<li><a href="#org9fab7b3">13. выбор 2019</a></li>
<li><a href="#orgb1b9b90">14. SQL builder tools</a></li>
<li><a href="#org7e56e5a">15. APEX Oracle</a>
<ul>
<li><a href="#orgfaad97a">15.1. upload Excel file</a></li>
<li><a href="#org4820264">15.2. create app upload from file</a></li>
<li><a href="#org007bc43">15.3. https://docs.oracle.com/en/database/oracle/application-express/18/data_load_wizard/</a></li>
<li><a href="#org121bec0">15.4. plugin</a></li>
</ul>
</li>
<li><a href="#org03caa0b">16. Oracle</a>
<ul>
<li><a href="#org2732d5f">16.1. column names and comments</a></li>
<li><a href="#org4fe3ae3">16.2. column info</a></li>
<li><a href="#orgc295e08">16.3. all available tables</a></li>
<li><a href="#org5d51f96">16.4. get tables description</a></li>
</ul>
</li>
<li><a href="#orgd6f5322">17. Report and Dashboard (Data visualization)</a>
<ul>
<li><a href="#org582569b">17.1. terms</a></li>
<li><a href="#org6458520">17.2. Design best practives</a></li>
<li><a href="#orgbfc5173">17.3. Excel Power Pivot</a></li>
<li><a href="#org10bb2ff">17.4. Power BI Desktop</a>
<ul>
<li><a href="#org2156b33">17.4.1. connection types</a></li>
<li><a href="#orgc455bac">17.4.2. features</a></li>
<li><a href="#org09e0da0">17.4.3. Power Query</a></li>
<li><a href="#org1016a75">17.4.4. Data Analysis Expressions (DAX)</a></li>
<li><a href="#org0d90861">17.4.5. dataflow</a></li>
<li><a href="#org505793d">17.4.6. power query язык M</a></li>
<li><a href="#org3675e04">17.4.7. report as one string but no OFFSET and LIMIT:</a></li>
<li><a href="#orga9c4c54">17.4.8. custom visal apps</a></li>
</ul>
</li>
<li><a href="#org8c6cb64">17.5. Tableau Public (Desktop Windows, mac)</a></li>
<li><a href="#orgfadb450">17.6. Metabase</a></li>
<li><a href="#org6c6ab68">17.7. Redash</a></li>
<li><a href="#org707dbc9">17.8. Qlik Sense Desktop</a></li>
<li><a href="#org4e0a6ab">17.9. SuperSet</a>
<ul>
<li><a href="#orgbbe79c3">17.9.1. create dashboard</a></li>
<li><a href="#org5bc1496">17.9.2. feature:</a></li>
<li><a href="#org12c22f8">17.9.3. install 1.4</a></li>
<li><a href="#org729a5b4">17.9.4. config</a></li>
<li><a href="#org75b17da">17.9.5. install old</a></li>
<li><a href="#org0671073">17.9.6. architecture</a></li>
<li><a href="#org55b349e">17.9.7. docker-compose</a></li>
<li><a href="#orgae5e537">17.9.8. pros and cons</a></li>
<li><a href="#org2558b76">17.9.9. links</a></li>
<li><a href="#orgf06edb9">17.9.10. security</a></li>
<li><a href="#org0fa353c">17.9.11. semantic layer</a></li>
</ul>
</li>
<li><a href="#org37364a5">17.10. <span class="todo TODO">TODO</span> Google Data Studio</a></li>
<li><a href="#org62f14bb">17.11. <span class="todo TODO">TODO</span> Looker</a></li>
<li><a href="#org02eff3f">17.12. как выбирать:</a></li>
<li><a href="#org88179eb">17.13. 4 качества хорошего дашборда</a></li>
<li><a href="#org2d7babf">17.14. Виды отчетов и дашбордов⁣⁣</a></li>
<li><a href="#orge7924b6">17.15. советы 20</a></li>
<li><a href="#org488f07a">17.16. этапы построения</a></li>
<li><a href="#orgea387ce">17.17. дашборды на смартфоне</a></li>
</ul>
</li>
<li><a href="#org54aa2c9">18. report commercial</a>
<ul>
<li><a href="#orge69c74c">18.1. SAP Crystal Reports</a></li>
</ul>
</li>
<li><a href="#org69b9a8d">19. Data Warehouse producsts</a>
<ul>
<li><a href="#org7d6ff11">19.1. Clickhouse</a>
<ul>
<li><a href="#org6917691">19.1.1. Управление данными</a></li>
<li><a href="#orgd502a90">19.1.2. sql</a></li>
<li><a href="#org58be4a2">19.1.3. error ssl</a></li>
<li><a href="#orgc3cd425">19.1.4. Aiflow</a></li>
<li><a href="#org73398f2">19.1.5. Power BI</a></li>
</ul>
</li>
<li><a href="#org8cba54b">19.2. MariaDB</a>
<ul>
<li><a href="#org2666037">19.2.1. install</a></li>
</ul>
</li>
<li><a href="#orgfebb5e4">19.3. PostgreSQL</a></li>
<li><a href="#orgb02ee6e">19.4. Greenplum BD</a>
<ul>
<li><a href="#orgdbb1232">19.4.1. MPP</a></li>
<li><a href="#orgc1715bd">19.4.2. Append-only tables</a></li>
<li><a href="#org424437e">19.4.3. install for kubernetes</a></li>
<li><a href="#org1a6c62d">19.4.4. psql</a></li>
<li><a href="#org3831abd">19.4.5. Tablespaces not needed</a></li>
<li><a href="#org44a45f9">19.4.6. Create Tables</a></li>
<li><a href="#orgf25465c">19.4.7. data types</a></li>
<li><a href="#orgcb5bf4e">19.4.8. ROLE</a></li>
<li><a href="#org66e45c3">19.4.9. Greenplum ETL</a></li>
<li><a href="#org30a8031">19.4.10. Power BI</a></li>
<li><a href="#orga2400a1">19.4.11. Serial</a></li>
<li><a href="#org97e9fa2">19.4.12. userful SQL</a></li>
</ul>
</li>
<li><a href="#org4f44d2a">19.5. Apache Druid</a></li>
<li><a href="#org52991b7">19.6. in memory additional DB with replication</a></li>
<li><a href="#org743fd91">19.7. DB vertica community edition</a></li>
</ul>
</li>
<li><a href="#org8e57edd">20. Oracle</a>
<ul>
<li><a href="#orgc3fa545">20.1. Oracle Instant Client</a></li>
<li><a href="#orgd0902b0">20.2. SQL* plus</a></li>
<li><a href="#orga5d5de9">20.3. Constraints</a></li>
<li><a href="#org1b82ae4">20.4. SQL useful</a></li>
<li><a href="#orgfc29ab6">20.5. Memory Architecture</a></li>
<li><a href="#org4534f18">20.6. cx<sub>Oracle</sub> python</a></li>
<li><a href="#org997943d">20.7. characters</a></li>
</ul>
</li>
<li><a href="#org42605db">21. ETL vs. ELT</a></li>
<li><a href="#org9830f38">22. ETL Extract, Transform, Load- traditional ETL paradigm - batch-driven</a>
<ul>
<li><a href="#org8b124c1">22.1. targets</a></li>
<li><a href="#org0be2666">22.2. process</a></li>
<li><a href="#org4a3b049">22.3. Full and Incremental Loading</a></li>
<li><a href="#org36b0d6b">22.4. CDC</a></li>
<li><a href="#orgebf7b98">22.5. Spring Cloud Data Flow</a></li>
<li><a href="#orgf4280f9">22.6. Talend Open Studio</a></li>
<li><a href="#org4252565">22.7. staging tables Промежуточные таблицы</a></li>
<li><a href="#org78a454d">22.8. concurrent vs sequential</a></li>
</ul>
</li>
<li><a href="#org6433252">23. Apache Airflow</a>
<ul>
<li><a href="#orgddaf049">23.1. terms</a></li>
<li><a href="#orga8d3732">23.2. theory</a></li>
<li><a href="#org2b0106c">23.3. variables</a></li>
<li><a href="#orge4a8e2b">23.4. Hooks</a></li>
<li><a href="#org44a4ccf">23.5. components</a></li>
<li><a href="#org26ab834">23.6. scheduler</a></li>
<li><a href="#orgc57f0f1">23.7. dag</a>
<ul>
<li><a href="#org8d93057">23.7.1. create dag:</a></li>
</ul>
</li>
<li><a href="#orgb0c0728">23.8. Operator</a>
<ul>
<li><a href="#org85ab31c">23.8.1. Pipeline difinition:</a></li>
<li><a href="#org7896aa4">23.8.2. OracleOperator</a></li>
<li><a href="#org9dac353">23.8.3. PythonOperator</a></li>
<li><a href="#org849e045">23.8.4. PythonOperator context</a></li>
</ul>
</li>
<li><a href="#orgb99f808">23.9. Tasks</a>
<ul>
<li><a href="#orga262fc3">23.9.1. trigger<sub>rule</sub></a></li>
</ul>
</li>
<li><a href="#org4e5cda9">23.10. TaskGroup</a></li>
<li><a href="#org5d83c7f">23.11. airflow.cfg</a></li>
<li><a href="#org5a9ece5">23.12. best practives</a>
<ul>
<li><a href="#org02ac20b">23.12.1. UPSERT in postgresql</a></li>
</ul>
</li>
<li><a href="#orga0ab119">23.13. local server</a></li>
<li><a href="#orgf9a8936">23.14. Incremental Record Filtering</a></li>
<li><a href="#orgb737ef3">23.15. deployment</a>
<ul>
<li><a href="#org1f52aa2">23.15.1. docker-compose</a></li>
<li><a href="#org324cd82">23.15.2. Dockerfile</a></li>
<li><a href="#org69785ff">23.15.3. ferenet.py</a></li>
<li><a href="#orgdea0efc">23.15.4. mysqlconnect.py</a></li>
<li><a href="#org6f1dd51">23.15.5. airflow.sh</a></li>
</ul>
</li>
<li><a href="#org69fd841">23.16. test</a>
<ul>
<li><a href="#org2d8140a">23.16.1. operator</a></li>
<li><a href="#orgb9d1783">23.16.2. dag test</a></li>
<li><a href="#orgdf145df">23.16.3. task.execute</a></li>
</ul>
</li>
<li><a href="#orgbf97d20">23.17. dynamic dag</a></li>
<li><a href="#orgef1bb40">23.18. pass data between operators</a></li>
<li><a href="#org4806efd">23.19. макросы Jinja в Airflow</a></li>
<li><a href="#orgd07cbed">23.20. parallism config</a></li>
<li><a href="#orgc846146">23.21. skip task</a></li>
<li><a href="#orgfdbd8c7">23.22. stop dag</a></li>
<li><a href="#org9eb2440">23.23. Executors</a></li>
<li><a href="#org13cd0cc">23.24. Cross-DAG Dependencies (subdags)</a>
<ul>
<li><a href="#orgf7629dd">23.24.1. ExternalTaskSensor</a></li>
<li><a href="#orga1ccf9d">23.24.2. <span class="todo TODO">TODO</span> TriggerDagRunOperator</a></li>
<li><a href="#org7251659">23.24.3. <span class="todo TODO">TODO</span> dag.implicit<sub>dependencies</sub> = ['dag<sub>1</sub>', 'dag<sub>2</sub>']</a></li>
<li><a href="#org1f07399">23.24.4. SubDagOperator</a></li>
</ul>
</li>
<li><a href="#orgd6bea96">23.25. Trigger Dag - JSON</a></li>
<li><a href="#orgf54b99d">23.26. update 2.0.2</a></li>
<li><a href="#org496d8ee">23.27. create connection</a></li>
<li><a href="#org35e4485">23.28. create user</a></li>
<li><a href="#org23ff811">23.29. restart</a></li>
<li><a href="#org4d9cbb2">23.30. problems</a></li>
<li><a href="#org08a472a">23.31. how to change config:</a></li>
<li><a href="#org99b048b">23.32. rest API</a></li>
<li><a href="#orgd8bb0cb">23.33. logs</a></li>
<li><a href="#org8a6422f">23.34. Database of Airflow</a></li>
</ul>
</li>
<li><a href="#org20df5b4">24. <span class="todo TODO">TODO</span> dbt - ETL</a></li>
<li><a href="#org9fc2854">25. Data Lake (Озеро данных)</a>
<ul>
<li><a href="#org0a220a3">25.1. критика</a></li>
</ul>
</li>
<li><a href="#orga1e8f35">26. Управленческий учет</a></li>
<li><a href="#org4fa38cd">27. <span class="todo TODO">TODO</span> Юнит-экономика (unit-экономика, unit economics)</a>
<ul>
<li><a href="#orgbff0a09">27.1. Зачем считать юнит-экономику</a></li>
<li><a href="#org3dbfbf4">27.2. Когда</a></li>
<li><a href="#org8b73c86">27.3. Как</a></li>
<li><a href="#org9474713">27.4. Когортный анализ</a></li>
<li><a href="#org10fc4d8">27.5. links</a></li>
</ul>
</li>
<li><a href="#org0a1213c">28. mail</a></li>
<li><a href="#org0cb0390">29. Congos</a></li>
<li><a href="#org042ebc1">30. цфт разаботка</a></li>
<li><a href="#org71b971b">31. Data Science</a></li>
<li><a href="#org1374f63">32. BI Platform video</a></li>
<li><a href="#org20f5a51">33. Big Data</a>
<ul>
<li><a href="#org225c5f9">33.1. кодекс этики</a></li>
<li><a href="#org18f8ffe">33.2. news</a></li>
</ul>
</li>
<li><a href="#org16e52f4">34. Аналитическая платформа - система принятия решений</a></li>
<li><a href="#orgcca645b">35. система управления активами (ITAM)</a></li>
<li><a href="#org1b8b437">36. Digital Marketing metrics</a>
<ul>
<li><a href="#orga9d0e83">36.1. terms</a></li>
</ul>
</li>
<li><a href="#orga655f2c">37. tmp</a>
<ul>
<li><a href="#orgd13ba05">37.1. resume BI</a></li>
<li><a href="#org9092711">37.2. my review</a></li>
<li><a href="#org2c09e07">37.3. my review2</a></li>
</ul>
</li>
<li><a href="#org31d53c1">38. links</a></li>
</ul>
</div>
</div>
<p>
-<b>- mode: Org; fill-column: 110; coding: utf-8; -</b>-
oracle account
Chepelev<sub>VS</sub>@bel-rusnarbank.ru
00Mortal00
</p>

<p>
Виктор галицкий - доступк ЦФТ
Саша попов запрос для процедур
</p>

<p>
Александр Шаповалов - отчеты
Басиев марат - дублирующий Airflow, качество данных
</p>

<p>
Конфлюенце
</p>
