BI.org
* english terms
executives [ɪgˈzekjʊtɪv] - руководители
- wrangling [ˈræŋglə] that data into well-formed, actionable information - уменьшать
* Основные определения
- Data warehouse ::  ['weə] склад, system used for reporting and data analysis, and is considered a
  core component of business intelligence - long time horizon (up to 10 years)
- Data mart :: [mɑːt] a subset of the data warehouse (срез)
- Dimensional modeling ::  is part of the *Business Dimensional Lifecycle* methodology developed by
  *Ralph Kimball*
- Lake :: One spot to work with data in work with data from applications like Salesforce, Hubspot, Jira, and
  Zendesk
  - sources -> Lake -> Warehouse -> mart
  - single SQL syntax

levels:
1 *Business intelligence* as it is understood today is said to have evolved from the *decision support systems* (DSS)
 - several types of applications and technologies for acquiring, storing, analyzing, and providing
   access to information to help users make more sound business decisions
 - include decision support systems, query and reporting, online analytical processing (OLAP), statistical analysis, and data mining
2 *decision support system* -
 - model-oriented -
 - data-oriented - adhoc queries and reporting
 - executive information system (EIS), supports the strategic information needs of executive management
3 *online analytical processing (OLAP) programs*

Roles:
- Business Analyst - занимается поиском узких мест в бизнес процессах, формирует задачи, отслеживает
  эффективность процессов  - бизнес задачи:
  - Автоматизация маркетинговых кампаний
  - Накопление информации по клиентам из всех возможных источников и ее использование
  - Автоматизация принятия на страхование, cкорингна предстраховойпроверкепо всем продуктам
  - Скорингна жизненном пути клиента в компании
    - Рост конверсии
    - Увеличение проникновения дополнительных продуктов на клиента
    - Принятие решений при урегулировании
    - Мошенничество
    - Отток
  - Нестандартные задачи:
    - Оценка взаимодействиясотрудников и подразделений SAS SNA
- Data miner - адаптирует и тиражирует шаблоны наработки Data Scientist
- Data Scientist - строит шаблоны / алгоритмы анализа - сложные задачи
  - Python для точечных исследований

Consolidation database -  TODO
* level of sophistication of a Data Warehouse
- Offline operational data warehouse ::  daily, weekly or monthly - integrated reporting-oriented data
- Offline data warehouse :: regular basis - data structure designed
- On time data warehouse :: for every transaction
- Integrated data warehouse :: different areas of business
* History
master file -> database -> online apps & central online database
batch -> online transaction processing

Extract file - exctracted by one app from database and shipped to another app.

Lot of them - spiderweb problem. Realization that there were different data - *operational* ( daily operations
of a business) and *informational*.

| Operational systems                     | Informational/DSS                       |
|-----------------------------------------+-----------------------------------------|
| Detailed                                | Summarized                              |
| Can be updated                          | Snapshit records; no up                 |
| Accurate up to the second               | Timestamp on each record                |
| for clerks                              | used by management                      |
| built based on requirements             | built without knowing reqs              |
| support small uniform tr-s              | support mixed workload                  |
| yields 2-3-sec resp time                | yields 30-24-hour resp time             |
| Data designed for optimal storage(size) | Data designed for optimal access(speed) |
| data designed around functional usage   | data designed around subject areas      |
| very current data                       | mainly historical data                  |
| data is application oriented            | data is integrated                      |
| referential integrity is useful         | referential integrity is not useful     |
| high availability is normal             | high availability is nice to have       |

Decision support system (DSS)

Operational processing was done out of an ERP systems like SAP. Information processing was done out of a data warehouse.
