BI.html
<div id="outline-container-orgc0f239e" class="outline-2">
<h2 id="orgc0f239e"><span class="section-number-2">1</span> english terms</h2>
<div class="outline-text-2" id="text-1">
<p>
executives [ɪgˈzekjʊtɪv] - руководители
</p>
<ul class="org-ul">
<li>wrangling [ˈræŋglə] that data into well-formed, actionable information - уменьшать</li>
</ul>
</div>
</div>
<div id="outline-container-org488a613" class="outline-2">
<h2 id="org488a613"><span class="section-number-2">2</span> Основные определения</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt>Data warehouse</dt><dd>['weə] склад, system used for reporting and data analysis, and is considered a
core component of business intelligence - long time horizon (up to 10 years)</dd>
<dt>Data mart</dt><dd>[mɑːt] a subset of the data warehouse (срез)</dd>
<dt>Dimensional modeling</dt><dd>is part of the <b>Business Dimensional Lifecycle</b> methodology developed by
<b>Ralph Kimball</b></dd>
<dt>Lake</dt><dd>One spot to work with data in work with data from applications like Salesforce, Hubspot, Jira, and
Zendesk
<ul class="org-ul">
<li>sources -&gt; Lake -&gt; Warehouse -&gt; mart</li>
<li>single SQL syntax</li>
</ul></dd>
</dl>

<p>
levels:
1 <b>Business intelligence</b> as it is understood today is said to have evolved from the <b>decision support systems</b> (DSS)
</p>
<ul class="org-ul">
<li>several types of applications and technologies for acquiring, storing, analyzing, and providing
access to information to help users make more sound business decisions</li>
<li>include decision support systems, query and reporting, online analytical processing (OLAP), statistical analysis, and data mining</li>
</ul>
<p>
2 <b>decision support system</b> -
</p>
<ul class="org-ul">
<li>model-oriented -</li>
<li>data-oriented - adhoc queries and reporting</li>
<li>executive information system (EIS), supports the strategic information needs of executive management</li>
</ul>
<p>
3 <b>online analytical processing (OLAP) programs</b>
</p>

<p>
Roles:
</p>
<ul class="org-ul">
<li>Business Analyst - занимается поиском узких мест в бизнес процессах, формирует задачи, отслеживает
эффективность процессов  - бизнес задачи:
<ul class="org-ul">
<li>Автоматизация маркетинговых кампаний</li>
<li>Накопление информации по клиентам из всех возможных источников и ее использование</li>
<li>Автоматизация принятия на страхование, cкорингна предстраховойпроверкепо всем продуктам</li>
<li>Скорингна жизненном пути клиента в компании
<ul class="org-ul">
<li>Рост конверсии</li>
<li>Увеличение проникновения дополнительных продуктов на клиента</li>
<li>Принятие решений при урегулировании</li>
<li>Мошенничество</li>
<li>Отток</li>
</ul></li>
<li>Нестандартные задачи:
<ul class="org-ul">
<li>Оценка взаимодействиясотрудников и подразделений SAS SNA</li>
</ul></li>
</ul></li>
<li>Data miner - адаптирует и тиражирует шаблоны наработки Data Scientist</li>
<li>Data Scientist - строит шаблоны / алгоритмы анализа - сложные задачи
<ul class="org-ul">
<li>Python для точечных исследований</li>
</ul></li>
</ul>

<p>
Consolidation database -  TODO
</p>
</div>
</div>
<div id="outline-container-org66a0d2b" class="outline-2">
<h2 id="org66a0d2b"><span class="section-number-2">3</span> level of sophistication of a Data Warehouse</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt>Offline operational data warehouse</dt><dd>daily, weekly or monthly - integrated reporting-oriented data</dd>
<dt>Offline data warehouse</dt><dd>regular basis - data structure designed</dd>
<dt>On time data warehouse</dt><dd>for every transaction</dd>
<dt>Integrated data warehouse</dt><dd>different areas of business</dd>
</dl>
</div>
</div>
<div id="outline-container-org8b436ec" class="outline-2">
<h2 id="org8b436ec"><span class="section-number-2">4</span> History</h2>
<div class="outline-text-2" id="text-4">
<p>
master file -&gt; database -&gt; online apps &amp; central online database
batch -&gt; online transaction processing
</p>

<p>
Extract file - exctracted by one app from database and shipped to another app.
</p>

<p>
Lot of them - spiderweb problem. Realization that there were different data - <b>operational</b> ( daily operations
of a business) and <b>informational</b>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operational systems</th>
<th scope="col" class="org-left">Informational/DSS</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Detailed</td>
<td class="org-left">Summarized</td>
</tr>

<tr>
<td class="org-left">Can be updated</td>
<td class="org-left">Snapshit records; no up</td>
</tr>

<tr>
<td class="org-left">Accurate up to the second</td>
<td class="org-left">Timestamp on each record</td>
</tr>

<tr>
<td class="org-left">for clerks</td>
<td class="org-left">used by management</td>
</tr>

<tr>
<td class="org-left">built based on requirements</td>
<td class="org-left">built without knowing reqs</td>
</tr>

<tr>
<td class="org-left">support small uniform tr-s</td>
<td class="org-left">support mixed workload</td>
</tr>

<tr>
<td class="org-left">yields 2-3-sec resp time</td>
<td class="org-left">yields 30-24-hour resp time</td>
</tr>

<tr>
<td class="org-left">Data designed for optimal storage(size)</td>
<td class="org-left">Data designed for optimal access(speed)</td>
</tr>

<tr>
<td class="org-left">data designed around functional usage</td>
<td class="org-left">data designed around subject areas</td>
</tr>

<tr>
<td class="org-left">very current data</td>
<td class="org-left">mainly historical data</td>
</tr>

<tr>
<td class="org-left">data is application oriented</td>
<td class="org-left">data is integrated</td>
</tr>

<tr>
<td class="org-left">referential integrity is useful</td>
<td class="org-left">referential integrity is not useful</td>
</tr>

<tr>
<td class="org-left">high availability is normal</td>
<td class="org-left">high availability is nice to have</td>
</tr>
</tbody>
</table>

<p>
Decision support system (DSS)
</p>

<p>
Operational processing was done out of an ERP systems like SAP. Information processing was done out of a data warehouse.
</p>
</div>
</div>
