BI.md


<a id="orge456b2b"></a>

# english terms

executives [ɪgˈzekjʊtɪv] - руководители

-   wrangling [ˈræŋglə] that data into well-formed, actionable information - уменьшать


<a id="org28edb49"></a>

# Основные определения

-   **Data warehouse:** ['weə] склад, system used for reporting and data analysis, and is considered a
    core component of business intelligence - long time horizon (up to 10 years)
-   **Data mart:** [mɑːt] a subset of the data warehouse (срез)
-   **Dimensional modeling:** is part of the **Business Dimensional Lifecycle** methodology developed by
    **Ralph Kimball**
-   **Lake:** One spot to work with data in work with data from applications like Salesforce, Hubspot, Jira, and
    Zendesk
    -   sources -> Lake -> Warehouse -> mart
    -   single SQL syntax

levels:
1 **Business intelligence** as it is understood today is said to have evolved from the **decision support systems** (DSS)

-   several types of applications and technologies for acquiring, storing, analyzing, and providing
    access to information to help users make more sound business decisions
-   include decision support systems, query and reporting, online analytical processing (OLAP), statistical analysis, and data mining

2 **decision support system** -

-   model-oriented -
-   data-oriented - adhoc queries and reporting
-   executive information system (EIS), supports the strategic information needs of executive management

3 **online analytical processing (OLAP) programs**

Roles:

-   Business Analyst - занимается поиском узких мест в бизнес процессах, формирует задачи, отслеживает
    эффективность процессов  - бизнес задачи:
    -   Автоматизация маркетинговых кампаний
    -   Накопление информации по клиентам из всех возможных источников и ее использование
    -   Автоматизация принятия на страхование, cкорингна предстраховойпроверкепо всем продуктам
    -   Скорингна жизненном пути клиента в компании
        -   Рост конверсии
        -   Увеличение проникновения дополнительных продуктов на клиента
        -   Принятие решений при урегулировании
        -   Мошенничество
        -   Отток
    -   Нестандартные задачи:
        -   Оценка взаимодействиясотрудников и подразделений SAS SNA
-   Data miner - адаптирует и тиражирует шаблоны наработки Data Scientist
-   Data Scientist - строит шаблоны / алгоритмы анализа - сложные задачи
    -   Python для точечных исследований

Consolidation database -  TODO


<a id="orgaa14014"></a>

# level of sophistication of a Data Warehouse

-   **Offline operational data warehouse:** daily, weekly or monthly - integrated reporting-oriented data
-   **Offline data warehouse:** regular basis - data structure designed
-   **On time data warehouse:** for every transaction
-   **Integrated data warehouse:** different areas of business


<a id="org1c64dbd"></a>

# History

master file -> database -> online apps & central online database
batch -> online transaction processing

Extract file - exctracted by one app from database and shipped to another app.

Lot of them - spiderweb problem. Realization that there were different data - **operational** ( daily operations
of a business) and **informational**.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operational systems</th>
<th scope="col" class="org-left">Informational/DSS</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Detailed</td>
<td class="org-left">Summarized</td>
</tr>


<tr>
<td class="org-left">Can be updated</td>
<td class="org-left">Snapshit records; no up</td>
</tr>


<tr>
<td class="org-left">Accurate up to the second</td>
<td class="org-left">Timestamp on each record</td>
</tr>


<tr>
<td class="org-left">for clerks</td>
<td class="org-left">used by management</td>
</tr>


<tr>
<td class="org-left">built based on requirements</td>
<td class="org-left">built without knowing reqs</td>
</tr>


<tr>
<td class="org-left">support small uniform tr-s</td>
<td class="org-left">support mixed workload</td>
</tr>


<tr>
<td class="org-left">yields 2-3-sec resp time</td>
<td class="org-left">yields 30-24-hour resp time</td>
</tr>


<tr>
<td class="org-left">Data designed for optimal storage(size)</td>
<td class="org-left">Data designed for optimal access(speed)</td>
</tr>


<tr>
<td class="org-left">data designed around functional usage</td>
<td class="org-left">data designed around subject areas</td>
</tr>


<tr>
<td class="org-left">very current data</td>
<td class="org-left">mainly historical data</td>
</tr>


<tr>
<td class="org-left">data is application oriented</td>
<td class="org-left">data is integrated</td>
</tr>


<tr>
<td class="org-left">referential integrity is useful</td>
<td class="org-left">referential integrity is not useful</td>
</tr>


<tr>
<td class="org-left">high availability is normal</td>
<td class="org-left">high availability is nice to have</td>
</tr>
</tbody>
</table>

Decision support system (DSS)

Operational processing was done out of an ERP systems like SAP. Information processing was done out of a data warehouse.
