BI.org
* Teory
data -> data warehouse (information) -> analytical tools (knowledge) -> rules&model (insights) -> experience

help to two main kinds of decisions:
- strategic decisions - direction of the company
- operational decisions - routine and tactical decisions, for greater efficiency

** evolution
steps:
1. AWARE: Primary batched reports -  70% batch, 30% OLAP
2. DEVELOPING: ad-hoc queries and an-al data mining - 55% batch, OLAP 40%, 15% predictive modeling & data
   mining
3. PRACTICING: predictive - 30% batch, 45 OLAP, 30 mining
4. OPTIMIZING: predictive - 20% batch, 30 OLAP, 30 mining, 10 event-based triggering
5. LEADING: 20 20 20 20

stems 2:
- manual spreadsheets - reports
- data marts - KPIs
- enterprise data warehouse
- OLAP
- propensity modeling - risk management
- enterprise dashboard - events detection
- relationship optimization

** DW Development Approaches
- top-down :: Bill Inmon - Date Warehouse first
- bottom-up :: Kimball - Data Mart created first
Disadvantages Of Top Down Design :
- It represents a very large project and the cost of implementing the project is significant.
- It is time consuming and more time required for initial set up
- Highly skilled people required for set up


Disadvantage of Bottom Up Design  :
- Initial cost is low but each subsequent phase will cost same
- The positions of the data warehouse and the data marts are reversed in the bottom-up approach design.
- It is difficult to maintain and often redundant and subject to revisions

Стандарт де факто, две базы (Data Warehouse and OLAP):
- компактное хранение детализированных данных и поддержка очень больших БД, обеспечиваемые реляционными СУБД;
- простота настройки и хорошие времена отклика, при работе с агрегированными данными, обеспечиваемые многомерными СУБД.
** Architecture - Организационная зрелость
1) sources -> Warehouse -> Users
2) sources -> Staging_area -> Warehouse -> Users
   - Staging area - когда много источников и нужно несколько стадий комбинации данных
3) sources -> Staging_area -> Warehouse -> Data Marts -> Users
   - Data Marts - ускоренный слой - раздление данных по сферам деятельности
** Best Practices
1. project must be managed by both IT and business professionals. DW design must be tested, redesign is much
   more expensive.
2. should be built incrementally - with users respond. Users must be trained and absorb features of the system.
3. Only cleansed and high-quality data should be loaded. Quality and adaptability from the start.
** Dimensional modeling
for data warehouse design -  entity-relationship modeling (ER)
- facts (measures) - numeric values that can be aggregated
- dimensions (context) - descriptors that define the facts, date

For example, sales amount is a fact; timestamp, product, register#, store#, etc. are elements of dimensions

it is usually a good idea to split *date and time* into two or more separate dimensions.

** Loading
- Full load - completely replaced, no timestamp
- Incremental load
  - streaming incremental load - load only new.
  - batch incremental load - not easy to re-run the entire load if there's an error

Challenges:
- monitoring errors
- compatibility - когда меняется тип поля с integer на float
- order and dependencies
- reconcilation - ensure data in an ETL Data Warehouse is correct and consistent - continuous process

* OLAP
SQL and relational database reporting tools can certainly query, report on, and analyze multidimensional data
stored in tables, but performance slows down as the data volumes increase. And it requires a lot of work to
reorganize the results to focus on different dimensions.

An OLAP server returns new data to Excel every time that you change the layout of the report.

OLAP databases contain two basic types of data:
- measures - the quantities and averages that you use to make informed business decisions
- dimensions - which are the categories that you use to organize these measures

