BI.html
<div id="outline-container-org958e48e" class="outline-2">
<h2 id="org958e48e"><span class="section-number-2">5</span> Teory</h2>
<div class="outline-text-2" id="text-5">
<p>
data -&gt; data warehouse (information) -&gt; analytical tools (knowledge) -&gt; rules&amp;model (insights) -&gt; experience
</p>

<p>
help to two main kinds of decisions:
</p>
<ul class="org-ul">
<li>strategic decisions - direction of the company</li>
<li>operational decisions - routine and tactical decisions, for greater efficiency</li>
</ul>
</div>

<div id="outline-container-org605ad8f" class="outline-3">
<h3 id="org605ad8f"><span class="section-number-3">5.1</span> evolution</h3>
<div class="outline-text-3" id="text-5-1">
<p>
steps:
</p>
<ol class="org-ol">
<li>AWARE: Primary batched reports -  70% batch, 30% OLAP</li>
<li>DEVELOPING: ad-hoc queries and an-al data mining - 55% batch, OLAP 40%, 15% predictive modeling &amp; data
mining</li>
<li>PRACTICING: predictive - 30% batch, 45 OLAP, 30 mining</li>
<li>OPTIMIZING: predictive - 20% batch, 30 OLAP, 30 mining, 10 event-based triggering</li>
<li>LEADING: 20 20 20 20</li>
</ol>

<p>
stems 2:
</p>
<ul class="org-ul">
<li>manual spreadsheets - reports</li>
<li>data marts - KPIs</li>
<li>enterprise data warehouse</li>
<li>OLAP</li>
<li>propensity modeling - risk management</li>
<li>enterprise dashboard - events detection</li>
<li>relationship optimization</li>
</ul>
</div>
</div>

<div id="outline-container-org8a9f2a3" class="outline-3">
<h3 id="org8a9f2a3"><span class="section-number-3">5.2</span> DW Development Approaches</h3>
<div class="outline-text-3" id="text-5-2">
<dl class="org-dl">
<dt>top-down</dt><dd>Bill Inmon - Date Warehouse first</dd>
<dt>bottom-up</dt><dd>Kimball - Data Mart created first</dd>
</dl>
<p>
Disadvantages Of Top Down Design :
</p>
<ul class="org-ul">
<li>It represents a very large project and the cost of implementing the project is significant.</li>
<li>It is time consuming and more time required for initial set up</li>
<li>Highly skilled people required for set up</li>
</ul>


<p>
Disadvantage of Bottom Up Design  :
</p>
<ul class="org-ul">
<li>Initial cost is low but each subsequent phase will cost same</li>
<li>The positions of the data warehouse and the data marts are reversed in the bottom-up approach design.</li>
<li>It is difficult to maintain and often redundant and subject to revisions</li>
</ul>

<p>
Стандарт де факто, две базы (Data Warehouse and OLAP):
</p>
<ul class="org-ul">
<li>компактное хранение детализированных данных и поддержка очень больших БД, обеспечиваемые реляционными СУБД;</li>
<li>простота настройки и хорошие времена отклика, при работе с агрегированными данными, обеспечиваемые многомерными СУБД.</li>
</ul>
</div>
</div>
<div id="outline-container-org7b5001c" class="outline-3">
<h3 id="org7b5001c"><span class="section-number-3">5.3</span> Architecture - Организационная зрелость</h3>
<div class="outline-text-3" id="text-5-3">
<ol class="org-ol">
<li>sources -&gt; Warehouse -&gt; Users</li>
<li>sources -&gt; Staging<sub>area</sub> -&gt; Warehouse -&gt; Users
<ul class="org-ul">
<li>Staging area - когда много источников и нужно несколько стадий комбинации данных</li>
</ul></li>
<li>sources -&gt; Staging<sub>area</sub> -&gt; Warehouse -&gt; Data Marts -&gt; Users
<ul class="org-ul">
<li>Data Marts - ускоренный слой - раздление данных по сферам деятельности</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org073a45b" class="outline-3">
<h3 id="org073a45b"><span class="section-number-3">5.4</span> Best Practices</h3>
<div class="outline-text-3" id="text-5-4">
<ol class="org-ol">
<li>project must be managed by both IT and business professionals. DW design must be tested, redesign is much
more expensive.</li>
<li>should be built incrementally - with users respond. Users must be trained and absorb features of the system.</li>
<li>Only cleansed and high-quality data should be loaded. Quality and adaptability from the start.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd00d71f" class="outline-3">
<h3 id="orgd00d71f"><span class="section-number-3">5.5</span> Dimensional modeling</h3>
<div class="outline-text-3" id="text-5-5">
<p>
for data warehouse design -  entity-relationship modeling (ER)
</p>
<ul class="org-ul">
<li>facts (measures) - numeric values that can be aggregated</li>
<li>dimensions (context) - descriptors that define the facts, date</li>
</ul>

<p>
For example, sales amount is a fact; timestamp, product, register#, store#, etc. are elements of dimensions
</p>

<p>
it is usually a good idea to split <b>date and time</b> into two or more separate dimensions.
</p>
</div>
</div>

<div id="outline-container-orge5d2299" class="outline-3">
<h3 id="orge5d2299"><span class="section-number-3">5.6</span> Loading</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>Full load - completely replaced, no timestamp</li>
<li>Incremental load
<ul class="org-ul">
<li>streaming incremental load - load only new.</li>
<li>batch incremental load - not easy to re-run the entire load if there's an error</li>
</ul></li>
</ul>

<p>
Challenges:
</p>
<ul class="org-ul">
<li>monitoring errors</li>
<li>compatibility - когда меняется тип поля с integer на float</li>
<li>order and dependencies</li>
<li>reconcilation - ensure data in an ETL Data Warehouse is correct and consistent - continuous process</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfadb817" class="outline-2">
<h2 id="orgfadb817"><span class="section-number-2">6</span> OLAP</h2>
<div class="outline-text-2" id="text-6">
<p>
SQL and relational database reporting tools can certainly query, report on, and analyze multidimensional data
stored in tables, but performance slows down as the data volumes increase. And it requires a lot of work to
reorganize the results to focus on different dimensions.
</p>

<p>
An OLAP server returns new data to Excel every time that you change the layout of the report.
</p>

<p>
OLAP databases contain two basic types of data:
</p>
<ul class="org-ul">
<li>measures - the quantities and averages that you use to make informed business decisions</li>
<li>dimensions - which are the categories that you use to organize these measures</li>
</ul>
</div>
