BI.org
** OLAP terms:
- cube - data structure
- Measure - central value in cube
- Member - item in a hierarchy representing one or more occurrences of data.
  - For example, 2007 and 2008 represent unique members in the year level of a time dimension, whereas January
    represents nonunique members in the month level because there can be more than one January in the time
    dimension if it contains data for more than one year.
- Calculated member - A member of a dimension whose value is calculated at run time by using an expression.
  - For example, a calculated member, Profit, can be determined by subtracting the value of the member, Costs,
    from the value of the member, Sales.
- Dimension - A set of one or more organized hierarchies of levels in a cube that a user understands and uses
  as the base for data analysis.
- Hierarchy - A logical tree structure that organizes the members of a dimension such that each member has one
  parent member and zero or more child members.
  - ex. Time hierarchy containing the levels Quarter, Month, and Day, January is a child of Qtr
- Level - Year, Quarter, Month, and Day levels in a Time hierarchy.
** Типы OLAP <<OLAP_types>>
*MOLAP (Multidimensional OLAP)* содержит детальные и агрегированные данные
Преимущества:
 - Высокая производительность
 - Структура и интерфейсы наилучшим образом соответствуют структуре аналитических запросов.
 - есть разные встроенные функции
Недостатки:
 - Дороги, патентованные технологии
 - неэффективно используется внешняя памятью. Плохие механизмы транзакций
 - Отстутствие единых стандартов
 - Не поддерживают репликацию данные, часто используемую для загрузки данных

*ROLAP (Relational OLAP)* гиперкуб эмулируется из таблиц на логическом уровне
Преимущества:
 - размер хранилища не является критичным, развитые средства администрирования
 - так как источники обычно в реляционных СУБД то это более совместимо
 - частые изменения структуры измерений легче чем в MOLAP
 - менее требовательны к выч мощности
 Недостатки:
 - ограниченные возможности с точки зрения расчета значений функционального типа????
 - меньшая производительность

*HOLAP (Hybrid OLAP)* детальные данные остаются в реляционной базе, агрегатные данные хранятся в многомерной

** SQL OLAP extension
- SQL-99 introduced three extensions to the GROUP BY statement: the CUBE, ROLLUP and GROUPING SETS operator.
  https://www.kdnuggets.com/2018/09/olap-queries-sql-refresher.html
** Oracle OLAP
Oracle Database 11g, the Oracle database optimizer can transparently redirect SQL queries to levels within the
OLAP Option cubes. The cubes are managed and can take the place of multi-dimensional materialized views,
simplifying Oracle data-warehouse management and speeding up query response.

- OLAP DML for DDL and DML
- an interface from SQL
*** links
- https://www.kdnuggets.com/2018/09/olap-queries-sql-refresher.html
** API
- OLE DB for OLAP - 1997
- MDX query language - became the de facto standard
- XML for Analysis - In 2001 Microsoft and Hyperion announced
- LINQ - used to query SSAS OLAP cubes from Microsoft .NET.
** features
- query on raw data
- “connect live” model
* data warehouse and any data intergration system modeling
- staging database - reduce the number of reads from the source operational system.
  - load data as-is from the data source into the staging database on a regular schedule.
  - separated your transformation dataflows from the staging dataflows
- Layered architecture - staging and transformation dataflows can be two layers of a multilayered dataflow -
  separate tables

** TODO Normalization vs. denormalization

