BI.html

<div id="outline-container-org6e70e2e" class="outline-3">
<h3 id="org6e70e2e"><span class="section-number-3">6.1</span> OLAP terms:</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>cube - data structure</li>
<li>Measure - central value in cube</li>
<li>Member - item in a hierarchy representing one or more occurrences of data.
<ul class="org-ul">
<li>For example, 2007 and 2008 represent unique members in the year level of a time dimension, whereas January
represents nonunique members in the month level because there can be more than one January in the time
dimension if it contains data for more than one year.</li>
</ul></li>
<li>Calculated member - A member of a dimension whose value is calculated at run time by using an expression.
<ul class="org-ul">
<li>For example, a calculated member, Profit, can be determined by subtracting the value of the member, Costs,
from the value of the member, Sales.</li>
</ul></li>
<li>Dimension - A set of one or more organized hierarchies of levels in a cube that a user understands and uses
as the base for data analysis.</li>
<li>Hierarchy - A logical tree structure that organizes the members of a dimension such that each member has one
parent member and zero or more child members.
<ul class="org-ul">
<li>ex. Time hierarchy containing the levels Quarter, Month, and Day, January is a child of Qtr</li>
</ul></li>
<li>Level - Year, Quarter, Month, and Day levels in a Time hierarchy.</li>
</ul>
</div>
</div>
<div id="outline-container-org1290a81" class="outline-3">
<h3 id="org1290a81"><span class="section-number-3">6.2</span> Типы OLAP <a id="org100e10b"></a></h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>MOLAP (Multidimensional OLAP)</b> содержит детальные и агрегированные данные
Преимущества:
</p>
<ul class="org-ul">
<li>Высокая производительность</li>
<li>Структура и интерфейсы наилучшим образом соответствуют структуре аналитических запросов.</li>
<li>есть разные встроенные функции</li>
</ul>
<p>
Недостатки:
</p>
<ul class="org-ul">
<li>Дороги, патентованные технологии</li>
<li>неэффективно используется внешняя памятью. Плохие механизмы транзакций</li>
<li>Отстутствие единых стандартов</li>
<li>Не поддерживают репликацию данные, часто используемую для загрузки данных</li>
</ul>

<p>
<b>ROLAP (Relational OLAP)</b> гиперкуб эмулируется из таблиц на логическом уровне
Преимущества:
</p>
<ul class="org-ul">
<li>размер хранилища не является критичным, развитые средства администрирования</li>
<li>так как источники обычно в реляционных СУБД то это более совместимо</li>
<li>частые изменения структуры измерений легче чем в MOLAP</li>
<li>менее требовательны к выч мощности</li>
</ul>
<p>
Недостатки:
</p>
<ul class="org-ul">
<li>ограниченные возможности с точки зрения расчета значений функционального типа????</li>
<li>меньшая производительность</li>
</ul>

<p>
<b>HOLAP (Hybrid OLAP)</b> детальные данные остаются в реляционной базе, агрегатные данные хранятся в многомерной
</p>
</div>
</div>

<div id="outline-container-org6d45199" class="outline-3">
<h3 id="org6d45199"><span class="section-number-3">6.3</span> SQL OLAP extension</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>SQL-99 introduced three extensions to the GROUP BY statement: the CUBE, ROLLUP and GROUPING SETS operator.
<a href="https://www.kdnuggets.com/2018/09/olap-queries-sql-refresher.html">https://www.kdnuggets.com/2018/09/olap-queries-sql-refresher.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1a02f53" class="outline-3">
<h3 id="org1a02f53"><span class="section-number-3">6.4</span> Oracle OLAP</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Oracle Database 11g, the Oracle database optimizer can transparently redirect SQL queries to levels within the
OLAP Option cubes. The cubes are managed and can take the place of multi-dimensional materialized views,
simplifying Oracle data-warehouse management and speeding up query response.
</p>

<ul class="org-ul">
<li>OLAP DML for DDL and DML</li>
<li>an interface from SQL</li>
</ul>
</div>
<div id="outline-container-org51616ee" class="outline-4">
<h4 id="org51616ee"><span class="section-number-4">6.4.1</span> links</h4>
<div class="outline-text-4" id="text-6-4-1">
<ul class="org-ul">
<li><a href="https://www.kdnuggets.com/2018/09/olap-queries-sql-refresher.html">https://www.kdnuggets.com/2018/09/olap-queries-sql-refresher.html</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org55bb27b" class="outline-3">
<h3 id="org55bb27b"><span class="section-number-3">6.5</span> API</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li>OLE DB for OLAP - 1997</li>
<li>MDX query language - became the de facto standard</li>
<li>XML for Analysis - In 2001 Microsoft and Hyperion announced</li>
<li>LINQ - used to query SSAS OLAP cubes from Microsoft .NET.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc9d2c6a" class="outline-3">
<h3 id="orgc9d2c6a"><span class="section-number-3">6.6</span> features</h3>
<div class="outline-text-3" id="text-6-6">
<ul class="org-ul">
<li>query on raw data</li>
<li>“connect live” model</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8926b46" class="outline-2">
<h2 id="org8926b46"><span class="section-number-2">7</span> data warehouse and any data intergration system modeling</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>staging database - reduce the number of reads from the source operational system.
<ul class="org-ul">
<li>load data as-is from the data source into the staging database on a regular schedule.</li>
<li>separated your transformation dataflows from the staging dataflows</li>
</ul></li>
<li>Layered architecture - staging and transformation dataflows can be two layers of a multilayered dataflow -
separate tables</li>
</ul>
</div>

<div id="outline-container-org2152125" class="outline-3">
<h3 id="org2152125"><span class="section-number-3">7.1</span> <span class="todo TODO">TODO</span> Normalization vs. denormalization</h3>
</div>
