BI.html

<div id="outline-container-org30b36a3" class="outline-3">
<h3 id="org30b36a3"><span class="section-number-3">7.2</span> star schema - best data warehouse model  <a id="org6d68379"></a></h3>
<div class="outline-text-3" id="text-7-2">
<p>
pros
</p>
<ul class="org-ul">
<li>to minimize the amount of time to query the data from the model</li>
<li>easy to understand for the data visualizer</li>
<li>простая структура и запросы</li>
<li>некоторые промышленные СУБД имею инструменты класса OLAP/Reporting работающие со звездой</li>
</ul>
<p>
Недостатки:
</p>
<ul class="org-ul">
<li>Денормализация вносит избыточность данных</li>
<li>Если агрегаты с исходными данными то в таблицах измерений дополнительный параметр  level ????</li>
</ul>

<p>
The data tables should be remodeled
</p>
<ul class="org-ul">
<li>dimension tables, which keeps the descriptive information
<ul class="org-ul">
<li>Entities can include products, people, places, and concepts including time itself.</li>
<li>date dimension table - most consistent table</li>
<li>for filtering and grouping</li>
</ul></li>
<li>one fact table, to keep the aggregable data
<ul class="org-ul">
<li>observations or events</li>
<li>сильно денормализована. Большое кол во строк</li>
<li>for summarization</li>
</ul></li>
</ul>

<p>
terms
</p>
<ul class="org-ul">
<li>dimensionality - dimension key columns</li>
<li>granularity - dimension key values</li>
</ul>

<p>
<b>Снежинка Snowflake Schema</b> - то же самаое, только у каждой dimensional table может быть еще dimensional table
</p>

<p>
То же что и звезда, только одно измерение может быть в нескольких таблицах - так реализуется многоуровневость.
Дополнительные таблицы измерений называют outrigger table. Например категоря для продуктов - измерения для
прода.  Преимущество: минимизация избыточности измерений и более эффективно выполнять запросы со структурой
измерений Недостаток - за нормализацию платить временем выполнения
</p>
</div>
</div>

<div id="outline-container-org14ab139" class="outline-3">
<h3 id="org14ab139"><span class="section-number-3">7.3</span> Data Model</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>design of data warehouse.</li>
</ul>
<p>
At highest level, the data model is an <b>Entry relationship diagram(ERD)</b> - represents only granular data and no derived data.
<b>ERD</b> - consist of <span class="underline">Entities</span> and relationships.
Entities is futher detailed in <b>data item set(DIS)</b> - keys and attributes and futher at <b>physical design</b> for database management system.
<b>physical aspects</b> - partitioning, loading, indexing, storage media, timestamping.
</p>

<p>
One table relates to another by means of shared key or foreign key relationship.
Table represent <b>subject area</b> or subset of <b>subject area</b>.
</p>
<ul class="org-ul">
<li>Customer</li>
<li>Product    [ˈprɒdʌkt]</li>
<li>Shipment [ˈʃɪpmənt]</li>
<li>Vendor     [ˈvɛndɔː] продавец</li>
<li>Order       [ˈɔːdə]</li>
</ul>

<p>
It is patently a mistake to build the data warehouse in an all-at-once or "big bang" approach.
</p>

<p>
<b>Extract/transfer/load ETL</b> software - create interface to bring the data into the world of data warehouse.
In SAP BW it is so-called <span class="underline">Staging Engine</span> to perform simple transformation and conversion.
</p>
</div>
</div>
<div id="outline-container-orgc9f27cc" class="outline-3">
<h3 id="orgc9f27cc"><span class="section-number-3">7.4</span> data mart</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Reasons to create a Data Mart from a Data Warehouse
</p>
<ul class="org-ul">
<li>To create a passive copy of a few fact tables that does not change frequently for the purpose of analysis.</li>
<li>To decrease the query load on a data warehouse. A copy of the fact table is created in a separate database
located on a different server, and the reports are pointed to this server.</li>
<li>To simulate the critical business scenarios by changing the data in a data mart. The data in a data
warehouse cannot be manipulated without affecting the performance.</li>
</ul>
<p>
<a href="https://www.wideskills.com/data-warehousing/data-marts">https://www.wideskills.com/data-warehousing/data-marts</a>
</p>

<p>
cons
</p>
<ul class="org-ul">
<li>The continuous implementation of data marts poses a problem of tracking.</li>
<li>The numerous activities of data extractions, administration, and environmental impacts increase the hardware
and software expenses</li>
</ul>
</div>
</div>
<div id="outline-container-org9568ee3" class="outline-3">
<h3 id="org9568ee3"><span class="section-number-3">7.5</span> Dimensional modeling</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li><a href="https://www.intuit.ru/studies/courses/1145/214/lecture/5508?page=1">https://www.intuit.ru/studies/courses/1145/214/lecture/5508?page=1</a></li>
<li><a href="https://www.intuit.ru/studies/courses/1145/214/lecture/5508?page=2">https://www.intuit.ru/studies/courses/1145/214/lecture/5508?page=2</a></li>
</ul>

<p>
Data modelling is mainly about providing organization and understanding to the data. The advantages you stated
hold true regardless of the database platform you use.
</p>

<p>
columnar [kəˈlʌmnə] database:
</p>
<div class="org-src-container">
<pre class="src src-text">  About the only design decision that changes when using a columnar database is what to do with row level free
  form comments that one occasionally runs into. In a row oriented database the best practice is to put them in
  a junk dimension so the physical size of the data doesn't impead performance of queries that don't need the
  data. That is not the case with a columnar arrangement. In such a database, all it means is more vectors which
  are ignored if queries don't need the data. And, in fact, the number and size of such vectors would be the
  same had you created a separate dimension anyway... so there is no point in breaking such data out.
</pre>
</div>
<p>
Типы OLAP <a href="#org100e10b">6.2</a>
</p>
</div>
<div id="outline-container-org27d4956" class="outline-4">
<h4 id="org27d4956"><span class="section-number-4">7.5.1</span> Моделирование многомерных кубов на реляционной модели данных:</h4>
<div class="outline-text-4" id="text-7-5-1">
<p>
<b>Звезда Star Schema</b>
<b>Снежинка Snowflake Schema</b> - то же самаое, только у каждой dimensional table может быть еще dimensional table
see <a href="#org6d68379">7.2</a>
</p>
</div>
</div>
