BI.md


<a id="org149c0d5"></a>

## star schema - best data warehouse model  <a id="org756758d"></a>

pros

-   to minimize the amount of time to query the data from the model
-   easy to understand for the data visualizer
-   простая структура и запросы
-   некоторые промышленные СУБД имею инструменты класса OLAP/Reporting работающие со звездой

Недостатки:

-   Денормализация вносит избыточность данных
-   Если агрегаты с исходными данными то в таблицах измерений дополнительный параметр  level ????

The data tables should be remodeled

-   dimension tables, which keeps the descriptive information
    -   Entities can include products, people, places, and concepts including time itself.
    -   date dimension table - most consistent table
    -   for filtering and grouping
-   one fact table, to keep the aggregable data
    -   observations or events
    -   сильно денормализована. Большое кол во строк
    -   for summarization

terms

-   dimensionality - dimension key columns
-   granularity - dimension key values

**Снежинка Snowflake Schema** - то же самаое, только у каждой dimensional table может быть еще dimensional table

То же что и звезда, только одно измерение может быть в нескольких таблицах - так реализуется многоуровневость.
Дополнительные таблицы измерений называют outrigger table. Например категоря для продуктов - измерения для
прода.  Преимущество: минимизация избыточности измерений и более эффективно выполнять запросы со структурой
измерений Недостаток - за нормализацию платить временем выполнения


<a id="org1c65d8a"></a>

## Data Model

-   design of data warehouse.

At highest level, the data model is an **Entry relationship diagram(ERD)** - represents only granular data and no derived data.
**ERD** - consist of <span class="underline">Entities</span> and relationships.
Entities is futher detailed in **data item set(DIS)** - keys and attributes and futher at **physical design** for database management system.
**physical aspects** - partitioning, loading, indexing, storage media, timestamping.

One table relates to another by means of shared key or foreign key relationship.
Table represent **subject area** or subset of **subject area**.

-   Customer
-   Product    [ˈprɒdʌkt]
-   Shipment [ˈʃɪpmənt]
-   Vendor     [ˈvɛndɔː] продавец
-   Order       [ˈɔːdə]

It is patently a mistake to build the data warehouse in an all-at-once or "big bang" approach.

**Extract/transfer/load ETL** software - create interface to bring the data into the world of data warehouse.
In SAP BW it is so-called <span class="underline">Staging Engine</span> to perform simple transformation and conversion.


<a id="org4486428"></a>

## data mart

Reasons to create a Data Mart from a Data Warehouse

-   To create a passive copy of a few fact tables that does not change frequently for the purpose of analysis.
-   To decrease the query load on a data warehouse. A copy of the fact table is created in a separate database
    located on a different server, and the reports are pointed to this server.
-   To simulate the critical business scenarios by changing the data in a data mart. The data in a data
    warehouse cannot be manipulated without affecting the performance.

<https://www.wideskills.com/data-warehousing/data-marts>

cons

-   The continuous implementation of data marts poses a problem of tracking.
-   The numerous activities of data extractions, administration, and environmental impacts increase the hardware
    and software expenses


<a id="org06b0004"></a>

## Dimensional modeling

-   <https://www.intuit.ru/studies/courses/1145/214/lecture/5508?page=1>
-   <https://www.intuit.ru/studies/courses/1145/214/lecture/5508?page=2>

Data modelling is mainly about providing organization and understanding to the data. The advantages you stated
hold true regardless of the database platform you use.

columnar [kəˈlʌmnə] database:

    About the only design decision that changes when using a columnar database is what to do with row level free
    form comments that one occasionally runs into. In a row oriented database the best practice is to put them in
    a junk dimension so the physical size of the data doesn't impead performance of queries that don't need the
    data. That is not the case with a columnar arrangement. In such a database, all it means is more vectors which
    are ignored if queries don't need the data. And, in fact, the number and size of such vectors would be the
    same had you created a separate dimension anyway... so there is no point in breaking such data out.

Типы OLAP [6.2](#orgc5fb1e6)


<a id="orge8bfd72"></a>

### Моделирование многомерных кубов на реляционной модели данных:

**Звезда Star Schema**
**Снежинка Snowflake Schema** - то же самаое, только у каждой dimensional table может быть еще dimensional table
see [7.2](#org756758d)
