BI.html
<div id="outline-container-orgd388836" class="outline-4">
<h4 id="orgd388836"><span class="section-number-4">7.5.2</span> виды fact table</h4>
<div class="outline-text-4" id="text-7-5-2">
<ul class="org-ul">
<li>Transactional
<ul class="org-ul">
<li>by product</li>
<li>в отчете нужно вычислять сумму или на дату</li>
</ul></li>
<li>Snapshot
<ul class="org-ul">
<li>count after month - range of dates</li>
<li>в отчете нужно находить промежуточные значения</li>
</ul></li>
<li>Accumulater
<ul class="org-ul">
<li>by phases/stages of product</li>
<li>в отчете столбцы прикрепляются</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5baef94" class="outline-3">
<h3 id="org5baef94"><span class="section-number-3">7.6</span> <span class="todo TODO">TODO</span> links</h3>
<div class="outline-text-3" id="text-7-6">
<p>
<a href="https://docs.microsoft.com/en-us/power-query/dataflows/best-practices-for-data-warehouse-using-dataflows">https://docs.microsoft.com/en-us/power-query/dataflows/best-practices-for-data-warehouse-using-dataflows</a>
draw ER diagrams online <a href="http://dbdiagram.io">http://dbdiagram.io</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org987bd4d" class="outline-2">
<h2 id="org987bd4d"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Predictive analytics</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Predictive_analytics">https://en.wikipedia.org/wiki/Predictive_analytics</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd2324c1" class="outline-2">
<h2 id="orgd2324c1"><span class="section-number-2">9</span> виды софта</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>data visualization tools
<ul class="org-ul">
<li>Apache Superset</li>
<li>Apache Zeppelin</li>
<li>Power BI (Windows)</li>
<li>Grafana</li>
<li>Redash</li>
<li>Metabase</li>
<li>Tableau</li>
</ul></li>
<li>Spreadsheets</li>
<li>Reporting and querying software: applications that extract, sort, summarize, and present selected data</li>
<li>Online analytical processing (OLAP)</li>
<li>Digital dashboards</li>
<li>Data mining</li>
<li>Business activity monitoring</li>
<li>Data warehouse[7]</li>
<li>Local information systems</li>
<li>Data cleansing[8]</li>
<li>Dashboards - at-a-glance views of key performance indicators (KPIs). displayed on a web page which is linked</li>
</ul>
<p>
to a database that allows the report to be constantly updated
</p>
</div>
</div>
<div id="outline-container-org6eff08e" class="outline-2">
<h2 id="org6eff08e"><span class="section-number-2">10</span> Types of database management software</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>traditional relational database management systems</li>
<li>analytic database management software
<ul class="org-ul">
<li>in-memory database</li>
<li>parallel database seeks to improve performance through parallelization for tasks such as loading data,
building indexes and evaluating queries.
<ul class="org-ul">
<li>Shared memory architecture</li>
<li>Shared disk architecture</li>
<li>Shared-nothing architecture</li>
</ul></li>
<li>Column-oriented DBMS - more efficient access to data when only querying a subset of columns and more
options for data compression,  less efficient for inserting new data</li>
<li>online analytical processing (OLAP) - support SQL OLAP extensions or realize own OLAP operations. Data is
organazed in such way to form OLAP cubes.</li>
</ul></li>
<li>active database - includes an event-driven architecture - Possible uses include security monitoring,
alerting, statistics gathering and authorization</li>
<li>in-memory database</li>
<li>document-oriented database is designed for storing, retrieving, and managing document-oriented</li>
<li>graph database is a kind of NoSQL database that uses graph structures with nodes, edges, and properties to
represent and store information</li>
</ul>
</div>
</div>
<div id="outline-container-org9ade97b" class="outline-2">
<h2 id="org9ade97b"><span class="section-number-2">11</span> <span class="todo TODO">TODO</span> problem Change-Data Capture (DELETE UPDATE)</h2>
<div class="outline-text-2" id="text-11">
<p>
MariaDB Platform - two Transactional + Analitical DB with replication
Update:
</p>
<ul class="org-ul">
<li>Oracle: PLSQL with row versions</li>
</ul>
</div>
</div>
<div id="outline-container-orge1e76f1" class="outline-2">
<h2 id="orge1e76f1"><span class="section-number-2">12</span> time-to-market</h2>
<div class="outline-text-2" id="text-12">
<p>
In a market with 20% annual growth and 12% price-drop per annum,
technological products which arrive on the market six months late but
on budget generate 33% less profit over five years, whereas getting
the product to market on time but 50% over budget only reduces profits
by 4%.  (Ali et al., 1995).
</p>

<p>
На рынке с 20% годовым ростом и 12% падением цены.
Продукты которые прибывают с опозданием на 6 месяцев генерируют на 33% меньше прибыли в течении 5 лет.
В то время как продукты с 50% over budget приходящие вовремя генерируют прибыль только на 4% меньше.
</p>
</div>
</div>
