BI.md


<a id="org05e72bf"></a>

### виды fact table

-   Transactional
    -   by product
    -   в отчете нужно вычислять сумму или на дату
-   Snapshot
    -   count after month - range of dates
    -   в отчете нужно находить промежуточные значения
-   Accumulater
    -   by phases/stages of product
    -   в отчете столбцы прикрепляются


<a id="org5a6a8e8"></a>

## TODO links

<https://docs.microsoft.com/en-us/power-query/dataflows/best-practices-for-data-warehouse-using-dataflows>
draw ER diagrams online <http://dbdiagram.io>


<a id="orgbe28b3b"></a>

# TODO Predictive analytics

-   <https://en.wikipedia.org/wiki/Predictive_analytics>


<a id="org5786f9d"></a>

# виды софта

-   data visualization tools
    -   Apache Superset
    -   Apache Zeppelin
    -   Power BI (Windows)
    -   Grafana
    -   Redash
    -   Metabase
    -   Tableau
-   Spreadsheets
-   Reporting and querying software: applications that extract, sort, summarize, and present selected data
-   Online analytical processing (OLAP)
-   Digital dashboards
-   Data mining
-   Business activity monitoring
-   Data warehouse[7]
-   Local information systems
-   Data cleansing[8]
-   Dashboards - at-a-glance views of key performance indicators (KPIs). displayed on a web page which is linked

to a database that allows the report to be constantly updated


<a id="orgeba8910"></a>

# Types of database management software

-   traditional relational database management systems
-   analytic database management software
    -   in-memory database
    -   parallel database seeks to improve performance through parallelization for tasks such as loading data,
        building indexes and evaluating queries.
        -   Shared memory architecture
        -   Shared disk architecture
        -   Shared-nothing architecture
    -   Column-oriented DBMS - more efficient access to data when only querying a subset of columns and more
        options for data compression,  less efficient for inserting new data
    -   online analytical processing (OLAP) - support SQL OLAP extensions or realize own OLAP operations. Data is
        organazed in such way to form OLAP cubes.
-   active database - includes an event-driven architecture - Possible uses include security monitoring,
    alerting, statistics gathering and authorization
-   in-memory database
-   document-oriented database is designed for storing, retrieving, and managing document-oriented
-   graph database is a kind of NoSQL database that uses graph structures with nodes, edges, and properties to
    represent and store information


<a id="org1a7c536"></a>

# TODO problem Change-Data Capture (DELETE UPDATE)

MariaDB Platform - two Transactional + Analitical DB with replication
Update:

-   Oracle: PLSQL with row versions


<a id="orgd37fe9b"></a>

# time-to-market

In a market with 20% annual growth and 12% price-drop per annum,
technological products which arrive on the market six months late but
on budget generate 33% less profit over five years, whereas getting
the product to market on time but 50% over budget only reduces profits
by 4%.  (Ali et al., 1995).

На рынке с 20% годовым ростом и 12% падением цены.
Продукты которые прибывают с опозданием на 6 месяцев генерируют на 33% меньше прибыли в течении 5 лет.
В то время как продукты с 50% over budget приходящие вовремя генерируют прибыль только на 4% меньше.
