BI.org
* выбор 2019
*OLAP* https://en.wikipedia.org/wiki/Comparison_of_OLAP_servers
- Apache Kylin - Hadoop required
- Druid -  Java - OLAP загрузка из всего, поддержка Kafka + Apache Superset- business intelligence web application
  https://www.youtube.com/watch?v=24mvzMTdYXQ
  - платная поддержка https://imply.io/services https://hortonworks.com/open-source/druid/
  - require:
    - MySQL or PostgreSQL or Derby(test) - есть предсказуемый запас времени при отказе - можно заменить на
      Cassandra-based DB
    - ZooKeeper
    - В организации есть эксперты по Java
  - pros
    - быстро
    - масштабируемость - distributed data store - Большой кластер
    - open-source
    - предагрегация
    - Apache Superset GUI native support
      - LDAP
      - высокая интерактивность
- ClickHouse OLAP (yandex) - C++ - https://clickhouse.yandex https://www.youtube.com/watch?v=w1-XsL3nbRg
  https://www.youtube.com/watch?v=PLMSA_gDdyM
  - GUI
    - tabix https://www.youtube.com/watch?v=w1-XsL3nbRg
    - Apache Superset
    - Apache Zeppelin - Web-based notebook that enables data-driven, interactive data analytics and
      collaborative documents
    - Grafana
  - платная поддержка https://www.altinity.com/
  - pros
    - Linear scalability. It's possible to extend a cluster by adding servers. - Малый кластер
  - cons:
    - no transactions.
    - В организации есть эксперты по C++
- Apache Pinot - OLAP
- Jedox OLAP Server - in-Memory Database - не хранит offline
- Apache Pinot (Incubating)
- Pentaho BI Suite - OLAP - есть CE но поменялась компания 2017. 2017 stable
  - Mondrian - 2017
  - cons - много ограничений. Сравнение EE и CΕ https://youtu.be/Z9gSDaQQscE?t=2467
- JasperReports
  - JasperReports Server
  - Jaspersoft® Studio - design and run report templates Eclipse-based
  - JasperReports Library
  - Jaspersoft ETL - 2016
  - pros:
    - OLAP
    - богатый GUI
    - ювелирный построитель отчетов для A4 HTML, PDF, Excel, OpenOffice and Word.
    - история начиная с 2001 года.
    - Ability to make modifications to underlying data cube
  - cons:
    - серьезные ограничения по функционалу в каждом продукте, но без лимитов
    - мало стороннего софта поддерживающего JasperReports Server
    - закрытый код

Data Science:
- Metabase - simple but friendly
- https://reportserver.net ‐ EN only
- BIRT Project - OLAP - Eclipse Public License - устарел

* SQL builder tools
- DBeaver
- aginity.com
* APEX Oracle
Oracle Application Express (APEX) - low-code development platform to build complex web applications
which can be used in most modern web browsers.
- web-based
- shipped with Oracle database, installed by default

*Workspace* is a logical domain where you define APEX applications
- associated with one or more database schemas (database users) which are used to store

Has:
- App Builder
- SQL Workshop - create and maintain database objects
- App Gallery - apps samples

https://explorer.co.uk/loading-excel-into-apex-19-1/
- APEX_DATA_PARSER API package https://blogs.oracle.com/apex/super-easy-csv-xlsx-json-or-xml-parsing-about-the-apex_data_parser-package

upload methods https://www.slideshare.net/JeffreyKemp1/apex-data-loading-ausoug-2018
- External Table / SQL*Loader ( from file on server)
- XML – native SQL using XMLType
- APEX Data Workshop (SQL Workshop - Utils - Data Workshop) (App Builder - Create - From File)
- APEX Data Loader Wizard (Create App with page Data Loader) ( Fixed!)
- Alexandria CSV_UTIL_PKG (Fixed)
- LOB2Table
- Excel2Collection (plug-in)

** upload Excel file
https://oracle.github.io/learning-library/developer-library/apex/spreadsheet/?page=README&lab=lab-1-create-app-spreadsheet
https://blogs.oracle.com/apex/quick-and-easy-data-loading-with-apex-191

** create app upload from file
1) Create new Workspace в INTERNAL workspace
   - create schema
   - schema password
   - create user of workspace
2) Посмотреть название схемы и имя пользоватяля
3) Залогиниться под ним в workspace
4) Create Applicateion - Upload from file
   - upload file
   - ввсети название для Таблицы

