BI.html
<div id="outline-container-org9fab7b3" class="outline-2">
<h2 id="org9fab7b3"><span class="section-number-2">13</span> выбор 2019</h2>
<div class="outline-text-2" id="text-13">
<p>
<b>OLAP</b> <a href="https://en.wikipedia.org/wiki/Comparison_of_OLAP_servers">https://en.wikipedia.org/wiki/Comparison_of_OLAP_servers</a>
</p>
<ul class="org-ul">
<li>Apache Kylin - Hadoop required</li>
<li>Druid -  Java - OLAP загрузка из всего, поддержка Kafka + Apache Superset- business intelligence web application
<a href="https://www.youtube.com/watch?v=24mvzMTdYXQ">https://www.youtube.com/watch?v=24mvzMTdYXQ</a>
<ul class="org-ul">
<li>платная поддержка <a href="https://imply.io/services">https://imply.io/services</a> <a href="https://hortonworks.com/open-source/druid/">https://hortonworks.com/open-source/druid/</a></li>
<li>require:
<ul class="org-ul">
<li>MySQL or PostgreSQL or Derby(test) - есть предсказуемый запас времени при отказе - можно заменить на
Cassandra-based DB</li>
<li>ZooKeeper</li>
<li>В организации есть эксперты по Java</li>
</ul></li>
<li>pros
<ul class="org-ul">
<li>быстро</li>
<li>масштабируемость - distributed data store - Большой кластер</li>
<li>open-source</li>
<li>предагрегация</li>
<li>Apache Superset GUI native support
<ul class="org-ul">
<li>LDAP</li>
<li>высокая интерактивность</li>
</ul></li>
</ul></li>
</ul></li>
<li>ClickHouse OLAP (yandex) - C++ - <a href="https://clickhouse.yandex">https://clickhouse.yandex</a> <a href="https://www.youtube.com/watch?v=w1-XsL3nbRg">https://www.youtube.com/watch?v=w1-XsL3nbRg</a>
<a href="https://www.youtube.com/watch?v=PLMSA_gDdyM">https://www.youtube.com/watch?v=PLMSA_gDdyM</a>
<ul class="org-ul">
<li>GUI
<ul class="org-ul">
<li>tabix <a href="https://www.youtube.com/watch?v=w1-XsL3nbRg">https://www.youtube.com/watch?v=w1-XsL3nbRg</a></li>
<li>Apache Superset</li>
<li>Apache Zeppelin - Web-based notebook that enables data-driven, interactive data analytics and
collaborative documents</li>
<li>Grafana</li>
</ul></li>
<li>платная поддержка <a href="https://www.altinity.com/">https://www.altinity.com/</a></li>
<li>pros
<ul class="org-ul">
<li>Linear scalability. It's possible to extend a cluster by adding servers. - Малый кластер</li>
</ul></li>
<li>cons:
<ul class="org-ul">
<li>no transactions.</li>
<li>В организации есть эксперты по C++</li>
</ul></li>
</ul></li>
<li>Apache Pinot - OLAP</li>
<li>Jedox OLAP Server - in-Memory Database - не хранит offline</li>
<li>Apache Pinot (Incubating)</li>
<li>Pentaho BI Suite - OLAP - есть CE но поменялась компания 2017. 2017 stable
<ul class="org-ul">
<li>Mondrian - 2017</li>
<li>cons - много ограничений. Сравнение EE и CΕ <a href="https://youtu.be/Z9gSDaQQscE?t=2467">https://youtu.be/Z9gSDaQQscE?t=2467</a></li>
</ul></li>
<li>JasperReports
<ul class="org-ul">
<li>JasperReports Server</li>
<li>Jaspersoft® Studio - design and run report templates Eclipse-based</li>
<li>JasperReports Library</li>
<li>Jaspersoft ETL - 2016</li>
<li>pros:
<ul class="org-ul">
<li>OLAP</li>
<li>богатый GUI</li>
<li>ювелирный построитель отчетов для A4 HTML, PDF, Excel, OpenOffice and Word.</li>
<li>история начиная с 2001 года.</li>
<li>Ability to make modifications to underlying data cube</li>
</ul></li>
<li>cons:
<ul class="org-ul">
<li>серьезные ограничения по функционалу в каждом продукте, но без лимитов</li>
<li>мало стороннего софта поддерживающего JasperReports Server</li>
<li>закрытый код</li>
</ul></li>
</ul></li>
</ul>

<p>
Data Science:
</p>
<ul class="org-ul">
<li>Metabase - simple but friendly</li>
<li><a href="https://reportserver.net">https://reportserver.net</a> ‐ EN only</li>
<li>BIRT Project - OLAP - Eclipse Public License - устарел</li>
</ul>
</div>
</div>

<div id="outline-container-orgb1b9b90" class="outline-2">
<h2 id="orgb1b9b90"><span class="section-number-2">14</span> SQL builder tools</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>DBeaver</li>
<li>aginity.com</li>
</ul>
</div>
</div>
<div id="outline-container-org7e56e5a" class="outline-2">
<h2 id="org7e56e5a"><span class="section-number-2">15</span> APEX Oracle</h2>
<div class="outline-text-2" id="text-15">
<p>
Oracle Application Express (APEX) - low-code development platform to build complex web applications
which can be used in most modern web browsers.
</p>
<ul class="org-ul">
<li>web-based</li>
<li>shipped with Oracle database, installed by default</li>
</ul>

<p>
<b>Workspace</b> is a logical domain where you define APEX applications
</p>
<ul class="org-ul">
<li>associated with one or more database schemas (database users) which are used to store</li>
</ul>

<p>
Has:
</p>
<ul class="org-ul">
<li>App Builder</li>
<li>SQL Workshop - create and maintain database objects</li>
<li>App Gallery - apps samples</li>
</ul>

<p>
<a href="https://explorer.co.uk/loading-excel-into-apex-19-1/">https://explorer.co.uk/loading-excel-into-apex-19-1/</a>
</p>
<ul class="org-ul">
<li>APEX<sub>DATA</sub><sub>PARSER</sub> API package <a href="https://blogs.oracle.com/apex/super-easy-csv-xlsx-json-or-xml-parsing-about-the-apex_data_parser-package">https://blogs.oracle.com/apex/super-easy-csv-xlsx-json-or-xml-parsing-about-the-apex_data_parser-package</a></li>
</ul>

<p>
upload methods <a href="https://www.slideshare.net/JeffreyKemp1/apex-data-loading-ausoug-2018">https://www.slideshare.net/JeffreyKemp1/apex-data-loading-ausoug-2018</a>
</p>
<ul class="org-ul">
<li>External Table / SQL*Loader ( from file on server)</li>
<li>XML – native SQL using XMLType</li>
<li>APEX Data Workshop (SQL Workshop - Utils - Data Workshop) (App Builder - Create - From File)</li>
<li>APEX Data Loader Wizard (Create App with page Data Loader) ( Fixed!)</li>
<li>Alexandria CSV<sub>UTIL</sub><sub>PKG</sub> (Fixed)</li>
<li>LOB2Table</li>
<li>Excel2Collection (plug-in)</li>
</ul>
</div>

<div id="outline-container-orgfaad97a" class="outline-3">
<h3 id="orgfaad97a"><span class="section-number-3">15.1</span> upload Excel file</h3>
<div class="outline-text-3" id="text-15-1">
<p>
<a href="https://oracle.github.io/learning-library/developer-library/apex/spreadsheet/?page=README&amp;lab=lab-1-create-app-spreadsheet">https://oracle.github.io/learning-library/developer-library/apex/spreadsheet/?page=README&amp;lab=lab-1-create-app-spreadsheet</a>
<a href="https://blogs.oracle.com/apex/quick-and-easy-data-loading-with-apex-191">https://blogs.oracle.com/apex/quick-and-easy-data-loading-with-apex-191</a>
</p>
</div>
</div>

<div id="outline-container-org4820264" class="outline-3">
<h3 id="org4820264"><span class="section-number-3">15.2</span> create app upload from file</h3>
<div class="outline-text-3" id="text-15-2">
<ol class="org-ol">
<li>Create new Workspace в INTERNAL workspace
<ul class="org-ul">
<li>create schema</li>
<li>schema password</li>
<li>create user of workspace</li>
</ul></li>
<li>Посмотреть название схемы и имя пользоватяля</li>
<li>Залогиниться под ним в workspace</li>
<li>Create Applicateion - Upload from file
<ul class="org-ul">
<li>upload file</li>
<li>ввсети название для Таблицы</li>
</ul></li>
</ol>
</div>
</div>
