BI.org
** https://docs.oracle.com/en/database/oracle/application-express/18/data_load_wizard/
Creating a Data Load Wizard
** plugin
https://github.com/gopalmallya/csv2table
* Oracle
** column names and comments
#+begin_src sql
  SELECT * FROM  all_tab_columns "
                           "LEFT JOIN all_col_comments cc ON all_tab_columns.table_name = cc.table_name "
                           "AND cc.column_name = all_tab_columns.column_name "
                           "WHERE all_tab_columns.table_name = 'MART_NORMA_AUTO' "
                           "ORDER BY all_tab_columns.column_id

#+end_src
** column info
  "SELECT column_id, column_name, data_type, nullable, data_length, data_precision, data_scale, avg_col_len "
        "FROM user_tab_columns WHERE table_name = '"
        + target_table
        + "' ORDER BY column_id"
** all available tables
oc.cur.execute("SELECT distinct table_name FROM all_col_comments")
oc.cur.execute("SELECT distinct table_name FROM all_tab_columns")
oc.cur.execute("SELECT owner, table_name FROM sys.all_tables")
** get tables description
- SELECT table_name, comments FROM dba_tab_comments WHERE owner='OE' AND table_name='INVENTORIES';
- SELECT table_name, column_name, comments FROM dba_col_comments WHERE owner ='OE' AND table_name='INVENTORIES';

* Report and Dashboard (Data visualization)
Метаданные -  показывает BI системе каким образом организована система хранения данных источника или OLAP кубы
** terms
- dashboard [ˈdæʃbɔːd] - приборная панель
- план-факт - отчет о результатах по целям, три колонки: план, фактическое, выполнение в процентах, опционально дельта
** Design best practives
- 5-9 visualizations for each dashboard
- answer business questions
- visuals must be correct for business( in proper sequence)
- reveals details as needed
** Excel Power Pivot
 build a ROLAP model in Power Pivot, and use pivot tables to explore
** Power BI Desktop
Опирается на тип поля в запросе

Иерархия - Matrix with
- Row headers - Stepped layout indentation
