BI.html

<div id="outline-container-org007bc43" class="outline-3">
<h3 id="org007bc43"><span class="section-number-3">15.3</span> <a href="https://docs.oracle.com/en/database/oracle/application-express/18/data_load_wizard/">https://docs.oracle.com/en/database/oracle/application-express/18/data_load_wizard/</a></h3>
<div class="outline-text-3" id="text-15-3">
<p>
Creating a Data Load Wizard
</p>
</div>
</div>
<div id="outline-container-org121bec0" class="outline-3">
<h3 id="org121bec0"><span class="section-number-3">15.4</span> plugin</h3>
<div class="outline-text-3" id="text-15-4">
<p>
<a href="https://github.com/gopalmallya/csv2table">https://github.com/gopalmallya/csv2table</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org03caa0b" class="outline-2">
<h2 id="org03caa0b"><span class="section-number-2">16</span> Oracle</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org2732d5f" class="outline-3">
<h3 id="org2732d5f"><span class="section-number-3">16.1</span> column names and comments</h3>
<div class="outline-text-3" id="text-16-1">
<div class="org-src-container">
<pre class="src src-sql">  <span style="color: #8ac6f2; font-weight: bold;">SELECT</span> * <span style="color: #8ac6f2; font-weight: bold;">FROM</span>  all_tab_columns "
                           "<span style="color: #8ac6f2; font-weight: bold;">LEFT</span> <span style="color: #8ac6f2; font-weight: bold;">JOIN</span> all_col_comments cc <span style="color: #8ac6f2; font-weight: bold;">ON</span> all_tab_columns.<span style="color: #8ac6f2; font-weight: bold;">table_name</span> = cc.<span style="color: #8ac6f2; font-weight: bold;">table_name</span> "
                           "<span style="color: #8ac6f2; font-weight: bold;">AND</span> cc.<span style="color: #8ac6f2; font-weight: bold;">column_name</span> = all_tab_columns.<span style="color: #8ac6f2; font-weight: bold;">column_name</span> "
                           "<span style="color: #8ac6f2; font-weight: bold;">WHERE</span> all_tab_columns.<span style="color: #8ac6f2; font-weight: bold;">table_name</span> = <span style="color: #95e454;">'MART_NORMA_AUTO'</span> "
                           "<span style="color: #8ac6f2; font-weight: bold;">ORDER</span> <span style="color: #8ac6f2; font-weight: bold;">BY</span> all_tab_columns.column_id

</pre>
</div>
</div>
</div>
<div id="outline-container-org4fe3ae3" class="outline-3">
<h3 id="org4fe3ae3"><span class="section-number-3">16.2</span> column info</h3>
<div class="outline-text-3" id="text-16-2">
<p>
"SELECT column<sub>id</sub>, column<sub>name</sub>, data<sub>type</sub>, nullable, data<sub>length</sub>, data<sub>precision</sub>, data<sub>scale</sub>, avg<sub>col</sub><sub>len</sub> "
      "FROM user<sub>tab</sub><sub>columns</sub> WHERE table<sub>name</sub> = '"
</p>
<ul class="org-ul">
<li>target<sub>table</sub></li>
<li>"' ORDER BY column<sub>id</sub>"</li>
</ul>
</div>
</div>
<div id="outline-container-orgc295e08" class="outline-3">
<h3 id="orgc295e08"><span class="section-number-3">16.3</span> all available tables</h3>
<div class="outline-text-3" id="text-16-3">
<p>
oc.cur.execute("SELECT distinct table<sub>name</sub> FROM all<sub>col</sub><sub>comments</sub>")
oc.cur.execute("SELECT distinct table<sub>name</sub> FROM all<sub>tab</sub><sub>columns</sub>")
oc.cur.execute("SELECT owner, table<sub>name</sub> FROM sys.all<sub>tables</sub>")
</p>
</div>
</div>
<div id="outline-container-org5d51f96" class="outline-3">
<h3 id="org5d51f96"><span class="section-number-3">16.4</span> get tables description</h3>
<div class="outline-text-3" id="text-16-4">
<ul class="org-ul">
<li>SELECT table<sub>name</sub>, comments FROM dba<sub>tab</sub><sub>comments</sub> WHERE owner='OE' AND table<sub>name</sub>='INVENTORIES';</li>
<li>SELECT table<sub>name</sub>, column<sub>name</sub>, comments FROM dba<sub>col</sub><sub>comments</sub> WHERE owner <code>'OE' AND table_name</code>'INVENTORIES';</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd6f5322" class="outline-2">
<h2 id="orgd6f5322"><span class="section-number-2">17</span> Report and Dashboard (Data visualization)</h2>
<div class="outline-text-2" id="text-17">
<p>
Метаданные -  показывает BI системе каким образом организована система хранения данных источника или OLAP кубы
</p>
</div>
<div id="outline-container-org582569b" class="outline-3">
<h3 id="org582569b"><span class="section-number-3">17.1</span> terms</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>dashboard [ˈdæʃbɔːd] - приборная панель</li>
<li>план-факт - отчет о результатах по целям, три колонки: план, фактическое, выполнение в процентах, опционально дельта</li>
</ul>
</div>
</div>
<div id="outline-container-org6458520" class="outline-3">
<h3 id="org6458520"><span class="section-number-3">17.2</span> Design best practives</h3>
<div class="outline-text-3" id="text-17-2">
<ul class="org-ul">
<li>5-9 visualizations for each dashboard</li>
<li>answer business questions</li>
<li>visuals must be correct for business( in proper sequence)</li>
<li>reveals details as needed</li>
</ul>
</div>
</div>
<div id="outline-container-orgbfc5173" class="outline-3">
<h3 id="orgbfc5173"><span class="section-number-3">17.3</span> Excel Power Pivot</h3>
<div class="outline-text-3" id="text-17-3">
<p>
build a ROLAP model in Power Pivot, and use pivot tables to explore
</p>
</div>
</div>
<div id="outline-container-org10bb2ff" class="outline-3">
<h3 id="org10bb2ff"><span class="section-number-3">17.4</span> Power BI Desktop</h3>
<div class="outline-text-3" id="text-17-4">
<p>
Опирается на тип поля в запросе
</p>

<p>
Иерархия - Matrix with
</p>
<ul class="org-ul">
<li>Row headers - Stepped layout indentation</li>
</ul>
</div>
