BI.md


<a id="orgfc2ee43"></a>

## <https://docs.oracle.com/en/database/oracle/application-express/18/data_load_wizard/>

Creating a Data Load Wizard


<a id="org66b6d0f"></a>

## plugin

<https://github.com/gopalmallya/csv2table>


<a id="org3e36349"></a>

# Oracle


<a id="org820f8b5"></a>

## column names and comments

    SELECT * FROM  all_tab_columns "
                             "LEFT JOIN all_col_comments cc ON all_tab_columns.table_name = cc.table_name "
                             "AND cc.column_name = all_tab_columns.column_name "
                             "WHERE all_tab_columns.table_name = 'MART_NORMA_AUTO' "
                             "ORDER BY all_tab_columns.column_id


<a id="orgecdde41"></a>

## column info

"SELECT column<sub>id</sub>, column<sub>name</sub>, data<sub>type</sub>, nullable, data<sub>length</sub>, data<sub>precision</sub>, data<sub>scale</sub>, avg<sub>col</sub><sub>len</sub> "
      "FROM user<sub>tab</sub><sub>columns</sub> WHERE table<sub>name</sub> = '"

-   target<sub>table</sub>
-   "' ORDER BY column<sub>id</sub>"


<a id="org02ae321"></a>

## all available tables

oc.cur.execute("SELECT distinct table<sub>name</sub> FROM all<sub>col</sub><sub>comments</sub>")
oc.cur.execute("SELECT distinct table<sub>name</sub> FROM all<sub>tab</sub><sub>columns</sub>")
oc.cur.execute("SELECT owner, table<sub>name</sub> FROM sys.all<sub>tables</sub>")


<a id="orgcf94725"></a>

## get tables description

-   SELECT table<sub>name</sub>, comments FROM dba<sub>tab</sub><sub>comments</sub> WHERE owner='OE' AND table<sub>name</sub>='INVENTORIES';
-   SELECT table<sub>name</sub>, column<sub>name</sub>, comments FROM dba<sub>col</sub><sub>comments</sub> WHERE owner `'OE' AND table_name`'INVENTORIES';


<a id="orgdae95d0"></a>

# Report and Dashboard (Data visualization)

Метаданные -  показывает BI системе каким образом организована система хранения данных источника или OLAP кубы


<a id="orga0d2ab4"></a>

## terms

-   dashboard [ˈdæʃbɔːd] - приборная панель
-   план-факт - отчет о результатах по целям, три колонки: план, фактическое, выполнение в процентах, опционально дельта


<a id="org42d56bb"></a>

## Design best practives

-   5-9 visualizations for each dashboard
-   answer business questions
-   visuals must be correct for business( in proper sequence)
-   reveals details as needed


<a id="org3bdaad0"></a>

## Excel Power Pivot

build a ROLAP model in Power Pivot, and use pivot tables to explore


<a id="org1b6c69a"></a>

## Power BI Desktop

Опирается на тип поля в запросе

Иерархия - Matrix with

-   Row headers - Stepped layout indentation
