BI.html
<div id="outline-container-org2156b33" class="outline-4">
<h4 id="org2156b33"><span class="section-number-4">17.4.1</span> connection types</h4>
<div class="outline-text-4" id="text-17-4-1">
<ul class="org-ul">
<li>Import Data (or some call it Scheduled Refresh) - full load of source tables to memory and disk
<ul class="org-ul">
<li>there is compression engine of Power BI - xVelocity and works on a Column-store in-memory technology</li>
<li>no limitation in the functionality</li>
<li>for web: it is fastest: Data loaded into the memory of the server, and reports queries will be evaluated from the data
loaded into the memory.</li>
</ul></li>
<li>DirectQuery - Power BI will be a visualization layer, then query the data from the data source every time.
<ul class="org-ul">
<li>no data stored in the model.</li>
<li>limited amount of RDBMS: SAP HANA, Snowflake, Spark,SQL Server, Teradata Database, Impala &#x2026; etc.</li>
<li>Limited Functionality - Few Power Query Operations
<ul class="org-ul">
<li>can still configure relationships in some cases</li>
</ul></li>
<li>with slicing and dicing every time you are sending queries to the data source (OLAP)</li>
<li>work slow if table is not prepared with Clustered Column Store Index</li>
<li>tuning for every RDBMS is special</li>
<li>no DAX or MDX as the analytical language to help</li>
</ul></li>
<li>Live Connection - very similar to DirectQuery.
<ul class="org-ul">
<li>better modeling features than DirectQuery</li>
<li>No Power Query. Just Visualization</li>
<li>only supported for these data sources:
<ul class="org-ul">
<li>Azure Analysis Services</li>
<li>SQL Server Analysis Services (SSAS) Tabular</li>
<li>SQL Server Analysis Services (SSAS) Multi-Dimensional</li>
<li>Power BI Dataset in the Service</li>
</ul></li>
</ul></li>
<li>Composite Model - DirectQuery sources and Import Data sources combined in one dataset.</li>
</ul>

<p>
Import Data or Scheduled Refresh
</p>
<ul class="org-ul">
<li>Advantages
<ul class="org-ul">
<li>Fastest Possible Connection</li>
<li>Power BI Fully Functional</li>
<li>Combining Data from different sources</li>
<li>Full DAX expressions</li>
<li>Full Power Query transformations</li>
</ul></li>
<li>Disadvantages
<ul class="org-ul">
<li>Power BI file size limitation (It is different for Premium and Pro)</li>
</ul></li>
</ul>

<p>
DirectQuery
</p>
<ul class="org-ul">
<li>Advantages
<ul class="org-ul">
<li>Large Scale data sources supported. No size limitation.</li>
<li>Pre-Built models in some data sources can be used instantly</li>
</ul></li>
<li>Disadvantages
<ul class="org-ul">
<li>Very Limited Power Query functionality</li>
<li>Slower Connection type: Performance Tuning in the data source is MUST DO</li>
</ul></li>
</ul>

<p>
Live Connection
</p>
<ul class="org-ul">
<li>Advantages
<ul class="org-ul">
<li>Large Scale data sources supported. No size limitation as far as SSAS Supports.</li>
<li>Many organizations already have SSAS models built. So they can use it as a Live Connection without the need to replicate that into Power BI.</li>
<li>Report Level Measures</li>
<li>MDX or DAX analytical engines in the data source of SSAS can be a great asset for modeling compared to DirectQuery</li>
</ul></li>
<li>Disadvantages
<ul class="org-ul">
<li>No Power Query</li>
<li>Cannot combine data from multiple sources</li>
<li>Slower Connection type: Performance Tuning in the data source is MUST DO</li>
</ul></li>
</ul>

<p>
arch
</p>
<ul class="org-ul">
<li>Import Data for Agility and Performance</li>
<li>Live Connection for Enterprise Solution</li>
<li>Live Connection for Team Development</li>
<li>Direct Query for Non-Microsoft Sources</li>
</ul>

<p>
Gateway -  if the data source is located on-premises, you would need a gateway for it. otherwise not.
</p>
</div>
</div>
<div id="outline-container-orgc455bac" class="outline-4">
<h4 id="orgc455bac"><span class="section-number-4">17.4.2</span> features</h4>
<div class="outline-text-4" id="text-17-4-2">
<ul class="org-ul">
<li>rich features - преобразования и очистка</li>
<li>использование R и Python для  очистки</li>
<li>in-memory работа с данными</li>
<li>интекрактивные визуализации 150</li>
</ul>

<p>
cons
</p>
<ul class="org-ul">
<li>все остальыне функции платные</li>
</ul>
</div>
</div>

<div id="outline-container-org09e0da0" class="outline-4">
<h4 id="org09e0da0"><span class="section-number-4">17.4.3</span> Power Query</h4>
<div class="outline-text-4" id="text-17-4-3">
<p>
Home
</p>
<ul class="org-ul">
<li>Edit Queries -old</li>
<li>Transform data - now</li>
</ul>
</div>
</div>
<div id="outline-container-org1016a75" class="outline-4">
<h4 id="org1016a75"><span class="section-number-4">17.4.4</span> Data Analysis Expressions (DAX)</h4>
<div class="outline-text-4" id="text-17-4-4">
<p>
<a href="https://docs.microsoft.com/en-us/dax/">https://docs.microsoft.com/en-us/dax/</a>
</p>
</div>
</div>
<div id="outline-container-org0d90861" class="outline-4">
<h4 id="org0d90861"><span class="section-number-4">17.4.5</span> dataflow</h4>
<div class="outline-text-4" id="text-17-4-5">
<p>
DWH of microsoft
</p>
</div>
</div>
<div id="outline-container-org505793d" class="outline-4">
<h4 id="org505793d"><span class="section-number-4">17.4.6</span> power query язык M</h4>
<div class="outline-text-4" id="text-17-4-6">
<ul class="org-ul">
<li><a href="https://needfordata.ru/blog/operator-let-v-power-bi-i-power-query">https://needfordata.ru/blog/operator-let-v-power-bi-i-power-query</a></li>
<li><a href="https://blog.crossjoin.co.uk/2016/05/22/understanding-let-expressions-in-m-for-power-bi-and-power-query/">https://blog.crossjoin.co.uk/2016/05/22/understanding-let-expressions-in-m-for-power-bi-and-power-query/</a></li>
<li>1 <a href="https://finalytics.pro/inform/m-for-powerquery/">https://finalytics.pro/inform/m-for-powerquery/</a></li>
<li>2 <a href="https://finalytics.pro/inform/m-powerquery2/">https://finalytics.pro/inform/m-powerquery2/</a></li>
<li>parameters in query <a href="https://www.biinsight.com/power-bi-desktop-query-parameters-part-1/">https://www.biinsight.com/power-bi-desktop-query-parameters-part-1/</a></li>
<li>trick Excel <a href="https://www.youtube.com/watch?v=iiNDq2VrZPY">https://www.youtube.com/watch?v=iiNDq2VrZPY</a></li>
<li>set parameter at start <a href="https://www.youtube.com/watch?v=YiKtgTkj8wk">https://www.youtube.com/watch?v=YiKtgTkj8wk</a></li>

<li>чувствителен к регистру</li>
<li>комментари:
<ul class="org-ul">
<li>одна строка //</li>
<li>несколько <i>* *</i></li>
</ul></li>
<li>логические = &lt; &lt;= &gt; &gt;= &lt;&gt;</li>
<li>if [Sales] &gt; 1000 then "более 1000" else if [Sales] &gt; 500 then "более 500" else "500 или меньше"</li>
<li>let позволяет вычислять набор значений, назначить имена, а затем используется в следующем выражении, которое
записывается в in.  let a = 2 in a+1</li>
</ul>
</div>
</div>
