BI.md


<a id="orgd8cba41"></a>

### connection types

-   Import Data (or some call it Scheduled Refresh) - full load of source tables to memory and disk
    -   there is compression engine of Power BI - xVelocity and works on a Column-store in-memory technology
    -   no limitation in the functionality
    -   for web: it is fastest: Data loaded into the memory of the server, and reports queries will be evaluated from the data
        loaded into the memory.
-   DirectQuery - Power BI will be a visualization layer, then query the data from the data source every time.
    -   no data stored in the model.
    -   limited amount of RDBMS: SAP HANA, Snowflake, Spark,SQL Server, Teradata Database, Impala &#x2026; etc.
    -   Limited Functionality - Few Power Query Operations
        -   can still configure relationships in some cases
    -   with slicing and dicing every time you are sending queries to the data source (OLAP)
    -   work slow if table is not prepared with Clustered Column Store Index
    -   tuning for every RDBMS is special
    -   no DAX or MDX as the analytical language to help
-   Live Connection - very similar to DirectQuery.
    -   better modeling features than DirectQuery
    -   No Power Query. Just Visualization
    -   only supported for these data sources:
        -   Azure Analysis Services
        -   SQL Server Analysis Services (SSAS) Tabular
        -   SQL Server Analysis Services (SSAS) Multi-Dimensional
        -   Power BI Dataset in the Service
-   Composite Model - DirectQuery sources and Import Data sources combined in one dataset.

Import Data or Scheduled Refresh

-   Advantages
    -   Fastest Possible Connection
    -   Power BI Fully Functional
    -   Combining Data from different sources
    -   Full DAX expressions
    -   Full Power Query transformations
-   Disadvantages
    -   Power BI file size limitation (It is different for Premium and Pro)

DirectQuery

-   Advantages
    -   Large Scale data sources supported. No size limitation.
    -   Pre-Built models in some data sources can be used instantly
-   Disadvantages
    -   Very Limited Power Query functionality
    -   Slower Connection type: Performance Tuning in the data source is MUST DO

Live Connection

-   Advantages
    -   Large Scale data sources supported. No size limitation as far as SSAS Supports.
    -   Many organizations already have SSAS models built. So they can use it as a Live Connection without the need to replicate that into Power BI.
    -   Report Level Measures
    -   MDX or DAX analytical engines in the data source of SSAS can be a great asset for modeling compared to DirectQuery
-   Disadvantages
    -   No Power Query
    -   Cannot combine data from multiple sources
    -   Slower Connection type: Performance Tuning in the data source is MUST DO

arch

-   Import Data for Agility and Performance
-   Live Connection for Enterprise Solution
-   Live Connection for Team Development
-   Direct Query for Non-Microsoft Sources

Gateway -  if the data source is located on-premises, you would need a gateway for it. otherwise not.


<a id="orgf0d71f1"></a>

### features

-   rich features - преобразования и очистка
-   использование R и Python для  очистки
-   in-memory работа с данными
-   интекрактивные визуализации 150

cons

-   все остальыне функции платные


<a id="org40350eb"></a>

### Power Query

Home

-   Edit Queries -old
-   Transform data - now


<a id="orgf2bec01"></a>

### Data Analysis Expressions (DAX)

<https://docs.microsoft.com/en-us/dax/>


<a id="orga6f1427"></a>

### dataflow

DWH of microsoft


<a id="org8c5d592"></a>

### power query язык M

-   <https://needfordata.ru/blog/operator-let-v-power-bi-i-power-query>
-   <https://blog.crossjoin.co.uk/2016/05/22/understanding-let-expressions-in-m-for-power-bi-and-power-query/>
-   1 <https://finalytics.pro/inform/m-for-powerquery/>
-   2 <https://finalytics.pro/inform/m-powerquery2/>
-   parameters in query <https://www.biinsight.com/power-bi-desktop-query-parameters-part-1/>
-   trick Excel <https://www.youtube.com/watch?v=iiNDq2VrZPY>
-   set parameter at start <https://www.youtube.com/watch?v=YiKtgTkj8wk>

-   чувствителен к регистру
-   комментари:
    -   одна строка //
    -   несколько *\* \**
-   логические = < <= > >= <>
-   if [Sales] > 1000 then "более 1000" else if [Sales] > 500 then "более 500" else "500 или меньше"
-   let позволяет вычислять набор значений, назначить имена, а затем используется в следующем выражении, которое
    записывается в in.  let a = 2 in a+1
