BI.html

<div id="outline-container-org3675e04" class="outline-4">
<h4 id="org3675e04"><span class="section-number-4">17.4.7</span> report as one string but no OFFSET and LIMIT:</h4>
<div class="outline-text-4" id="text-17-4-7">
<div class="org-src-container">
<pre class="src src-m">let
  q = "select * from main LEFT JOIN main_date ON main.dateID = main_date.id where main_date.end_date = '" &amp; Date.ToText(Дата, "yyyy-MM-dd") &amp; "' ;",
  Source = Odbc.Query("DRIVER={PostgreSQL Unicode(x64)};Server=10.77.51.121;Port=32232;DATABASE=obor;", q)
in
  Source
</pre>
</div>
</div>
</div>
<div id="outline-container-orga9c4c54" class="outline-4">
<h4 id="orga9c4c54"><span class="section-number-4">17.4.8</span> custom visal apps</h4>
<div class="outline-text-4" id="text-17-4-8">
<ul class="org-ul">
<li><a href="https://docs.microsoft.com/ru-ru/power-bi/developer/custom-visual-develop-tutorial">https://docs.microsoft.com/ru-ru/power-bi/developer/custom-visual-develop-tutorial</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8c6cb64" class="outline-3">
<h3 id="org8c6cb64"><span class="section-number-3">17.5</span> Tableau Public (Desktop Windows, mac)</h3>
<div class="outline-text-3" id="text-17-5">
<p>
cons:
</p>
<ul class="org-ul">
<li>Distribution: Cloud (you can not save Tableau Public workbooks locally)</li>
<li>Tableau Public has a limit of 10 million rows of data that is allowed in any single connection</li>
<li>Account Space: Each account holder will be able to save up to 10 gigabytes (GB) of content to Tableau Public</li>
</ul>
</div>
</div>
<div id="outline-container-orgfadb450" class="outline-3">
<h3 id="orgfadb450"><span class="section-number-3">17.6</span> Metabase</h3>
<div class="outline-text-3" id="text-17-6">
<ul class="org-ul">
<li>java -jar</li>
<li>localhost:3000</li>
</ul>

<p>
cons:
</p>
<ul class="org-ul">
<li>slicer в виде фильтров без кнопок</li>
</ul>
<p>
pros:
</p>
<ul class="org-ul">
<li>можно изменять названия любых столбцов и меток</li>
<li>configuration is pretty straightforward and can be done within the tool UI once.</li>
<li>Easy and intuitive setup.</li>
</ul>

<p>
requires
</p>
<ul class="org-ul">
<li>only a DB connection that it uses for storing state.</li>
<li>one pod in your cluster</li>
</ul>

<p>
Cloud-based and on-premise platform for businesses of all sizes that helps with KPI monitoring, database
management, bug tracking, record filtering, debugging, query builder and more.
</p>
</div>
</div>

<div id="outline-container-org6c6ab68" class="outline-3">
<h3 id="org6c6ab68"><span class="section-number-3">17.7</span> Redash</h3>
<div class="outline-text-3" id="text-17-7">
<p>
pros:
</p>
<ul class="org-ul">
<li>работа с SQL в первую очередь</li>
<li>можно именовать столбцы</li>
<li>No extra work is needed for the alert and schedulers as those are spun by default</li>
</ul>
<p>
cons:
</p>
<ul class="org-ul">
<li>мало возможностей и slicer нету</li>
<li>No official helm chart, however, the community one is part of the main redash repo, hence closely evolves
with redash itself.</li>
<li>you again end up with a bunch of worker pods.</li>
<li>The UI is buggy at places</li>
</ul>

<p>
Dependencies are redis and a database that are also spinnable through the chart.
</p>
</div>
</div>
<div id="outline-container-org707dbc9" class="outline-3">
<h3 id="org707dbc9"><span class="section-number-3">17.8</span> Qlik Sense Desktop</h3>
<div class="outline-text-3" id="text-17-8">
<ul class="org-ul">
<li>Section Access is not supported - When loading a QlikView App with Section Access an error message will be displayed.</li>
<li>Hidden Script is not supported - Saving an App with hidden script will NOT save the hidden script - Data of hidden script will be lost in the next reload.</li>
</ul>
</div>
</div>

<div id="outline-container-org4e0a6ab" class="outline-3">
<h3 id="org4e0a6ab"><span class="section-number-3">17.9</span> SuperSet</h3>
<div class="outline-text-3" id="text-17-9">
<p>
web-based stack application, Apache License 2.0
</p>

<ul class="org-ul">
<li>acts as a thin layer above your underlying databases or data engines</li>
<li>can execute queries and return results in a time frame that is acceptable to your users</li>
</ul>
</div>
<div id="outline-container-orgbbe79c3" class="outline-4">
<h4 id="orgbbe79c3"><span class="section-number-4">17.9.1</span> create dashboard</h4>
<div class="outline-text-4" id="text-17-9-1">
<ol class="org-ol">
<li>create database</li>
<li>Data - Dataset - add table</li>
<li>Edit Dataset
<ul class="org-ul">
<li>Columns -
<ul class="org-ul">
<li>Is the column temporal? (should it be used for slicing &amp; dicing in time series charts?)</li>
<li>Should the column be filterable? - numbers?</li>
<li>Is the column dimensional? - regions?</li>
</ul></li>
<li>metrics - agregates - SUM(recovered) / SUM(confirmed))</li>
<li>calculated columns - CAST(recovery<sub>rate</sub> as float); - customize the appearance and behavior of a specific
column</li>
</ul></li>
<li>Creating charts
<ul class="org-ul">
<li>Explore: no-code viz builder. Select your dataset, select the chart, customize the appearance, and publish.</li>
<li>SQL Lab: SQL IDE for cleaning, joining, and preparing data for Explore workflow</li>
</ul></li>
<li>create dashboard</li>
</ol>
</div>
</div>
