BI.md


<a id="orgf65cdf2"></a>

### report as one string but no OFFSET and LIMIT:

    let
      q = "select * from main LEFT JOIN main_date ON main.dateID = main_date.id where main_date.end_date = '" & Date.ToText(Дата, "yyyy-MM-dd") & "' ;",
      Source = Odbc.Query("DRIVER={PostgreSQL Unicode(x64)};Server=10.77.51.121;Port=32232;DATABASE=obor;", q)
    in
      Source


<a id="orgbe7edca"></a>

### custom visal apps

-   <https://docs.microsoft.com/ru-ru/power-bi/developer/custom-visual-develop-tutorial>


<a id="orgecc0c92"></a>

## Tableau Public (Desktop Windows, mac)

cons:

-   Distribution: Cloud (you can not save Tableau Public workbooks locally)
-   Tableau Public has a limit of 10 million rows of data that is allowed in any single connection
-   Account Space: Each account holder will be able to save up to 10 gigabytes (GB) of content to Tableau Public


<a id="orgbfb7652"></a>

## Metabase

-   java -jar
-   localhost:3000

cons:

-   slicer в виде фильтров без кнопок

pros:

-   можно изменять названия любых столбцов и меток
-   configuration is pretty straightforward and can be done within the tool UI once.
-   Easy and intuitive setup.

requires

-   only a DB connection that it uses for storing state.
-   one pod in your cluster

Cloud-based and on-premise platform for businesses of all sizes that helps with KPI monitoring, database
management, bug tracking, record filtering, debugging, query builder and more.


<a id="org95b8d21"></a>

## Redash

pros:

-   работа с SQL в первую очередь
-   можно именовать столбцы
-   No extra work is needed for the alert and schedulers as those are spun by default

cons:

-   мало возможностей и slicer нету
-   No official helm chart, however, the community one is part of the main redash repo, hence closely evolves
    with redash itself.
-   you again end up with a bunch of worker pods.
-   The UI is buggy at places

Dependencies are redis and a database that are also spinnable through the chart.


<a id="orge46edf0"></a>

## Qlik Sense Desktop

-   Section Access is not supported - When loading a QlikView App with Section Access an error message will be displayed.
-   Hidden Script is not supported - Saving an App with hidden script will NOT save the hidden script - Data of hidden script will be lost in the next reload.


<a id="org8a3677e"></a>

## SuperSet

web-based stack application, Apache License 2.0

-   acts as a thin layer above your underlying databases or data engines
-   can execute queries and return results in a time frame that is acceptable to your users


<a id="org507ec50"></a>

### create dashboard

1.  create database
2.  Data - Dataset - add table
3.  Edit Dataset
    -   Columns -
        -   Is the column temporal? (should it be used for slicing & dicing in time series charts?)
        -   Should the column be filterable? - numbers?
        -   Is the column dimensional? - regions?
    -   metrics - agregates - SUM(recovered) / SUM(confirmed))
    -   calculated columns - CAST(recovery<sub>rate</sub> as float); - customize the appearance and behavior of a specific
        column
4.  Creating charts
    -   Explore: no-code viz builder. Select your dataset, select the chart, customize the appearance, and publish.
    -   SQL Lab: SQL IDE for cleaning, joining, and preparing data for Explore workflow
5.  create dashboard
