BI.org
*** feature:
- Dashboard creation
  - Drag and Drop crafting
  - ways of sharing your dashboard/charts (JSON, email, URL)


- Enterprise authentication (OpenID, LDAP, OAuth...)
- Integration with Apache ECharts - Open Source JavaScript Visualization Library (diagrams)
- Lightweight semantic layer - ?
- Visualization plugin support - ?
- Compatible with most SQL-speaking datasources
- in-memory asynchronous caching and queries

features2:
- Comes with official support for helm.
- Alerts, Reports and extra data source connectors - from interface
- Dependencies are redis and a database, and it does provide you with an option to spin those up for you.
- ends up with a bunch of pods, some of which workers other for scheduling.
- control over custom granularity roles and row-level security filters
- Data Exploration (Slice & Dice):
  - Code-free visualization builder to extract and present datasets
  - Intuitive interface
  - Apply dozens of preset and custom visualization plugins instantly
  - User-defined metrics with scalable semantic layering
  - Lets you view the SQL statement for each visualization
- SQL Lab:
  - A feature-rich SQL IDE written in React
  - A multi-tab environment lets you work on multiple queries at once
  - Metadata browsing of tables, columns, indexes, and partitions
  - Supports long-running queries by persisting query results and dispatching handlers to workers (Celery)
  - Equipped with interactive querying, autocomplete, scheduling, query history, user-defined parameters (with JINJA templating through dbt CLI and dbt Cloud), etc.

cons:
- нельзя изменить названия полей
- Requires helm tweaking to spin up its scheduler workers.
- tables have to be joined beforehand either at a database level or in the SQL Lab as a virtual table
- Cross-filtering between charts isn’t fully supported
- doesn’t support NoSQL
- Version control isn’t an explicit feature - of dashboards and chards
**** TODO Time series forecasting. Prophet lib
Prophet is a procedure for forecasting time series data based on an additive model where non-linear trends are
fit with yearly, weekly, and daily seasonality, plus holiday effects
- https://facebook.github.io/prophet/
**** Data sharing.
- share the dashboard page as live dashboard through email or by sharing the page link.
- You can also share individual chart through email or sharing the link, exporting data through csv or sharing
  the visualization as image after downloading it. In addition you can export the visualization data as json
  formats or you can embed the entire chart to your external website.
*** install 1.4
- git clone --depth=1 https://github.com/apache/superset.git --branch 1.4
- edit docker-compose-non-dev.yaml
  - L87 after in RUM mkdir ... in # Final lean image - add:
    - apt-get install -y libaio1 \
  - in L107 in section # Final lean image add:
    - && pip install cx_Oracle
  - in L114 section # Final lean image after COPY ./docker/docker-entrypoint.sh /usr/bin add:
    - COPY instantclient_18_5 /lib/oracle_instantclient_18_5
    - ENV LD_LIBRARY_PATH="/lib/oracle_instantclient_18_5:${LD_LIBRARY_PATH}"
  - x-superset-image: &superset-image apache/superset:${TAG:-latest-dev}
  - comment section # Dev image... for speed
-
- docker build --force-rm -t apache/superset:1.4 .
- TAG=1.4 docker-compose build -f docker-compose-non-dev.yaml --force-rm
- TAG=1.4 docker-compose -f docker-compose-non-dev.yaml down -v
- TAG=1.4 docker-compose -f docker-compose-non-dev.yaml up -d

Language support:
- /superset_config.py:
  - LANGUAGES = {'en': {'flag':'us', 'name': 'English'}, 'ru':{'flag': 'ru', 'name': "Russian"}}
- COPY ./superset_config.py ${PYTHONPATH}/

https://stackoverflow.com/questions/68182176/how-to-install-oracle-driver-on-apache-superset-without-internet-access
