BI.html
<div id="outline-container-org5bc1496" class="outline-4">
<h4 id="org5bc1496"><span class="section-number-4">17.9.2</span> feature:</h4>
<div class="outline-text-4" id="text-17-9-2">
<ul class="org-ul">
<li>Dashboard creation
<ul class="org-ul">
<li>Drag and Drop crafting</li>
<li>ways of sharing your dashboard/charts (JSON, email, URL)</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Enterprise authentication (OpenID, LDAP, OAuth&#x2026;)</li>
<li>Integration with Apache ECharts - Open Source JavaScript Visualization Library (diagrams)</li>
<li>Lightweight semantic layer - ?</li>
<li>Visualization plugin support - ?</li>
<li>Compatible with most SQL-speaking datasources</li>
<li>in-memory asynchronous caching and queries</li>
</ul>

<p>
features2:
</p>
<ul class="org-ul">
<li>Comes with official support for helm.</li>
<li>Alerts, Reports and extra data source connectors - from interface</li>
<li>Dependencies are redis and a database, and it does provide you with an option to spin those up for you.</li>
<li>ends up with a bunch of pods, some of which workers other for scheduling.</li>
<li>control over custom granularity roles and row-level security filters</li>
<li>Data Exploration (Slice &amp; Dice):
<ul class="org-ul">
<li>Code-free visualization builder to extract and present datasets</li>
<li>Intuitive interface</li>
<li>Apply dozens of preset and custom visualization plugins instantly</li>
<li>User-defined metrics with scalable semantic layering</li>
<li>Lets you view the SQL statement for each visualization</li>
</ul></li>
<li>SQL Lab:
<ul class="org-ul">
<li>A feature-rich SQL IDE written in React</li>
<li>A multi-tab environment lets you work on multiple queries at once</li>
<li>Metadata browsing of tables, columns, indexes, and partitions</li>
<li>Supports long-running queries by persisting query results and dispatching handlers to workers (Celery)</li>
<li>Equipped with interactive querying, autocomplete, scheduling, query history, user-defined parameters (with JINJA templating through dbt CLI and dbt Cloud), etc.</li>
</ul></li>
</ul>

<p>
cons:
</p>
<ul class="org-ul">
<li>нельзя изменить названия полей</li>
<li>Requires helm tweaking to spin up its scheduler workers.</li>
<li>tables have to be joined beforehand either at a database level or in the SQL Lab as a virtual table</li>
<li>Cross-filtering between charts isn’t fully supported</li>
<li>doesn’t support NoSQL</li>
<li>Version control isn’t an explicit feature - of dashboards and chards</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orga5fef59"></a><span class="todo TODO">TODO</span> Time series forecasting. Prophet lib<br />
<div class="outline-text-5" id="text-17-9-2-1">
<p>
Prophet is a procedure for forecasting time series data based on an additive model where non-linear trends are
fit with yearly, weekly, and daily seasonality, plus holiday effects
</p>
<ul class="org-ul">
<li><a href="https://facebook.github.io/prophet/">https://facebook.github.io/prophet/</a></li>
</ul>
</div>
</li>
<li><a id="org0834988"></a>Data sharing.<br />
<div class="outline-text-5" id="text-17-9-2-2">
<ul class="org-ul">
<li>share the dashboard page as live dashboard through email or by sharing the page link.</li>
<li>You can also share individual chart through email or sharing the link, exporting data through csv or sharing
the visualization as image after downloading it. In addition you can export the visualization data as json
formats or you can embed the entire chart to your external website.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org12c22f8" class="outline-4">
<h4 id="org12c22f8"><span class="section-number-4">17.9.3</span> install 1.4</h4>
<div class="outline-text-4" id="text-17-9-3">
<ul class="org-ul">
<li>git clone &#x2013;depth=1 <a href="https://github.com/apache/superset.git">https://github.com/apache/superset.git</a> &#x2013;branch 1.4</li>
<li>edit docker-compose-non-dev.yaml
<ul class="org-ul">
<li>L87 after in RUM mkdir &#x2026; in # Final lean image - add:
<ul class="org-ul">
<li>apt-get install -y libaio1 \</li>
</ul></li>
<li>in L107 in section # Final lean image add:
<ul class="org-ul">
<li>&amp;&amp; pip install cx<sub>Oracle</sub></li>
</ul></li>
<li>in L114 section # Final lean image after COPY ./docker/docker-entrypoint.sh /usr/bin add:
<ul class="org-ul">
<li>COPY instantclient<sub>18</sub><sub>5</sub> /lib/oracle<sub>instantclient</sub><sub>18</sub><sub>5</sub></li>
<li>ENV LD<sub>LIBRARY</sub><sub>PATH</sub>="/lib/oracle<sub>instantclient</sub><sub>18</sub><sub>5</sub>:${LD<sub>LIBRARY</sub><sub>PATH</sub>}"</li>
</ul></li>
<li>x-superset-image: &amp;superset-image apache/superset:${TAG:-latest-dev}</li>
<li>comment section # Dev image&#x2026; for speed</li>
</ul></li>
<li></li>

<li>docker build &#x2013;force-rm -t apache/superset:1.4 .</li>
<li>TAG=1.4 docker-compose build -f docker-compose-non-dev.yaml &#x2013;force-rm</li>
<li>TAG=1.4 docker-compose -f docker-compose-non-dev.yaml down -v</li>
<li>TAG=1.4 docker-compose -f docker-compose-non-dev.yaml up -d</li>
</ul>

<p>
Language support:
</p>
<ul class="org-ul">
<li>/superset<sub>config.py</sub>:
<ul class="org-ul">
<li>LANGUAGES = {'en': {'flag':'us', 'name': 'English'}, 'ru':{'flag': 'ru', 'name': "Russian"}}</li>
</ul></li>
<li>COPY ./superset<sub>config.py</sub> ${PYTHONPATH}/</li>
</ul>

<p>
<a href="https://stackoverflow.com/questions/68182176/how-to-install-oracle-driver-on-apache-superset-without-internet-access">https://stackoverflow.com/questions/68182176/how-to-install-oracle-driver-on-apache-superset-without-internet-access</a>
</p>
</div>
</div>
