BI.md


<a id="orgce7ad67"></a>

### feature:

-   Dashboard creation
    -   Drag and Drop crafting
    -   ways of sharing your dashboard/charts (JSON, email, URL)

-   Enterprise authentication (OpenID, LDAP, OAuth&#x2026;)
-   Integration with Apache ECharts - Open Source JavaScript Visualization Library (diagrams)
-   Lightweight semantic layer - ?
-   Visualization plugin support - ?
-   Compatible with most SQL-speaking datasources
-   in-memory asynchronous caching and queries

features2:

-   Comes with official support for helm.
-   Alerts, Reports and extra data source connectors - from interface
-   Dependencies are redis and a database, and it does provide you with an option to spin those up for you.
-   ends up with a bunch of pods, some of which workers other for scheduling.
-   control over custom granularity roles and row-level security filters
-   Data Exploration (Slice & Dice):
    -   Code-free visualization builder to extract and present datasets
    -   Intuitive interface
    -   Apply dozens of preset and custom visualization plugins instantly
    -   User-defined metrics with scalable semantic layering
    -   Lets you view the SQL statement for each visualization
-   SQL Lab:
    -   A feature-rich SQL IDE written in React
    -   A multi-tab environment lets you work on multiple queries at once
    -   Metadata browsing of tables, columns, indexes, and partitions
    -   Supports long-running queries by persisting query results and dispatching handlers to workers (Celery)
    -   Equipped with interactive querying, autocomplete, scheduling, query history, user-defined parameters (with JINJA templating through dbt CLI and dbt Cloud), etc.

cons:

-   нельзя изменить названия полей
-   Requires helm tweaking to spin up its scheduler workers.
-   tables have to be joined beforehand either at a database level or in the SQL Lab as a virtual table
-   Cross-filtering between charts isn’t fully supported
-   doesn’t support NoSQL
-   Version control isn’t an explicit feature - of dashboards and chards

1.  TODO Time series forecasting. Prophet lib

    Prophet is a procedure for forecasting time series data based on an additive model where non-linear trends are
    fit with yearly, weekly, and daily seasonality, plus holiday effects

    -   <https://facebook.github.io/prophet/>

2.  Data sharing.

    -   share the dashboard page as live dashboard through email or by sharing the page link.
    -   You can also share individual chart through email or sharing the link, exporting data through csv or sharing
        the visualization as image after downloading it. In addition you can export the visualization data as json
        formats or you can embed the entire chart to your external website.


<a id="org16a5dcf"></a>

### install 1.4

-   git clone &#x2013;depth=1 <https://github.com/apache/superset.git> &#x2013;branch 1.4
-   edit docker-compose-non-dev.yaml
    -   L87 after in RUM mkdir &#x2026; in # Final lean image - add:
        -   apt-get install -y libaio1 \\
    -   in L107 in section # Final lean image add:
        -   && pip install cx<sub>Oracle</sub>
    -   in L114 section # Final lean image after COPY ./docker/docker-entrypoint.sh /usr/bin add:
        -   COPY instantclient<sub>18</sub><sub>5</sub> /lib/oracle<sub>instantclient</sub><sub>18</sub><sub>5</sub>
        -   ENV LD<sub>LIBRARY</sub><sub>PATH</sub>="/lib/oracle<sub>instantclient</sub><sub>18</sub><sub>5</sub>:${LD<sub>LIBRARY</sub><sub>PATH</sub>}"
    -   x-superset-image: &superset-image apache/superset:${TAG:-latest-dev}
    -   comment section # Dev image&#x2026; for speed
-

-   docker build &#x2013;force-rm -t apache/superset:1.4 .
-   TAG=1.4 docker-compose build -f docker-compose-non-dev.yaml &#x2013;force-rm
-   TAG=1.4 docker-compose -f docker-compose-non-dev.yaml down -v
-   TAG=1.4 docker-compose -f docker-compose-non-dev.yaml up -d

Language support:

-   /superset<sub>config.py</sub>:
    -   LANGUAGES = {'en': {'flag':'us', 'name': 'English'}, 'ru':{'flag': 'ru', 'name': "Russian"}}
-   COPY ./superset<sub>config.py</sub> ${PYTHONPATH}/

<https://stackoverflow.com/questions/68182176/how-to-install-oracle-driver-on-apache-superset-without-internet-access>
