BI.org
*** config
- главный конфиг superset/config.py - грузит ${PYTHONPATH}/superset_config.py
- Dockerfile: COPY ./superset_config.py ${PYTHONPATH}/
- Docker Compose settings: docker/.env and docker/.env-non-dev
- pythonpath_dev/superset_config.py and pythonpath_dev/superset_config_docker.py


    - First you need to download oracle client with libraries and put them into superset image
    - install cx_Oracle and libaio1 inside container
      - apt update; apt install -y libaio1; pip install cx_Oracle
    - For normal language support set env variable in the docker/.env
      - NLS_LANG=RUSSIAN_RUSSIA.AL32UTF8 # for Russian with UTF-8
    - Superset does not detect oracle and uses postgres specs for that datasource. So you need to comment this
      line to fix SQL Lab error
      - superset/db_engine_specs/postgres.py +52
      - # cursor.tzinfo_factory = FixedOffsetTimezone


superset-websocket - bidirectual channel
- "GLOBAL_ASYNC_QUERIES": True - to enable
**** TODO RuntimeWarning:You're running the worker with superuser privileges:this is absolutely not recommended
https://stackoverflow.com/questions/59651428/runtimewarningyoure-running-the-worker-with-superuser-privilegesthis-is-absol
**** TODO theme superset/statis/assets/stylessheets/less/cosmo/variables.less
theme https://debaatobiee.wordpress.com/2019/08/04/customizing-apache-superset-ui-config-theme-changes/
*** install old

 - Filter and Slicer https://www.youtube.com/watch?v=fpNj72aQn8M
 - python3.6 -m virtualenv venv
 - pip install --upgrade setuptools pip
 - cd venv
 - (optional) chmod +x bin/activate
 - . bin/activate
 - pip uninstall pandas
 - pip install pandas==0.23.4
 - use pip install sqlalchemy==1.2.18
 - fabmanager create-admin --app superset
 - superset db upgrade
 - superset init
 - superset runserver

 https://github.com/cloudflare/sqlalchemy-clickhouse
 - pip install sqlalchemy-clickhouse
 - export https_proxy= && export http_proxy=
 - superset runserver
 - chromium http://0.0.0.0:8088
 - admin admin
 - clickhouse://default:@localhost:8123/default

*** architecture
 - Web server (can run multiple instances) - flask python app, using sqlalchemy ORM to connect to any database
 - Metadata database - SQLite - to store databese connection info
 - Cache layer
 - Message queue for async queries
 - Results backend
https://www.startdataengineering.com/post/apache-superset-tutorial/
*** docker-compose
- services:
  - redis
  - db - postgres
  - superset
  - superset-init
  - superset-websocket - web-frontend
  - superset-worker
  - superset-worker-beat
- volumes
  - superset_home
  - db_home
  - redis
*** pros and cons
Pros and Cons
Pros

    Open source.
    Large number of pre built visualizations.
    Leverage Apache Superset to embed the dashboards into your data applications.
    Amazing community (I was able to get super fast support on a weekend).
    Simple web server architecture.
    Granular user access control.
    Rest API based on OpenAPI specification.

Cons

    Cannot do joins in charts and exploration sections. The dataset has to be pre joined or be a view.
    Users will need to know SQL. Engineers can help with creation of views, etc. But to be a fully self serve BI tool, end users will need to know SQL.
    Without a good dev ops and data team, management can be difficult. Unless you get the managed version from preset.

*** links
- doc https://superset.apache.org/docs/intro
- https://www.startdataengineering.com/post/apache-superset-tutorial/
