BI.html
<div id="outline-container-org729a5b4" class="outline-4">
<h4 id="org729a5b4"><span class="section-number-4">17.9.4</span> config</h4>
<div class="outline-text-4" id="text-17-9-4">
<ul class="org-ul">
<li>главный конфиг superset/config.py - грузит ${PYTHONPATH}/superset<sub>config.py</sub></li>
<li>Dockerfile: COPY ./superset<sub>config.py</sub> ${PYTHONPATH}/</li>
<li>Docker Compose settings: docker/.env and docker/.env-non-dev</li>
<li>pythonpath<sub>dev</sub>/superset<sub>config.py</sub> and pythonpath<sub>dev</sub>/superset<sub>config</sub><sub>docker.py</sub></li>
</ul>


<ul class="org-ul">
<li>First you need to download oracle client with libraries and put them into superset image</li>
<li>install cx<sub>Oracle</sub> and libaio1 inside container
<ul class="org-ul">
<li>apt update; apt install -y libaio1; pip install cx<sub>Oracle</sub></li>
</ul></li>
<li>For normal language support set env variable in the docker/.env
<ul class="org-ul">
<li>NLS<sub>LANG</sub>=RUSSIAN<sub>RUSSIA.AL32UTF8</sub> # for Russian with UTF-8</li>
</ul></li>
<li>Superset does not detect oracle and uses postgres specs for that datasource. So you need to comment this
line to fix SQL Lab error
<ul class="org-ul">
<li>superset/db<sub>engine</sub><sub>specs</sub>/postgres.py +52</li>
<li># cursor.tzinfo<sub>factory</sub> = FixedOffsetTimezone</li>
</ul></li>
</ul>


<p>
superset-websocket - bidirectual channel
</p>
<ul class="org-ul">
<li>"GLOBAL<sub>ASYNC</sub><sub>QUERIES</sub>": True - to enable</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org7aea64a"></a><span class="todo TODO">TODO</span> RuntimeWarning:You're running the worker with superuser privileges:this is absolutely not recommended<br />
<div class="outline-text-5" id="text-17-9-4-1">
<p>
<a href="https://stackoverflow.com/questions/59651428/runtimewarningyoure-running-the-worker-with-superuser-privilegesthis-is-absol">https://stackoverflow.com/questions/59651428/runtimewarningyoure-running-the-worker-with-superuser-privilegesthis-is-absol</a>
</p>
</div>
</li>
<li><a id="org80e0051"></a><span class="todo TODO">TODO</span> theme superset/statis/assets/stylessheets/less/cosmo/variables.less<br />
<div class="outline-text-5" id="text-17-9-4-2">
<p>
theme <a href="https://debaatobiee.wordpress.com/2019/08/04/customizing-apache-superset-ui-config-theme-changes/">https://debaatobiee.wordpress.com/2019/08/04/customizing-apache-superset-ui-config-theme-changes/</a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org75b17da" class="outline-4">
<h4 id="org75b17da"><span class="section-number-4">17.9.5</span> install old</h4>
<div class="outline-text-4" id="text-17-9-5">
<ul class="org-ul">
<li>Filter and Slicer <a href="https://www.youtube.com/watch?v=fpNj72aQn8M">https://www.youtube.com/watch?v=fpNj72aQn8M</a></li>
<li>python3.6 -m virtualenv venv</li>
<li>pip install &#x2013;upgrade setuptools pip</li>
<li>cd venv</li>
<li>(optional) chmod +x bin/activate</li>
<li>. bin/activate</li>
<li>pip uninstall pandas</li>
<li>pip install pandas==0.23.4</li>
<li>use pip install sqlalchemy==1.2.18</li>
<li>fabmanager create-admin &#x2013;app superset</li>
<li>superset db upgrade</li>
<li>superset init</li>
<li>superset runserver</li>
</ul>

<p>
<a href="https://github.com/cloudflare/sqlalchemy-clickhouse">https://github.com/cloudflare/sqlalchemy-clickhouse</a>
</p>
<ul class="org-ul">
<li>pip install sqlalchemy-clickhouse</li>
<li>export https<sub>proxy</sub>= &amp;&amp; export http<sub>proxy</sub>=</li>
<li>superset runserver</li>
<li>chromium <a href="http://0.0.0.0:8088">http://0.0.0.0:8088</a></li>
<li>admin admin</li>
<li>clickhouse://default:@localhost:8123/default</li>
</ul>
</div>
</div>

<div id="outline-container-org0671073" class="outline-4">
<h4 id="org0671073"><span class="section-number-4">17.9.6</span> architecture</h4>
<div class="outline-text-4" id="text-17-9-6">
<ul class="org-ul">
<li>Web server (can run multiple instances) - flask python app, using sqlalchemy ORM to connect to any database</li>
<li>Metadata database - SQLite - to store databese connection info</li>
<li>Cache layer</li>
<li>Message queue for async queries</li>
<li>Results backend</li>
</ul>
<p>
<a href="https://www.startdataengineering.com/post/apache-superset-tutorial/">https://www.startdataengineering.com/post/apache-superset-tutorial/</a>
</p>
</div>
</div>
<div id="outline-container-org55b349e" class="outline-4">
<h4 id="org55b349e"><span class="section-number-4">17.9.7</span> docker-compose</h4>
<div class="outline-text-4" id="text-17-9-7">
<ul class="org-ul">
<li>services:
<ul class="org-ul">
<li>redis</li>
<li>db - postgres</li>
<li>superset</li>
<li>superset-init</li>
<li>superset-websocket - web-frontend</li>
<li>superset-worker</li>
<li>superset-worker-beat</li>
</ul></li>
<li>volumes
<ul class="org-ul">
<li>superset<sub>home</sub></li>
<li>db<sub>home</sub></li>
<li>redis</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgae5e537" class="outline-4">
<h4 id="orgae5e537"><span class="section-number-4">17.9.8</span> pros and cons</h4>
<div class="outline-text-4" id="text-17-9-8">
<p>
Pros and Cons
Pros
</p>

<p>
Open source.
Large number of pre built visualizations.
Leverage Apache Superset to embed the dashboards into your data applications.
Amazing community (I was able to get super fast support on a weekend).
Simple web server architecture.
Granular user access control.
Rest API based on OpenAPI specification.
</p>

<p>
Cons
</p>

<p>
Cannot do joins in charts and exploration sections. The dataset has to be pre joined or be a view.
Users will need to know SQL. Engineers can help with creation of views, etc. But to be a fully self serve BI tool, end users will need to know SQL.
Without a good dev ops and data team, management can be difficult. Unless you get the managed version from preset.
</p>
</div>
</div>

<div id="outline-container-org2558b76" class="outline-4">
<h4 id="org2558b76"><span class="section-number-4">17.9.9</span> links</h4>
<div class="outline-text-4" id="text-17-9-9">
<ul class="org-ul">
<li>doc <a href="https://superset.apache.org/docs/intro">https://superset.apache.org/docs/intro</a></li>
<li><a href="https://www.startdataengineering.com/post/apache-superset-tutorial/">https://www.startdataengineering.com/post/apache-superset-tutorial/</a></li>
</ul>
</div>
</div>
