BI.md


<a id="orga45e01a"></a>

### config

-   главный конфиг superset/config.py - грузит ${PYTHONPATH}/superset<sub>config.py</sub>
-   Dockerfile: COPY ./superset<sub>config.py</sub> ${PYTHONPATH}/
-   Docker Compose settings: docker/.env and docker/.env-non-dev
-   pythonpath<sub>dev</sub>/superset<sub>config.py</sub> and pythonpath<sub>dev</sub>/superset<sub>config</sub><sub>docker.py</sub>

-   First you need to download oracle client with libraries and put them into superset image
-   install cx<sub>Oracle</sub> and libaio1 inside container
    -   apt update; apt install -y libaio1; pip install cx<sub>Oracle</sub>
-   For normal language support set env variable in the docker/.env
    -   NLS<sub>LANG</sub>=RUSSIAN<sub>RUSSIA.AL32UTF8</sub> # for Russian with UTF-8
-   Superset does not detect oracle and uses postgres specs for that datasource. So you need to comment this
    line to fix SQL Lab error
    -   superset/db<sub>engine</sub><sub>specs</sub>/postgres.py +52
    -   \# cursor.tzinfo<sub>factory</sub> = FixedOffsetTimezone

superset-websocket - bidirectual channel

-   "GLOBAL<sub>ASYNC</sub><sub>QUERIES</sub>": True - to enable

1.  TODO RuntimeWarning:You're running the worker with superuser privileges:this is absolutely not recommended

    <https://stackoverflow.com/questions/59651428/runtimewarningyoure-running-the-worker-with-superuser-privilegesthis-is-absol>

2.  TODO theme superset/statis/assets/stylessheets/less/cosmo/variables.less

    theme <https://debaatobiee.wordpress.com/2019/08/04/customizing-apache-superset-ui-config-theme-changes/>


<a id="orgba193fe"></a>

### install old

-   Filter and Slicer <https://www.youtube.com/watch?v=fpNj72aQn8M>
-   python3.6 -m virtualenv venv
-   pip install &#x2013;upgrade setuptools pip
-   cd venv
-   (optional) chmod +x bin/activate
-   . bin/activate
-   pip uninstall pandas
-   pip install pandas==0.23.4
-   use pip install sqlalchemy==1.2.18
-   fabmanager create-admin &#x2013;app superset
-   superset db upgrade
-   superset init
-   superset runserver

<https://github.com/cloudflare/sqlalchemy-clickhouse>

-   pip install sqlalchemy-clickhouse
-   export https<sub>proxy</sub>= && export http<sub>proxy</sub>=
-   superset runserver
-   chromium <http://0.0.0.0:8088>
-   admin admin
-   clickhouse://default:@localhost:8123/default


<a id="org91c0fc0"></a>

### architecture

-   Web server (can run multiple instances) - flask python app, using sqlalchemy ORM to connect to any database
-   Metadata database - SQLite - to store databese connection info
-   Cache layer
-   Message queue for async queries
-   Results backend

<https://www.startdataengineering.com/post/apache-superset-tutorial/>


<a id="orga0ed49a"></a>

### docker-compose

-   services:
    -   redis
    -   db - postgres
    -   superset
    -   superset-init
    -   superset-websocket - web-frontend
    -   superset-worker
    -   superset-worker-beat
-   volumes
    -   superset<sub>home</sub>
    -   db<sub>home</sub>
    -   redis


<a id="org21cffbc"></a>

### pros and cons

Pros and Cons
Pros

Open source.
Large number of pre built visualizations.
Leverage Apache Superset to embed the dashboards into your data applications.
Amazing community (I was able to get super fast support on a weekend).
Simple web server architecture.
Granular user access control.
Rest API based on OpenAPI specification.

Cons

Cannot do joins in charts and exploration sections. The dataset has to be pre joined or be a view.
Users will need to know SQL. Engineers can help with creation of views, etc. But to be a fully self serve BI tool, end users will need to know SQL.
Without a good dev ops and data team, management can be difficult. Unless you get the managed version from preset.


<a id="org5294981"></a>

### links

-   doc <https://superset.apache.org/docs/intro>
-   <https://www.startdataengineering.com/post/apache-superset-tutorial/>
