BI.html
<div id="outline-container-orgf06edb9" class="outline-4">
<h4 id="orgf06edb9"><span class="section-number-4">17.9.10</span> security</h4>
<div class="outline-text-4" id="text-17-9-10">
<ul class="org-ul">
<li>Flask AppBuilder (FAB) - framework on top of Flask
<ul class="org-ul">
<li>authentication, user management, permissions and roles</li>
</ul></li>
</ul>

<p>
You can:
</p>
<ul class="org-ul">
<li>create roles</li>
<li>create user and assign role or multiple roles</li>
<li>union roles to existing one</li>
<li>assign tables to roles</li>
<li>per model or view (can<sub>add</sub>, can<sub>delete</sub>, can<sub>show</sub>, can<sub>edit</sub> &#x2026;)</li>
<li>permissions:
<ul class="org-ul">
<li>Model &amp; Action - models are Dashboard, Slice, or User;</li>
<li>Views: views are individual web pages, like the Explore view or the SQL Lab view.</li>
<li>Data source - Slices or explore the data sources</li>
<li>Database: Granting access to a database allows for the user to access all data sources within that database</li>
</ul></li>
<li>Row Level Security - filter or clause (column = "calue" or column &gt; DATE<sub>SUB</sub>(NOW(), INTERVAL 30 DAY))
<ul class="org-ul">
<li>can be assigned to role - all tables accessed by role</li>
<li>clauses combined using AND</li>
</ul></li>
<li>Beyond FAB supported providers (Github, Twitter, LinkedIn, Google, Azure, etc), its easy to connect Superset
with other OAuth2</li>
</ul>

<p>
recommends:
</p>
<ul class="org-ul">
<li>We do not recommend altering the 3 base roles as there are a set of assumptions that Superset is built upon</li>
<li>give a user the Gamma role plus any other roles that would add access to specific data sources</li>
</ul>

<p>
Provided Roles:
</p>
<ul class="org-ul">
<li>Admin</li>
<li>Alpha - cannot grant or revoke access from other users.  limited to altering the objects that they own</li>
<li>Gamma - view the slices and dashboards made from data sources that they have access to</li>
<li>sql<sub>lab</sub></li>
<li>Public</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org9e0943b"></a>links<br />
<div class="outline-text-5" id="text-17-9-10-1">
<p>
<a href="https://flask-appbuilder.readthedocs.io/en/latest/security.html">https://flask-appbuilder.readthedocs.io/en/latest/security.html</a>
<a href="https://superset.apache.org/docs/security/">https://superset.apache.org/docs/security/</a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0fa353c" class="outline-4">
<h4 id="org0fa353c"><span class="section-number-4">17.9.11</span> semantic layer</h4>
<div class="outline-text-4" id="text-17-9-11">
<p>
physical datasets - table or view in your database
</p>
<ul class="org-ul">
<li>automatically pull in relevant information from the database (like schema and column types)</li>
<li>If a change to the underlying database table occurs, you can click <b>Sync Columns from Source</b> to force
Superset to update its internal data model.</li>
<li></li>
</ul>
<p>
virtual datasets -
</p>
<ul class="org-ul">
<li>column types (inferred from results of running the query)</li>
<li>ability to define metrics</li>
<li>ability to define calculated columns</li>
<li>ability to certify metrics or calculated columns</li>
<li>setting a cache timeout</li>
</ul>

<p>
virtual datasets - use cases:
</p>
<ul class="org-ul">
<li>Joining multiple tables (or self-joining against the same table)</li>
<li>Ad-hoc, one-off exploratory analysis</li>
<li>Transforming data in more nuanced ways than currently what Explore</li>
</ul>

<p>
features
</p>
<ul class="org-ul">
<li>Virtual Datasets</li>
<li>Metrics - line in select MAX, SUM, AVG, COUNT(*)
<ol class="org-ol">
<li>select a Time-series visualization type while in the Explore workflow. Then, you can quickly try a
few different metrics.</li>
<li>save in dataset</li>
</ol></li>
<li>Calculated Columns -</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org37364a5" class="outline-3">
<h3 id="org37364a5"><span class="section-number-3">17.10</span> <span class="todo TODO">TODO</span> Google Data Studio</h3>
</div>
<div id="outline-container-org62f14bb" class="outline-3">
<h3 id="org62f14bb"><span class="section-number-3">17.11</span> <span class="todo TODO">TODO</span> Looker</h3>
<div class="outline-text-3" id="text-17-11">
<p>
proprietary
</p>
</div>
</div>
<div id="outline-container-org02eff3f" class="outline-3">
<h3 id="org02eff3f"><span class="section-number-3">17.12</span> как выбирать:</h3>
<div class="outline-text-3" id="text-17-12">
<ul class="org-ul">
<li>собрать все и самые популярные</li>
<li>выписать критерии
<ul class="org-ul">
<li>Price</li>
<li>Datasource support</li>
<li>Deployment&amp;Support</li>
<li>Popularity</li>
<li>functionality</li>
<li>Alerting and reporting capabilities</li>
<li>Single sign-on setup</li>
<li>UX and Dashboarding experience</li>
<li>Deployment - helm chart - own deployment methods and stack needs(Kubernetes, AWS Athena etc.)</li>
</ul></li>
<li>проверить что</li>
</ul>
</div>
</div>
