BI.md


<a id="org2f2e673"></a>

### security

-   Flask AppBuilder (FAB) - framework on top of Flask
    -   authentication, user management, permissions and roles

You can:

-   create roles
-   create user and assign role or multiple roles
-   union roles to existing one
-   assign tables to roles
-   per model or view (can<sub>add</sub>, can<sub>delete</sub>, can<sub>show</sub>, can<sub>edit</sub> &#x2026;)
-   permissions:
    -   Model & Action - models are Dashboard, Slice, or User;
    -   Views: views are individual web pages, like the Explore view or the SQL Lab view.
    -   Data source - Slices or explore the data sources
    -   Database: Granting access to a database allows for the user to access all data sources within that database
-   Row Level Security - filter or clause (column = "calue" or column > DATE<sub>SUB</sub>(NOW(), INTERVAL 30 DAY))
    -   can be assigned to role - all tables accessed by role
    -   clauses combined using AND
-   Beyond FAB supported providers (Github, Twitter, LinkedIn, Google, Azure, etc), its easy to connect Superset
    with other OAuth2

recommends:

-   We do not recommend altering the 3 base roles as there are a set of assumptions that Superset is built upon
-   give a user the Gamma role plus any other roles that would add access to specific data sources

Provided Roles:

-   Admin
-   Alpha - cannot grant or revoke access from other users.  limited to altering the objects that they own
-   Gamma - view the slices and dashboards made from data sources that they have access to
-   sql<sub>lab</sub>
-   Public

1.  links

    <https://flask-appbuilder.readthedocs.io/en/latest/security.html>
    <https://superset.apache.org/docs/security/>


<a id="org031e794"></a>

### semantic layer

physical datasets - table or view in your database

-   automatically pull in relevant information from the database (like schema and column types)
-   If a change to the underlying database table occurs, you can click **Sync Columns from Source** to force
    Superset to update its internal data model.
-

virtual datasets -

-   column types (inferred from results of running the query)
-   ability to define metrics
-   ability to define calculated columns
-   ability to certify metrics or calculated columns
-   setting a cache timeout

virtual datasets - use cases:

-   Joining multiple tables (or self-joining against the same table)
-   Ad-hoc, one-off exploratory analysis
-   Transforming data in more nuanced ways than currently what Explore

features

-   Virtual Datasets
-   Metrics - line in select MAX, SUM, AVG, COUNT(\*)
    1.  select a Time-series visualization type while in the Explore workflow. Then, you can quickly try a
        few different metrics.
    2.  save in dataset
-   Calculated Columns -


<a id="org1165a06"></a>

## TODO Google Data Studio


<a id="org012e194"></a>

## TODO Looker

proprietary


<a id="orgcb61f1f"></a>

## как выбирать:

-   собрать все и самые популярные
-   выписать критерии
    -   Price
    -   Datasource support
    -   Deployment&Support
    -   Popularity
    -   functionality
    -   Alerting and reporting capabilities
    -   Single sign-on setup
    -   UX and Dashboarding experience
    -   Deployment - helm chart - own deployment methods and stack needs(Kubernetes, AWS Athena etc.)
-   проверить что
