BI.html
<div id="outline-container-org88179eb" class="outline-3">
<h3 id="org88179eb"><span class="section-number-3">17.13</span> 4 качества хорошего дашборда</h3>
<div class="outline-text-3" id="text-17-13">
<p>
Цель дашборда - представить сложную информацию в удобном для понимания формате для пользователей.
</p>

<p>
Удобная информационная панель должна обладать такими качествами:
</p>

<ol class="org-ol">
<li>Ясность</li>
</ol>
<p>
Хороший дашборд четко отображает необходимую информацию. Его назначение должно быть понятно пользователю уже через 5 секунд после того, как он в-первые увидел панель.
</p>

<ol class="org-ol">
<li>Значимость</li>
</ol>
<p>
Полезный дашборд содержит значимую, важную для принятия решений информацию.
Пользователь должен уловить историю, что стоит за дизайном.
</p>

<ol class="org-ol">
<li>Согласованность</li>
</ol>
<p>
Стиль, макет, содержание и организация дашборда должны быть согласованы между собой.
</p>

<ol class="org-ol">
<li>Простота</li>
</ol>
<p>
Если информационная панель сложна в восприятии, то она бесполезна. Дашборд нужен, чтобы подавать массивы информации в простом виде.
</p>

<p>
Как спроектировать такой дашборд?
</p>

<p>
Самый первый и важный шаг — понять кто и для чего будет пользоваться дашбордом.
</p>

<p>
Дашборд получается полезным, когда мы сосредоточиваем внимание на потребностях пользователя. Это помогает нам понять какие данные аудитории важно видеть.
</p>

<p>
Иногда пользователей у дашборда несколько. И им нужен разный уровень информации. В этом случае сегментируем аудиторию и разделяем информацию на базовый и расширенный контент.
</p>

<p>
Второй шаг - выбор правильных показателей (KPI)
Выбор правильных метрик является ключевым шагом в разработке удобных информационных панелей.
</p>

<p>
Резюме.
Создаём дашборд в соответствии с потребностями пользователей. При необходимости разделяем информацию по уровням пользования.
Выбираем правильные метрики исходя из потребностей аудитории.
</p>

<p>
Какие пункты вы бы добавили?
</p>
</div>
</div>
<div id="outline-container-org2d7babf" class="outline-3">
<h3 id="org2d7babf"><span class="section-number-3">17.14</span> Виды отчетов и дашбордов⁣⁣</h3>
<div class="outline-text-3" id="text-17-14">
<p>
По аналогии с документами, отчеты бывают оперативные, аналитические и стратегические.⁣⁣
</p>

<ul class="org-ul">
<li>Оперативный отчет – это текущие данные по состоянию на сегодня. Для него не нужна красота, он просто
показывает состояние дел на сегодня. В нем не обязательны графики и визуализации: достаточно обычной
таблички.⁣⁣
<ul class="org-ul">
<li>план-факт</li>
<li>динамика выполнения плана - line chart</li>
<li>выполнение по каналам - план факт в виде bar plot</li>
<li>выбор: года месяца</li>
</ul></li>
<li>Аналитический отчет – содержит большой объем информации, которая трудно воспринимается в таблице.  Ее нужно
визуализировать. Поэтому нужен дашборд. Он показывает тренды, сводки по конкретной ситуации.
<ul class="org-ul">
<li>количество и прирост чего-то в процентах</li>
<li>товарооборот по брендам - scatter plot с разным размером точек (средний чек - ). Выбор-год, квартал, месяц</li>
<li>товарооборот по лицам или брендам - line plot заказчик гипермаркет Выбор - магазины клиенты визиты</li>
<li>таблица с вкладками - постоянные клиенты, клиенты притока, клиенты оттока</li>
</ul></li>
<li>Стратегический отчет предназначен для управленцев, предоставляется периодически, помогает принять
долгосрочные решения. Этому помогает визуализация данных, которая упрощает принятие решений. Поэтому
дашборды для управленцев очень нужны⁣⁣
<ul class="org-ul">
<li>вверху числа,</li>
<li>воронка чего-то</li>
<li>динамика этапов lineplot</li>
<li>средний срок barplot</li>
</ul></li>
</ul>

<p>
Важно: информация на управленческих дашбордах должна быть подана максимально просто. На панели показывают
основные данные и убирают лишнюю информацию.
</p>
</div>
</div>
<div id="outline-container-orge7924b6" class="outline-3">
<h3 id="orge7924b6"><span class="section-number-3">17.15</span> советы 20</h3>
<div class="outline-text-3" id="text-17-15">
<p>
2 положительные значения зеленым, отрицательные красным
3 усечение числовой оси y в искажает информацию особенно в стобчатой диаграмме
4 для линейных диаграмм лучше усекать ось y, чтобы лучше видеть динамику
5 линейная диаграмма - толстые сглаженные линии скрывают реальные позиции, что плохо
6 круговая диаграмма - подписи рядом с долями, а не в стороне сами по себе, цвета разные
7 круговая диаграмма - не наносите подписи поверх кусков пирога, если они длинные
8 круговая диаграмма - отсортируйте куски от большего к меньшему
10 круговая диаграмма - если в центре что-то писать, то жертвуешь четкостью
11/12 сортировать столбчатую диаграмму (гистограмму)
13 горизонтальную столбчатую диаграмму для правильного отображения меток
14 линейная диаграмма хороша для коротких интервалов. На больших лучше заменить на столбчатую
</p>


<p>
F - паттерн - движение глаз
1 -&gt; 2
3 -&gt; 4
5 &#x2013;
</p>

<p>
<a href="https://vk.com/analyst_ba">https://vk.com/analyst_ba</a>
</p>
</div>
</div>
<div id="outline-container-org488f07a" class="outline-3">
<h3 id="org488f07a"><span class="section-number-3">17.16</span> этапы построения</h3>
<div class="outline-text-3" id="text-17-16">
<ol class="org-ol">
<li>тех задание на салфетке</li>
<li>эскиз для себя</li>
<li>дизайн макетов для заказчика</li>
<li>список доработок</li>
<li>финальный макет</li>
</ol>
</div>
</div>
<div id="outline-container-orgea387ce" class="outline-3">
<h3 id="orgea387ce"><span class="section-number-3">17.17</span> дашборды на смартфоне</h3>
<div class="outline-text-3" id="text-17-17">
<p>
должен давать ответы на основные вопросы пользователя
</p>
<ul class="org-ul">
<li>юзер в полевых условиях - только основное</li>
<li>упрощайте - исключить лишние метки осей</li>
<li>несколько маленьких диаграмм лучше одной большой</li>
<li>учитывайте ориентацию экрана. Для горизонтальной версии можно показать детализацию</li>
<li>выделите важное с помощью цвета</li>
<li>как диаграмма будет смотреться в темноте?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org54aa2c9" class="outline-2">
<h2 id="org54aa2c9"><span class="section-number-2">18</span> report commercial</h2>
<div class="outline-text-2" id="text-18">
</div>
