BI.md


<a id="org6dbc63d"></a>

## 4 качества хорошего дашборда

Цель дашборда - представить сложную информацию в удобном для понимания формате для пользователей.

Удобная информационная панель должна обладать такими качествами:

1.  Ясность

Хороший дашборд четко отображает необходимую информацию. Его назначение должно быть понятно пользователю уже через 5 секунд после того, как он в-первые увидел панель.

1.  Значимость

Полезный дашборд содержит значимую, важную для принятия решений информацию.
Пользователь должен уловить историю, что стоит за дизайном.

1.  Согласованность

Стиль, макет, содержание и организация дашборда должны быть согласованы между собой.

1.  Простота

Если информационная панель сложна в восприятии, то она бесполезна. Дашборд нужен, чтобы подавать массивы информации в простом виде.

Как спроектировать такой дашборд?

Самый первый и важный шаг — понять кто и для чего будет пользоваться дашбордом.

Дашборд получается полезным, когда мы сосредоточиваем внимание на потребностях пользователя. Это помогает нам понять какие данные аудитории важно видеть.

Иногда пользователей у дашборда несколько. И им нужен разный уровень информации. В этом случае сегментируем аудиторию и разделяем информацию на базовый и расширенный контент.

Второй шаг - выбор правильных показателей (KPI)
Выбор правильных метрик является ключевым шагом в разработке удобных информационных панелей.

Резюме.
Создаём дашборд в соответствии с потребностями пользователей. При необходимости разделяем информацию по уровням пользования.
Выбираем правильные метрики исходя из потребностей аудитории.

Какие пункты вы бы добавили?


<a id="org06bdcc4"></a>

## Виды отчетов и дашбордов⁣⁣

По аналогии с документами, отчеты бывают оперативные, аналитические и стратегические.⁣⁣

-   Оперативный отчет – это текущие данные по состоянию на сегодня. Для него не нужна красота, он просто
    показывает состояние дел на сегодня. В нем не обязательны графики и визуализации: достаточно обычной
    таблички.⁣⁣
    -   план-факт
    -   динамика выполнения плана - line chart
    -   выполнение по каналам - план факт в виде bar plot
    -   выбор: года месяца
-   Аналитический отчет – содержит большой объем информации, которая трудно воспринимается в таблице.  Ее нужно
    визуализировать. Поэтому нужен дашборд. Он показывает тренды, сводки по конкретной ситуации.
    -   количество и прирост чего-то в процентах
    -   товарооборот по брендам - scatter plot с разным размером точек (средний чек - ). Выбор-год, квартал, месяц
    -   товарооборот по лицам или брендам - line plot заказчик гипермаркет Выбор - магазины клиенты визиты
    -   таблица с вкладками - постоянные клиенты, клиенты притока, клиенты оттока
-   Стратегический отчет предназначен для управленцев, предоставляется периодически, помогает принять
    долгосрочные решения. Этому помогает визуализация данных, которая упрощает принятие решений. Поэтому
    дашборды для управленцев очень нужны⁣⁣
    -   вверху числа,
    -   воронка чего-то
    -   динамика этапов lineplot
    -   средний срок barplot

Важно: информация на управленческих дашбордах должна быть подана максимально просто. На панели показывают
основные данные и убирают лишнюю информацию.


<a id="orgd770419"></a>

## советы 20

2 положительные значения зеленым, отрицательные красным
3 усечение числовой оси y в искажает информацию особенно в стобчатой диаграмме
4 для линейных диаграмм лучше усекать ось y, чтобы лучше видеть динамику
5 линейная диаграмма - толстые сглаженные линии скрывают реальные позиции, что плохо
6 круговая диаграмма - подписи рядом с долями, а не в стороне сами по себе, цвета разные
7 круговая диаграмма - не наносите подписи поверх кусков пирога, если они длинные
8 круговая диаграмма - отсортируйте куски от большего к меньшему
10 круговая диаграмма - если в центре что-то писать, то жертвуешь четкостью
11/12 сортировать столбчатую диаграмму (гистограмму)
13 горизонтальную столбчатую диаграмму для правильного отображения меток
14 линейная диаграмма хороша для коротких интервалов. На больших лучше заменить на столбчатую

F - паттерн - движение глаз
1 -> 2
3 -> 4
5 &#x2013;

<https://vk.com/analyst_ba>


<a id="orgb67f2eb"></a>

## этапы построения

1.  тех задание на салфетке
2.  эскиз для себя
3.  дизайн макетов для заказчика
4.  список доработок
5.  финальный макет


<a id="org8b0971e"></a>

## дашборды на смартфоне

должен давать ответы на основные вопросы пользователя

-   юзер в полевых условиях - только основное
-   упрощайте - исключить лишние метки осей
-   несколько маленьких диаграмм лучше одной большой
-   учитывайте ориентацию экрана. Для горизонтальной версии можно показать детализацию
-   выделите важное с помощью цвета
-   как диаграмма будет смотреться в темноте?


<a id="orgdf79df7"></a>

# report commercial
