BI.html
<div id="outline-container-orge69c74c" class="outline-3">
<h3 id="orge69c74c"><span class="section-number-3">18.1</span> SAP Crystal Reports</h3>
<div class="outline-text-3" id="text-18-1">
<p>
from  USD 495.00  per named user license
</p>
</div>
</div>
</div>
<div id="outline-container-org69b9a8d" class="outline-2">
<h2 id="org69b9a8d"><span class="section-number-2">19</span> Data Warehouse producsts</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org7d6ff11" class="outline-3">
<h3 id="org7d6ff11"><span class="section-number-3">19.1</span> Clickhouse</h3>
<div class="outline-text-3" id="text-19-1">
<ul class="org-ul">
<li>yandex <a href="https://habr.com/ru/company/yandex/blog/429956/">https://habr.com/ru/company/yandex/blog/429956/</a></li>
<li>Александр зайцев "переезжаем на yandex.clickhouse"</li>
<li>VK <a href="https://www.youtube.com/watch?v=pbbcMcrQoXw">https://www.youtube.com/watch?v=pbbcMcrQoXw</a></li>
<li><a href="https://habr.com/ru/company/smi2/blog/314558/">https://habr.com/ru/company/smi2/blog/314558/</a></li>
</ul>

<p>
cons:
</p>
<ul class="org-ul">
<li>специфический SQL, join только по колонкам с одинаковыми названиями</li>
<li>недокументированный UPDATE/DELETE</li>
</ul>

<p>
install debian:
</p>
<ul class="org-ul">
<li>deb <a href="http://repo.yandex.ru/clickhouse/deb/testing/">http://repo.yandex.ru/clickhouse/deb/testing/</a> main/ or deb <a href="http://repo.yandex.ru/clickhouse/deb/stable/">http://repo.yandex.ru/clickhouse/deb/stable/</a> main/</li>
<li>apt-get install dirmngr</li>
<li><a href="http://keyserver.ubuntu.com/">http://keyserver.ubuntu.com/</a>   string: 0xE0C56BD4  Search for a key</li>
<li>create file_ with &#x2013;&#x2014;BEGIN PGP PUBLI .. EY BLOCK&#x2013;&#x2014;</li>
<li>apt-key add file_</li>
<li>apt-get update</li>
<li>apt-get install clickhouse-client clickhouse-server</li>
<li>systemctl start clickhouse-server</li>
</ul>

<p>
Типа данных: <a href="https://clickhouse.yandex/docs/ru/interfaces/formats/#sootvetstvie-tipov-dannykh">https://clickhouse.yandex/docs/ru/interfaces/formats/#sootvetstvie-tipov-dannykh</a>
</p>

<ul class="org-ul">
<li>list databases: SHOW DATABASES;</li>
<li>выбрать текущую базу: USE db;</li>
<li>список таблиц: SHOW TABLES FROM system;</li>
<li>описание таблицы: DESCRIBE TABLE system.numbers;</li>
<li>UPDATE/DELETE: <a href="https://clickhouse.yandex/docs/ru/query_language/alter/#alter-mutations">https://clickhouse.yandex/docs/ru/query_language/alter/#alter-mutations</a></li>
<li>выполняющиеся запросы: SHOW PROCESSLIST; or: watch -n1 "clickhouse-client &#x2013;query='SHOW PROCESSLIST'"</li>
</ul>
</div>
<div id="outline-container-org6917691" class="outline-4">
<h4 id="org6917691"><span class="section-number-4">19.1.1</span> Управление данными</h4>
<div class="outline-text-4" id="text-19-1-1">
<p>
В ClickHouse нет «сегментов», содержащих данные, попадающие в конкретные временные диапазоны. В нем нет
«глубокого хранения» для данных, узлы в кластере ClickHouse также отвечают и за обработку запросов, и
запостоянство/устойчивость данных, хранящихся на них. Так что вам <b>не потребуется HDFS</b> или облачное хранилище
данных вроде Amazon S3.
</p>

<p>
В ClickHouse имеются секционированные таблицы, состоящие из указанного набора узлов. Здесь нет «центральной
власти» или сервера метаданных. Все узлы, между которыми разделена та или иная таблица, содержат полные,
идентичные копии метаданных, включая адреса всех остальных узлов, на которых хранятся секции этой таблицы.
</p>

<p>
Метаданные секционированной таблицы включают «весы» узлов для распределения свежезаписываемых данных — к
примеру, 40% данных должны идти на узел A, 30% на узел B и 30% на C. Обычно же распределение должно
происходить равномерно, «перекоос», как в этом примере, требуется только тогда, когда к секционированной
таблице добавляется новый узел и нужно побыстрее заполнитьего какими-либо данными. <b>Обновления этих «весов»
должны выполняться вручную</b> администраторами кластера ClickHouse, или же автоматизированной системой,
построенной поверх ClickHouse.
</p>
</div>
</div>
<div id="outline-container-orgd502a90" class="outline-4">
<h4 id="orgd502a90"><span class="section-number-4">19.1.2</span> sql</h4>
<div class="outline-text-4" id="text-19-1-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #8ac6f2; font-weight: bold;">CREATE</span> DATABASE test;
<span style="color: #8ac6f2; font-weight: bold;">CREATE</span> <span style="color: #8ac6f2; font-weight: bold;">TABLE</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">test.t2</span> ( a Int32, b String ) ENGINE = MergeTree() <span style="color: #8ac6f2; font-weight: bold;">PRIMARY</span> <span style="color: #8ac6f2; font-weight: bold;">KEY</span> a <span style="color: #8ac6f2; font-weight: bold;">ORDER</span> <span style="color: #8ac6f2; font-weight: bold;">BY</span> a;

# <span style="color: #8ac6f2; font-weight: bold;">update</span>
<span style="color: #8ac6f2; font-weight: bold;">ALTER</span> <span style="color: #8ac6f2; font-weight: bold;">TABLE</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">test.t2</span> <span style="color: #8ac6f2; font-weight: bold;">UPDATE</span> b = <span style="color: #95e454;">'new text'</span> <span style="color: #8ac6f2; font-weight: bold;">WHERE</span> a = 1;

# <span style="color: #8ac6f2; font-weight: bold;">delete</span>
<span style="color: #8ac6f2; font-weight: bold;">ALTER</span> <span style="color: #8ac6f2; font-weight: bold;">TABLE</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">test.t2</span> <span style="color: #8ac6f2; font-weight: bold;">DELETE</span> <span style="color: #8ac6f2; font-weight: bold;">WHERE</span> a = 101;


</pre>
</div>
</div>
</div>
<div id="outline-container-org58be4a2" class="outline-4">
<h4 id="org58be4a2"><span class="section-number-4">19.1.3</span> error ssl</h4>
<div class="outline-text-4" id="text-19-1-3">
<p>
140272112277136:error:25FFF06C:DSO support routines:CRYPTO<sub>internal</sub>:functionality not supported:../contrib/ssl/crypto/dso/dso<sub>lib.c</sub>:224:
140272112277136:error:0EFFF06E:configuration file routines:CRYPTO<sub>internal</sub>:error loading dso:../contrib/ssl/crypto/conf/conf<sub>mod.c</sub>:273:module=ssl<sub>conf</sub>, path=ssl<sub>conf</sub>
140272112277136:error:0EFFF071:configuration file routines:CRYPTO<sub>internal</sub>:unknown module name:../contrib/ssl/crypto/conf/conf<sub>mod.c</sub>:214:module=ssl<sub>conf</sub>
</p>

<ul class="org-ul">
<li>I don't have a proper fix, but a workaround is to comment the ssl<sub>conf</sub> = ssl<sub>sect</sub> line you may have in your /etc/ssl/openssl.cnf under [default<sub>conf</sub>]</li>
</ul>
</div>
</div>
<div id="outline-container-orgc3cd425" class="outline-4">
<h4 id="orgc3cd425"><span class="section-number-4">19.1.4</span> Aiflow</h4>
<div class="outline-text-4" id="text-19-1-4">
<p>
pip install clickhouse-driver
</p>
<ul class="org-ul">
<li>doc <a href="https://clickhouse-driver.readthedocs.io/en/latest/">https://clickhouse-driver.readthedocs.io/en/latest/</a></li>
<li>git <a href="https://github.com/mymarilyn/clickhouse-driver">https://github.com/mymarilyn/clickhouse-driver</a></li>
<li>Hook <a href="https://github.com/WesleyBatista/clickhouse_plugin">https://github.com/WesleyBatista/clickhouse_plugin</a></li>
</ul>
</div>
</div>
