BI.md


<a id="org49fd311"></a>

## SAP Crystal Reports

from  USD 495.00  per named user license


<a id="org8903fee"></a>

# Data Warehouse producsts


<a id="orgd0a938f"></a>

## Clickhouse

-   yandex <https://habr.com/ru/company/yandex/blog/429956/>
-   Александр зайцев "переезжаем на yandex.clickhouse"
-   VK <https://www.youtube.com/watch?v=pbbcMcrQoXw>
-   <https://habr.com/ru/company/smi2/blog/314558/>

cons:

-   специфический SQL, join только по колонкам с одинаковыми названиями
-   недокументированный UPDATE/DELETE

install debian:

-   deb <http://repo.yandex.ru/clickhouse/deb/testing/> main/ or deb <http://repo.yandex.ru/clickhouse/deb/stable/> main/
-   apt-get install dirmngr
-   <http://keyserver.ubuntu.com/>   string: 0xE0C56BD4  Search for a key
-   create file\_ with &#x2013;&#x2014;BEGIN PGP PUBLI .. EY BLOCK&#x2013;&#x2014;
-   apt-key add file\_
-   apt-get update
-   apt-get install clickhouse-client clickhouse-server
-   systemctl start clickhouse-server

Типа данных: <https://clickhouse.yandex/docs/ru/interfaces/formats/#sootvetstvie-tipov-dannykh>

-   list databases: SHOW DATABASES;
-   выбрать текущую базу: USE db;
-   список таблиц: SHOW TABLES FROM system;
-   описание таблицы: DESCRIBE TABLE system.numbers;
-   UPDATE/DELETE: <https://clickhouse.yandex/docs/ru/query_language/alter/#alter-mutations>
-   выполняющиеся запросы: SHOW PROCESSLIST; or: watch -n1 "clickhouse-client &#x2013;query='SHOW PROCESSLIST'"


<a id="org126b237"></a>

### Управление данными

В ClickHouse нет «сегментов», содержащих данные, попадающие в конкретные временные диапазоны. В нем нет
«глубокого хранения» для данных, узлы в кластере ClickHouse также отвечают и за обработку запросов, и
запостоянство/устойчивость данных, хранящихся на них. Так что вам **не потребуется HDFS** или облачное хранилище
данных вроде Amazon S3.

В ClickHouse имеются секционированные таблицы, состоящие из указанного набора узлов. Здесь нет «центральной
власти» или сервера метаданных. Все узлы, между которыми разделена та или иная таблица, содержат полные,
идентичные копии метаданных, включая адреса всех остальных узлов, на которых хранятся секции этой таблицы.

Метаданные секционированной таблицы включают «весы» узлов для распределения свежезаписываемых данных — к
примеру, 40% данных должны идти на узел A, 30% на узел B и 30% на C. Обычно же распределение должно
происходить равномерно, «перекоос», как в этом примере, требуется только тогда, когда к секционированной
таблице добавляется новый узел и нужно побыстрее заполнитьего какими-либо данными. **Обновления этих «весов»
должны выполняться вручную** администраторами кластера ClickHouse, или же автоматизированной системой,
построенной поверх ClickHouse.


<a id="orgfc78cfb"></a>

### sql

    CREATE DATABASE test;
    CREATE TABLE test.t2 ( a Int32, b String ) ENGINE = MergeTree() PRIMARY KEY a ORDER BY a;

    # update
    ALTER TABLE test.t2 UPDATE b = 'new text' WHERE a = 1;

    # delete
    ALTER TABLE test.t2 DELETE WHERE a = 101;


<a id="org06d5ed7"></a>

### error ssl

140272112277136:error:25FFF06C:DSO support routines:CRYPTO<sub>internal</sub>:functionality not supported:../contrib/ssl/crypto/dso/dso<sub>lib.c</sub>:224:
140272112277136:error:0EFFF06E:configuration file routines:CRYPTO<sub>internal</sub>:error loading dso:../contrib/ssl/crypto/conf/conf<sub>mod.c</sub>:273:module=ssl<sub>conf</sub>, path=ssl<sub>conf</sub>
140272112277136:error:0EFFF071:configuration file routines:CRYPTO<sub>internal</sub>:unknown module name:../contrib/ssl/crypto/conf/conf<sub>mod.c</sub>:214:module=ssl<sub>conf</sub>

-   I don't have a proper fix, but a workaround is to comment the ssl<sub>conf</sub> = ssl<sub>sect</sub> line you may have in your /etc/ssl/openssl.cnf under [default<sub>conf</sub>]


<a id="org1f687e6"></a>

### Aiflow

pip install clickhouse-driver

-   doc <https://clickhouse-driver.readthedocs.io/en/latest/>
-   git <https://github.com/mymarilyn/clickhouse-driver>
-   Hook <https://github.com/WesleyBatista/clickhouse_plugin>
