BI.html

<div id="outline-container-org73398f2" class="outline-4">
<h4 id="org73398f2"><span class="section-number-4">19.1.5</span> Power BI</h4>
<div class="outline-text-4" id="text-19-1-5">
<ul class="org-ul">
<li>SQL URL <a href="https://renta.im/ru/blog/clickhouse/">https://renta.im/ru/blog/clickhouse/</a></li>
<li>ODBC <a href="https://github.com/yandex/clickhouse-odbc/releases">https://github.com/yandex/clickhouse-odbc/releases</a></li>
<li>Строка подключения: "Driver=ClickHouse Unicode;Database=default;Server=localhost;Port=8123;"</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8cba54b" class="outline-3">
<h3 id="org8cba54b"><span class="section-number-3">19.2</span> MariaDB</h3>
<div class="outline-text-3" id="text-19-2">
<p>
for a wide variety of use cases as replacement for MySQL
<a href="https://mariadb.com/kb/en/library/installing-and-configuring-a-single-server-columnstore-system-12x/">https://mariadb.com/kb/en/library/installing-and-configuring-a-single-server-columnstore-system-12x/</a>
cons:
</p>
<ul class="org-ul">
<li>на основе MySQL</li>
</ul>
<p>
pros:
</p>
<ul class="org-ul">
<li>single server or multi-server</li>
<li>columnar storage optimized for interactive</li>
<li>ad hoc analytics</li>
<li>scaling out as needed</li>
</ul>


<p>
create database classicmodels;
</p>

<p>
mysql -p 'classicmodels' &lt; my.sql
</p>

<p>
GRANT ALL PRIVILEGES ON classicmodels.* TO 'u'@'%' IDENTIFIED BY '123' WITH GRANT OPTION;
</p>

<p>
CREATE TABLE tmp.ta (
    id INT PRIMARY KEY,
);
</p>
</div>
<div id="outline-container-org2666037" class="outline-4">
<h4 id="org2666037"><span class="section-number-4">19.2.1</span> install</h4>
<div class="outline-text-4" id="text-19-2-1">
<ul class="org-ul">
<li><a href="https://mariadb.com/kb/en/library/7758/#debian-9">https://mariadb.com/kb/en/library/7758/#debian-9</a></li>
<li>apt-get install libdbi-perl rsync libboost-all-dev libreadline5 expect tcl-expect libjemalloc1</li>
<li>скачать вручную deb <a href="https://packages.debian.org/ru/stretch/libjemalloc1">https://packages.debian.org/ru/stretch/libjemalloc1</a></li>
<li>libboost<sub>system.so.1.62.0</sub></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfebb5e4" class="outline-3">
<h3 id="orgfebb5e4"><span class="section-number-3">19.3</span> PostgreSQL</h3>
<div class="outline-text-3" id="text-19-3">
<p>
PostgreSQL - cstore<sub>fdw</sub>, vops
</p>
</div>
</div>
<div id="outline-container-orgb02ee6e" class="outline-3">
<h3 id="orgb02ee6e"><span class="section-number-3">19.4</span> Greenplum BD</h3>
<div class="outline-text-3" id="text-19-4">
<ul class="org-ul">
<li>Опыт внедрения <a href="https://pgconf.ru/2017/94499">https://pgconf.ru/2017/94499</a></li>
</ul>
<p>
official links:
</p>
<ul class="org-ul">
<li>ODBC driver <a href="https://network.pivotal.io/products/pivotal-gpdb/#/releases/396409/file_groups/1829">https://network.pivotal.io/products/pivotal-gpdb/#/releases/396409/file_groups/1829</a></li>
</ul>
<p>
articles:
</p>
<ul class="org-ul">
<li>tinkoff <a href="https://habr.com/en/company/tinkoff/blog/267733/">https://habr.com/en/company/tinkoff/blog/267733/</a></li>
<li>tinkoff repl</li>
<li><a href="https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py">https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py</a></li>
</ul>
<p>
Forked from the main PostgreSQL line at version 8.2.15
</p>

<p>
designed to manage large-scale analytic data warehouses and business intelligence workloads.
</p>
<ul class="org-ul">
<li>на основе PostgreSQL - лучше MySQL</li>
<li>massively parallel processing (MPP)</li>
<li>PostgreSQL interface</li>
<li>performs best with a denormalized schema design</li>
<li>Greenplum provides both row-oriented and <b>column-oriented</b> table types</li>
<li>logically partition table data, either by range or by a list of values - each partition of a single table
can utilize its own storage method (row vs. column orientation)</li>
</ul>

<p>
Ограничения:
</p>
<ul class="org-ul">
<li>нельзя обновлять поле колонка которого есть ключ дистрибуции</li>
<li>column-tables обновляются чуть меньше</li>
</ul>
<p>
Рекомендации:
</p>
<ul class="org-ul">
<li>предназначенная для небольшого числа одновременных запросов. Большое число (более 600 queries per second)
лёгких запросов/транзакций, выполняющих одну операцию, негативно сказывается на производительности
базы. Хорошей практикой является агрегация большого числа update/insert в батчи.</li>
<li>один CPU на сегмент, поэтому на одну ноду от 6-8 сегментов, чтобы задействовать многопроцессорность - но это не точно</li>
<li>10 гигабит interconnection</li>
<li>чем больше дисков тем лучше</li>
<li>на серверах лучше вырубить swap. потому что он его слишком юзает</li>
<li>автовакум выключен, вакум раз в сутка, а то заблоутится буть здоров</li>
</ul>


<p>
продукт InfluxDB собирает метрики
</p>

<p>
Агрегаторы - таблицы сум по которым опять делаются выборки - от них можно отказаться
</p>
</div>


<div id="outline-container-orgdbb1232" class="outline-4">
<h4 id="orgdbb1232"><span class="section-number-4">19.4.1</span> MPP</h4>
<div class="outline-text-4" id="text-19-4-1">
<ul class="org-ul">
<li>data is distributed in chunks to all the nodes in the cluster - <b>xsegments</b></li>
<li>master/worker MPP architecture</li>
<li>Only metadata is stored on the master</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1715bd" class="outline-4">
<h4 id="orgc1715bd"><span class="section-number-4">19.4.2</span> Append-only tables</h4>
<div class="outline-text-4" id="text-19-4-2">
<ul class="org-ul">
<li><a href="https://it.toolbox.com/blogs/omerbrandis/working-with-append-only-tables-part-i-061112">https://it.toolbox.com/blogs/omerbrandis/working-with-append-only-tables-part-i-061112</a></li>
<li><a href="https://it.toolbox.com/blogs/omerbrandis/working-with-append-only-tables-part-ii-061812">https://it.toolbox.com/blogs/omerbrandis/working-with-append-only-tables-part-ii-061812</a></li>
</ul>

<p>
create table table t1 ( id int,  value<sub>col</sub> int).
</p>

<p>
insert into t1 select id,(:new<sub>value</sub> - t1.value<sub>col</sub>) from t1 where id = 11). # 11 - id
</p>

<p>
Update as insert of delta value.Drawbacks:
</p>
<ul class="org-ul">
<li>Each "object" is stored using multiple rows.</li>
<li>You may not be able to perform the insert on in parallel on multiple rows.</li>
<li>This method doesn't support non numerical types as non key columns</li>
<li>You may not be able to perform the insert on in parallel on multiple rows.</li>
</ul>
</div>
</div>

<div id="outline-container-org424437e" class="outline-4">
<h4 id="org424437e"><span class="section-number-4">19.4.3</span> install for kubernetes</h4>
<div class="outline-text-4" id="text-19-4-3">
<p>
После деплоя в кубер, в манифесте кубера нужно добавить в ДНС строки с правильными адресами
</p>
</div>
</div>
