BI.md


<a id="org968c24e"></a>

### Power BI

-   SQL URL <https://renta.im/ru/blog/clickhouse/>
-   ODBC <https://github.com/yandex/clickhouse-odbc/releases>
-   Строка подключения: "Driver=ClickHouse Unicode;Database=default;Server=localhost;Port=8123;"


<a id="orgdf9b409"></a>

## MariaDB

for a wide variety of use cases as replacement for MySQL
<https://mariadb.com/kb/en/library/installing-and-configuring-a-single-server-columnstore-system-12x/>
cons:

-   на основе MySQL

pros:

-   single server or multi-server
-   columnar storage optimized for interactive
-   ad hoc analytics
-   scaling out as needed

create database classicmodels;

mysql -p 'classicmodels' < my.sql

GRANT ALL PRIVILEGES ON classicmodels.\* TO 'u'@'%' IDENTIFIED BY '123' WITH GRANT OPTION;

CREATE TABLE tmp.ta (
    id INT PRIMARY KEY,
);


<a id="org818f41e"></a>

### install

-   <https://mariadb.com/kb/en/library/7758/#debian-9>
-   apt-get install libdbi-perl rsync libboost-all-dev libreadline5 expect tcl-expect libjemalloc1
-   скачать вручную deb <https://packages.debian.org/ru/stretch/libjemalloc1>
-   libboost<sub>system.so.1.62.0</sub>


<a id="orgf7944de"></a>

## PostgreSQL

PostgreSQL - cstore<sub>fdw</sub>, vops


<a id="org08298ee"></a>

## Greenplum BD

-   Опыт внедрения <https://pgconf.ru/2017/94499>

official links:

-   ODBC driver <https://network.pivotal.io/products/pivotal-gpdb/#/releases/396409/file_groups/1829>

articles:

-   tinkoff <https://habr.com/en/company/tinkoff/blog/267733/>
-   tinkoff repl
-   <https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py>

Forked from the main PostgreSQL line at version 8.2.15

designed to manage large-scale analytic data warehouses and business intelligence workloads.

-   на основе PostgreSQL - лучше MySQL
-   massively parallel processing (MPP)
-   PostgreSQL interface
-   performs best with a denormalized schema design
-   Greenplum provides both row-oriented and **column-oriented** table types
-   logically partition table data, either by range or by a list of values - each partition of a single table
    can utilize its own storage method (row vs. column orientation)

Ограничения:

-   нельзя обновлять поле колонка которого есть ключ дистрибуции
-   column-tables обновляются чуть меньше

Рекомендации:

-   предназначенная для небольшого числа одновременных запросов. Большое число (более 600 queries per second)
    лёгких запросов/транзакций, выполняющих одну операцию, негативно сказывается на производительности
    базы. Хорошей практикой является агрегация большого числа update/insert в батчи.
-   один CPU на сегмент, поэтому на одну ноду от 6-8 сегментов, чтобы задействовать многопроцессорность - но это не точно
-   10 гигабит interconnection
-   чем больше дисков тем лучше
-   на серверах лучше вырубить swap. потому что он его слишком юзает
-   автовакум выключен, вакум раз в сутка, а то заблоутится буть здоров

продукт InfluxDB собирает метрики

Агрегаторы - таблицы сум по которым опять делаются выборки - от них можно отказаться


<a id="org955af6b"></a>

### MPP

-   data is distributed in chunks to all the nodes in the cluster - **xsegments**
-   master/worker MPP architecture
-   Only metadata is stored on the master


<a id="orgda1a1eb"></a>

### Append-only tables

-   <https://it.toolbox.com/blogs/omerbrandis/working-with-append-only-tables-part-i-061112>
-   <https://it.toolbox.com/blogs/omerbrandis/working-with-append-only-tables-part-ii-061812>

create table table t1 ( id int,  value<sub>col</sub> int).

insert into t1 select id,(:new<sub>value</sub> - t1.value<sub>col</sub>) from t1 where id = 11). # 11 - id

Update as insert of delta value.Drawbacks:

-   Each "object" is stored using multiple rows.
-   You may not be able to perform the insert on in parallel on multiple rows.
-   This method doesn't support non numerical types as non key columns
-   You may not be able to perform the insert on in parallel on multiple rows.


<a id="org74ff410"></a>

### install for kubernetes

После деплоя в кубер, в манифесте кубера нужно добавить в ДНС строки с правильными адресами
