BI.org
*** psql
https://gpdb.docs.pivotal.io/530/utility_guide/client_utilities/psql.html
-\?
-\h - sql
- list of databases - \l or SELECT datname from pg_database;
- change database - \c test - REQUIRED
- list tables - \dt
- table definition \d+ t_name
- change password - \password or ALTER user gpadmin with password '123';
- количество столбцов в таблице - select count(*) from information_schema.columns where table_name='test';
- roles -

*** Tablespaces not needed
SELECT spcname as tblspc, fsname as filespc,
          fsedbid as seg_dbid, fselocation as datadir
   FROM   pg_tablespace pgts, pg_filespace pgfs,
          pg_filespace_entry pgfse
   WHERE  pgts.spcfsoid=pgfse.fsefsoid
          AND pgfse.fsefsoid=pgfs.oid
   ORDER BY tblspc, seg_dbid;

- pg_global for shared system catalogs
- pg_default, the default tablespace. Used by the template1 and template0 databases.
- pg_system -  data directory location created at system initialization
*** Create Tables
Two major types of table *storage techniques*:
- HEAP - default
  - MVCC)
  - CREATE TABLE c(a int PRIMARY KEY, b text)  DISTRIBUTED BY(a);
  - good for dimension tables often UPDATE/DELETE - Compression not available
  - UNIQUE - table must be hash-distributed (not DISTRIBUTED RANDOMLY) and constraint columns must be the same
    as (or a superset of) the table's distribution key columns
- Append Only or Append Optimized starting with 4.3
-
  - allow UPDATE
  - CREATE TABLE bar (a int, b text)  WITH (appendonly=true, orientation=column) DISTRIBUTED BY(a)
  - UNIQUE and PRIMARY KEY constraints are not allowed on append-optimized tables
  - Allow Column-level Compression (default -  no compression):
    - WITH (appendonly=true, compresstype=zlib, compresslevel=5);
    - Table Orientation:
      - Row: ZLIB and QUICKLZ
      - Column: RLE_TYPE,
	- ZLIB - лучше сжимает  compresslevel=1 - 9
	- QUICKLZ - быстрее на compresslevel=1 (1 - default)
    - column_name data_type ENCODING (compresstype=zlib, compresslevel=6) - specifies for individual columns

*Append Optimized*:
- Insert:
  1. INSERT INTO ...
  2. ANALYZE ao_table; - собирает статистическую информацию Впоследствии планировщик запросов будет использовать эту статистику для выбора
     наиболее эффективных планов выполнения запросов.
- works best with denormalized fact tables

All tables
- are distributed - table rows
  - DISTRIBUTED BY field (hash distribution) - default - p key or first field
  - DISTRIBUTED RANDOMLY (round-robin distribution)  - no unique field(s)
- primary key is distribution key for the table by default
- Choose a distribution key that is unique for each record, such as the primary key
- Foreign keys are not supported. You can declare them, but referential integrity is not enforced.

- default - Row-oriented heap tables
- append-optimized - UPDATE and DELETE are not allowed.
  - Column-oriented storage - aggregations over a small number of columns, or for single columns that require
    regular updates without modifying other column data. - many columns where you access a small subset of
    columns in your queries
- Compression - greater adjacent compression achieved, the more difficult random access can become

