BI.html
<div id="outline-container-org1a6c62d" class="outline-4">
<h4 id="org1a6c62d"><span class="section-number-4">19.4.4</span> psql</h4>
<div class="outline-text-4" id="text-19-4-4">
<p>
<a href="https://gpdb.docs.pivotal.io/530/utility_guide/client_utilities/psql.html">https://gpdb.docs.pivotal.io/530/utility_guide/client_utilities/psql.html</a>
-\?
-\h - sql
</p>
<ul class="org-ul">
<li>list of databases - \l or SELECT datname from pg<sub>database</sub>;</li>
<li>change database - \c test - REQUIRED</li>
<li>list tables - \dt</li>
<li>table definition \d+ t<sub>name</sub></li>
<li>change password - \password or ALTER user gpadmin with password '123';</li>
<li>количество столбцов в таблице - select count(*) from information<sub>schema.columns</sub> where table<sub>name</sub>='test';</li>
<li>roles -</li>
</ul>
</div>
</div>

<div id="outline-container-org3831abd" class="outline-4">
<h4 id="org3831abd"><span class="section-number-4">19.4.5</span> Tablespaces not needed</h4>
<div class="outline-text-4" id="text-19-4-5">
<p>
SELECT spcname as tblspc, fsname as filespc,
          fsedbid as seg<sub>dbid</sub>, fselocation as datadir
   FROM   pg<sub>tablespace</sub> pgts, pg<sub>filespace</sub> pgfs,
          pg<sub>filespace</sub><sub>entry</sub> pgfse
   WHERE  pgts.spcfsoid=pgfse.fsefsoid
          AND pgfse.fsefsoid=pgfs.oid
   ORDER BY tblspc, seg<sub>dbid</sub>;
</p>

<ul class="org-ul">
<li>pg<sub>global</sub> for shared system catalogs</li>
<li>pg<sub>default</sub>, the default tablespace. Used by the template1 and template0 databases.</li>
<li>pg<sub>system</sub> -  data directory location created at system initialization</li>
</ul>
</div>
</div>
<div id="outline-container-org44a45f9" class="outline-4">
<h4 id="org44a45f9"><span class="section-number-4">19.4.6</span> Create Tables</h4>
<div class="outline-text-4" id="text-19-4-6">
<p>
Two major types of table <b>storage techniques</b>:
</p>
<ul class="org-ul">
<li>HEAP - default
<ul class="org-ul">
<li>MVCC)</li>
<li>CREATE TABLE c(a int PRIMARY KEY, b text)  DISTRIBUTED BY(a);</li>
<li>good for dimension tables often UPDATE/DELETE - Compression not available</li>
<li>UNIQUE - table must be hash-distributed (not DISTRIBUTED RANDOMLY) and constraint columns must be the same
as (or a superset of) the table's distribution key columns</li>
</ul></li>
<li>Append Only or Append Optimized starting with 4.3</li>
<li><ul class="org-ul">
<li>allow UPDATE</li>
<li>CREATE TABLE bar (a int, b text)  WITH (appendonly=true, orientation=column) DISTRIBUTED BY(a)</li>
<li>UNIQUE and PRIMARY KEY constraints are not allowed on append-optimized tables</li>
<li>Allow Column-level Compression (default -  no compression):
<ul class="org-ul">
<li>WITH (appendonly=true, compresstype=zlib, compresslevel=5);</li>
<li>Table Orientation:
<ul class="org-ul">
<li>Row: ZLIB and QUICKLZ</li>
<li>Column: RLE<sub>TYPE</sub>,
<ul class="org-ul">
<li>ZLIB - лучше сжимает  compresslevel=1 - 9</li>
<li>QUICKLZ - быстрее на compresslevel=1 (1 - default)</li>
</ul></li>
</ul></li>
<li>column<sub>name</sub> data<sub>type</sub> ENCODING (compresstype=zlib, compresslevel=6) - specifies for individual columns</li>
</ul></li>
</ul></li>
</ul>

<p>
<b>Append Optimized</b>:
</p>
<ul class="org-ul">
<li>Insert:
<ol class="org-ol">
<li>INSERT INTO &#x2026;</li>
<li>ANALYZE ao<sub>table</sub>; - собирает статистическую информацию Впоследствии планировщик запросов будет использовать эту статистику для выбора
наиболее эффективных планов выполнения запросов.</li>
</ol></li>
<li>works best with denormalized fact tables</li>
</ul>

<p>
All tables
</p>
<ul class="org-ul">
<li>are distributed - table rows
<ul class="org-ul">
<li>DISTRIBUTED BY field (hash distribution) - default - p key or first field</li>
<li>DISTRIBUTED RANDOMLY (round-robin distribution)  - no unique field(s)</li>
</ul></li>
<li>primary key is distribution key for the table by default</li>
<li>Choose a distribution key that is unique for each record, such as the primary key</li>
<li>Foreign keys are not supported. You can declare them, but referential integrity is not enforced.</li>

<li>default - Row-oriented heap tables</li>
<li>append-optimized - UPDATE and DELETE are not allowed.
<ul class="org-ul">
<li>Column-oriented storage - aggregations over a small number of columns, or for single columns that require
regular updates without modifying other column data. - many columns where you access a small subset of
columns in your queries</li>
</ul></li>
<li>Compression - greater adjacent compression achieved, the more difficult random access can become</li>
</ul>
</div>
</div>
