BI.org
*** data types
- Use the smallest numeric data type
- int smalles as possible for dimensions -  appropriate for fact
- text - VARCHAR or TEXT, (CHAR is not recommended)

| Name                | Alias   | Size                  | Desc                           |                              |
|---------------------+---------+-----------------------+--------------------------------+------------------------------|
| bigint              | int8    | 8 bytes               | large range integer            |                              |
| bigserial           | serial8 | 8 bytes               | large autoincrementing integer |                              |
| bit [ (n) ]         | n bits  | bit string            | fixed-length bit string        |                              |
| bit varying [ (n) ] | varbit  | actual number of bits | variable-length bit string     |                              |
| boolean             | bool    | 1 byte                | true/false                     | logical boolean (true/false) |
box 	  	32 bytes 	((x1,y1),(x2,y2)) 	rectangular box in the plane - not allowed in distribution key columns.
bytea1 	  	1 byte + binary string 	sequence of octets 	variable-length binary string
character [ (n) ]1 	char [ (n) ] 	1 byte + n 	strings up to n characters in length 	fixed-length, blank padded
| character varying[(n)] | varchar[(n)] | 1 byte + string size | variable-length with limit |
cidr 	  	12 or 24 bytes 	  	IPv4 and IPv6 networks
circle 	  	24 bytes 	<(x,y),r> (center and radius) 	circle in the plane - not allowed in distribution key columns.
| date |   | 4 bytes | calendar date (year, month, day) |
decimal [ (p, s) ]1 	numeric [ (p, s) ] 	variable 	no limit 	user-specified precision, exact
double precision 	float8

float
	8 bytes 	15 decimal digits precision 	variable-precision, inexact
inet 	  	12 or 24 bytes 	  	IPv4 and IPv6 hosts and networks
integer 	int, int4 	4 bytes 	-2147483648 to +2147483647 	usual choice for integer
interval [ (p) ] 	  	12 bytes 	-178000000 years - 178000000 years 	time span
json 	  	1 byte + json size 	json of any length 	variable unlimited length
lseg 	  	32 bytes 	((x1,y1),(x2,y2)) 	line segment in the plane - not allowed in distribution key columns.
macaddr 	  	6 bytes 	  	MAC addresses
| money |   | 8 bytes | currency amount |
path1 	  	16+16n bytes 	[(x1,y1),...] 	geometric path in the plane - not allowed in distribution key columns.
point 	  	16 bytes 	(x,y) 	geometric point in the plane - not allowed in distribution key columns.
polygon 	  	40+16n bytes 	((x1,y1),...) 	closed geometric path in the plane - not allowed in distribution key columns.
real 	float4 	4 bytes 	6 decimal digits precision 	variable-precision, inexact
serial 	serial4 	4 bytes 	1 to 2147483647 	autoincrementing integer
smallint 	int2 	2 bytes 	-32768 to +32767 	small range integer
| text |   | 1 byte + string size | variable unlimited length |
time [ (p) ] [ without time zone ] 	  	8 bytes 	00:00:00[.000000] - 24:00:00[.000000] 	time of day only
time [ (p) ] with time zone 	timetz 	12 bytes 	00:00:00+1359 - 24:00:00-1359 	time of day only, with time zone
timestamp [ (p) ] [ without time zone ] 	  	8 bytes 	4713 BC - 294,277 AD 	both date and time
timestamp [ (p) ] with time zone 	timestamptz 	8 bytes 	4713 BC - 294,277 AD 	both date and time, with time zone
uuid 	  	32 bytes 	  	Universally Unique Identifiers according to RFC 4122, ISO/IEC 9834-8:2005
xml1 	  	1 byte + xml size 	xml of any length 	variable unlimited length
txid_snapshot
