BI.html

<div id="outline-container-orgf25465c" class="outline-4">
<h4 id="orgf25465c"><span class="section-number-4">19.4.7</span> data types</h4>
<div class="outline-text-4" id="text-19-4-7">
<ul class="org-ul">
<li>Use the smallest numeric data type</li>
<li>int smalles as possible for dimensions -  appropriate for fact</li>
<li>text - VARCHAR or TEXT, (CHAR is not recommended)</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Alias</th>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-left">Desc</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bigint</td>
<td class="org-left">int8</td>
<td class="org-left">8 bytes</td>
<td class="org-left">large range integer</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bigserial</td>
<td class="org-left">serial8</td>
<td class="org-left">8 bytes</td>
<td class="org-left">large autoincrementing integer</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bit [ (n) ]</td>
<td class="org-left">n bits</td>
<td class="org-left">bit string</td>
<td class="org-left">fixed-length bit string</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bit varying [ (n) ]</td>
<td class="org-left">varbit</td>
<td class="org-left">actual number of bits</td>
<td class="org-left">variable-length bit string</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">boolean</td>
<td class="org-left">bool</td>
<td class="org-left">1 byte</td>
<td class="org-left">true/false</td>
<td class="org-left">logical boolean (true/false)</td>
</tr>
</tbody>
</table>
<p>
box 	  	32 bytes 	((x1,y1),(x2,y2)) 	rectangular box in the plane - not allowed in distribution key columns.
bytea1 	  	1 byte + binary string 	sequence of octets 	variable-length binary string
character [ (n) ]1 	char [ (n) ] 	1 byte + n 	strings up to n characters in length 	fixed-length, blank padded
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">character varying[(n)]</td>
<td class="org-left">varchar[(n)]</td>
<td class="org-left">1 byte + string size</td>
<td class="org-left">variable-length with limit</td>
</tr>
</tbody>
</table>
<p>
cidr 	  	12 or 24 bytes 	  	IPv4 and IPv6 networks
circle 	  	24 bytes 	&lt;(x,y),r&gt; (center and radius) 	circle in the plane - not allowed in distribution key columns.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">date</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">4 bytes</td>
<td class="org-left">calendar date (year, month, day)</td>
</tr>
</tbody>
</table>
<p>
decimal [ (p, s) ]1 	numeric [ (p, s) ] 	variable 	no limit 	user-specified precision, exact
double precision 	float8
</p>

<p>
float
	8 bytes 	15 decimal digits precision 	variable-precision, inexact
inet 	  	12 or 24 bytes 	  	IPv4 and IPv6 hosts and networks
integer 	int, int4 	4 bytes 	-2147483648 to +2147483647 	usual choice for integer
interval [ (p) ] 	  	12 bytes 	-178000000 years - 178000000 years 	time span
json 	  	1 byte + json size 	json of any length 	variable unlimited length
lseg 	  	32 bytes 	((x1,y1),(x2,y2)) 	line segment in the plane - not allowed in distribution key columns.
macaddr 	  	6 bytes 	  	MAC addresses
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">money</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">8 bytes</td>
<td class="org-left">currency amount</td>
</tr>
</tbody>
</table>
<p>
path1 	  	16+16n bytes 	[(x1,y1),&#x2026;] 	geometric path in the plane - not allowed in distribution key columns.
point 	  	16 bytes 	(x,y) 	geometric point in the plane - not allowed in distribution key columns.
polygon 	  	40+16n bytes 	((x1,y1),&#x2026;) 	closed geometric path in the plane - not allowed in distribution key columns.
real 	float4 	4 bytes 	6 decimal digits precision 	variable-precision, inexact
serial 	serial4 	4 bytes 	1 to 2147483647 	autoincrementing integer
smallint 	int2 	2 bytes 	-32768 to +32767 	small range integer
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">text</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1 byte + string size</td>
<td class="org-left">variable unlimited length</td>
</tr>
</tbody>
</table>
<p>
time [ (p) ] [ without time zone ] 	  	8 bytes 	00:00:00[.000000] - 24:00:00[.000000] 	time of day only
time [ (p) ] with time zone 	timetz 	12 bytes 	00:00:00+1359 - 24:00:00-1359 	time of day only, with time zone
timestamp [ (p) ] [ without time zone ] 	  	8 bytes 	4713 BC - 294,277 AD 	both date and time
timestamp [ (p) ] with time zone 	timestamptz 	8 bytes 	4713 BC - 294,277 AD 	both date and time, with time zone
uuid 	  	32 bytes 	  	Universally Unique Identifiers according to RFC 4122, ISO/IEC 9834-8:2005
xml1 	  	1 byte + xml size 	xml of any length 	variable unlimited length
txid<sub>snapshot</sub>
</p>
</div>
</div>
