BI.org
*** ROLE
create role
- CREATE ROLE gpuser WITH NOSUPERUSER LOGIN PASSWORD '123';
- \c db
- GRANT CONNECT ON DATABASE obor to gpuser;
- GRANT SELECT ON table TO user1;
drop role:
1. DROP OWNED BY doomed_role;
2. DROP ROLE doomed_role;
*** Greenplum ETL
 - https://greenplum.org/greenplum-etl/
 - directly to master
 - Pg_dump -  command line tool that can extract data from a table to a file and restore
 - copy - SQL command of Postgres and Greenplum
 - SDK interface:  libpq, ODBC and JDBC
 - Gpfdist - can load data in parallel on every segment directly without bothering the master

*** Power BI
- https://www.postgresql.org/ftp/odbc/versions/msi/
- Driver={PostgreSQL ANSI(x64)};Server=10.77.51.121 address;Port=31412;Database=test;
- DRIVER={PostgreSQL Unicode(x64)};Server=10.77.51.121;Port=32232;DATABASE=obor;

*** Serial
*** userful SQL
- SELECT * FROM pg_stat_activity - Viewing current PostgreSQL queries
** Apache Druid
- https://druid.apache.org/docs/latest/design/index.html
** in memory additional DB with replication
 move database files to tmpfs
** DB vertica community edition
 limited to 1TB of data and 3 database nodes

* Oracle
** Oracle Instant Client
set of libraries and utilites to connecto to Oracle database
 https://www.oracle.com/database/technologies/instant-client.html
** SQL* plus
  - export NLS_LANG=AMERICAN_AMERICA.AL32UTF8;
  - set colsep '|' set linesize 167 set pagesize 30 set pagesize 1000
  - connection:
    - sqlplus username/password@host:port/servicex
    - or username/password@'(DESCRIPTION = (ADDRESS_LIST = (ADDRESS = (PROTOCOL = TCP)(HOST = ip_or_dns)(PORT = p))) (CONNECT_DATA = (SERVICE_NAME = s)))
    - or with /opt/oracle/instantclient_19_3/network/admin/tnsnames.ora - sqlplus x/y@myDb

- DBever https://github.com/dbeaver
  - Небходим instance client и несколько дополнительных jar библиотек с оф сайта
#+BEGIN_SRC sql
myDb  =
 (DESCRIPTION =
   (ADDRESS_LIST =
     (ADDRESS = (PROTOCOL = TCP)(Host = c)(Port =a))
   )
 (CONNECT_DATA =
   (SERVICE_NAME =b)
 )
)
#+END_SRC

*SID and SERVICE_NAME*
- https://www.erpgreat.com/oracle-database/finding-oracle-sid-of-a-database.htm
- http://qaru.site/questions/44184/how-sid-is-different-from-service-name-in-oracle-tnsnamesora
** Constraints
- C :: Check on a table - Column
- O :: Read Only on a view - Object
- P :: Primary Key - Object
- R :: Referential AKA Foreign Key - Column
- U :: Unique Key - Column
- V :: Check Option on a view - Object
