BI.html
<div id="outline-container-orgcb5bf4e" class="outline-4">
<h4 id="orgcb5bf4e"><span class="section-number-4">19.4.8</span> ROLE</h4>
<div class="outline-text-4" id="text-19-4-8">
<p>
create role
</p>
<ul class="org-ul">
<li>CREATE ROLE gpuser WITH NOSUPERUSER LOGIN PASSWORD '123';</li>
<li>\c db</li>
<li>GRANT CONNECT ON DATABASE obor to gpuser;</li>
<li>GRANT SELECT ON table TO user1;</li>
</ul>
<p>
drop role:
</p>
<ol class="org-ol">
<li>DROP OWNED BY doomed<sub>role</sub>;</li>
<li>DROP ROLE doomed<sub>role</sub>;</li>
</ol>
</div>
</div>
<div id="outline-container-org66e45c3" class="outline-4">
<h4 id="org66e45c3"><span class="section-number-4">19.4.9</span> Greenplum ETL</h4>
<div class="outline-text-4" id="text-19-4-9">
<ul class="org-ul">
<li><a href="https://greenplum.org/greenplum-etl/">https://greenplum.org/greenplum-etl/</a></li>
<li>directly to master</li>
<li>Pg<sub>dump</sub> -  command line tool that can extract data from a table to a file and restore</li>
<li>copy - SQL command of Postgres and Greenplum</li>
<li>SDK interface:  libpq, ODBC and JDBC</li>
<li>Gpfdist - can load data in parallel on every segment directly without bothering the master</li>
</ul>
</div>
</div>

<div id="outline-container-org30a8031" class="outline-4">
<h4 id="org30a8031"><span class="section-number-4">19.4.10</span> Power BI</h4>
<div class="outline-text-4" id="text-19-4-10">
<ul class="org-ul">
<li><a href="https://www.postgresql.org/ftp/odbc/versions/msi/">https://www.postgresql.org/ftp/odbc/versions/msi/</a></li>
<li>Driver={PostgreSQL ANSI(x64)};Server=10.77.51.121 address;Port=31412;Database=test;</li>
<li>DRIVER={PostgreSQL Unicode(x64)};Server=10.77.51.121;Port=32232;DATABASE=obor;</li>
</ul>
</div>
</div>

<div id="outline-container-orga2400a1" class="outline-4">
<h4 id="orga2400a1"><span class="section-number-4">19.4.11</span> Serial</h4>
</div>
<div id="outline-container-org97e9fa2" class="outline-4">
<h4 id="org97e9fa2"><span class="section-number-4">19.4.12</span> userful SQL</h4>
<div class="outline-text-4" id="text-19-4-12">
<ul class="org-ul">
<li>SELECT * FROM pg<sub>stat</sub><sub>activity</sub> - Viewing current PostgreSQL queries</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4f44d2a" class="outline-3">
<h3 id="org4f44d2a"><span class="section-number-3">19.5</span> Apache Druid</h3>
<div class="outline-text-3" id="text-19-5">
<ul class="org-ul">
<li><a href="https://druid.apache.org/docs/latest/design/index.html">https://druid.apache.org/docs/latest/design/index.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org52991b7" class="outline-3">
<h3 id="org52991b7"><span class="section-number-3">19.6</span> in memory additional DB with replication</h3>
<div class="outline-text-3" id="text-19-6">
<p>
move database files to tmpfs
</p>
</div>
</div>
<div id="outline-container-org743fd91" class="outline-3">
<h3 id="org743fd91"><span class="section-number-3">19.7</span> DB vertica community edition</h3>
<div class="outline-text-3" id="text-19-7">
<p>
limited to 1TB of data and 3 database nodes
</p>
</div>
</div>
</div>

<div id="outline-container-org8e57edd" class="outline-2">
<h2 id="org8e57edd"><span class="section-number-2">20</span> Oracle</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-orgc3fa545" class="outline-3">
<h3 id="orgc3fa545"><span class="section-number-3">20.1</span> Oracle Instant Client</h3>
<div class="outline-text-3" id="text-20-1">
<p>
set of libraries and utilites to connecto to Oracle database
 <a href="https://www.oracle.com/database/technologies/instant-client.html">https://www.oracle.com/database/technologies/instant-client.html</a>
</p>
</div>
</div>
<div id="outline-container-orgd0902b0" class="outline-3">
<h3 id="orgd0902b0"><span class="section-number-3">20.2</span> SQL* plus</h3>
<div class="outline-text-3" id="text-20-2">
<ul class="org-ul">
<li>export NLS<sub>LANG</sub>=AMERICAN<sub>AMERICA.AL32UTF8</sub>;</li>
<li>set colsep '|' set linesize 167 set pagesize 30 set pagesize 1000</li>
<li>connection:
<ul class="org-ul">
<li>sqlplus username/password@host:port/servicex</li>
<li>or username/password@'(DESCRIPTION = (ADDRESS<sub>LIST</sub> = (ADDRESS = (PROTOCOL = TCP)(HOST = ip<sub>or</sub><sub>dns</sub>)(PORT = p))) (CONNECT<sub>DATA</sub> = (SERVICE<sub>NAME</sub> = s)))</li>
<li>or with /opt/oracle/instantclient<sub>19</sub><sub>3</sub>/network/admin/tnsnames.ora - sqlplus x/y@myDb</li>
</ul></li>
</ul>
<ul class="org-ul">
<li>DBever <a href="https://github.com/dbeaver">https://github.com/dbeaver</a>
<ul class="org-ul">
<li>Небходим instance client и несколько дополнительных jar библиотек с оф сайта</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-sql">myDb  =
 (DESCRIPTION =
   (ADDRESS_LIST =
     (ADDRESS = (PROTOCOL = TCP)(<span style="color: #8ac6f2; font-weight: bold;">Host</span> = c)(Port =a))
   )
 (CONNECT_DATA =
   (SERVICE_NAME =b)
 )
)
</pre>
</div>

<p>
<b>SID and SERVICE<sub>NAME</sub></b>
</p>
<ul class="org-ul">
<li><a href="https://www.erpgreat.com/oracle-database/finding-oracle-sid-of-a-database.htm">https://www.erpgreat.com/oracle-database/finding-oracle-sid-of-a-database.htm</a></li>
<li><a href="http://qaru.site/questions/44184/how-sid-is-different-from-service-name-in-oracle-tnsnamesora">http://qaru.site/questions/44184/how-sid-is-different-from-service-name-in-oracle-tnsnamesora</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga5d5de9" class="outline-3">
<h3 id="orga5d5de9"><span class="section-number-3">20.3</span> Constraints</h3>
<div class="outline-text-3" id="text-20-3">
<dl class="org-dl">
<dt>C</dt><dd>Check on a table - Column</dd>
<dt>O</dt><dd>Read Only on a view - Object</dd>
<dt>P</dt><dd>Primary Key - Object</dd>
<dt>R</dt><dd>Referential AKA Foreign Key - Column</dd>
<dt>U</dt><dd>Unique Key - Column</dd>
<dt>V</dt><dd>Check Option on a view - Object</dd>
</dl>
</div>
</div>
