BI.md


<a id="orgb4c0606"></a>

### ROLE

create role

-   CREATE ROLE gpuser WITH NOSUPERUSER LOGIN PASSWORD '123';
-   \c db
-   GRANT CONNECT ON DATABASE obor to gpuser;
-   GRANT SELECT ON table TO user1;

drop role:

1.  DROP OWNED BY doomed<sub>role</sub>;
2.  DROP ROLE doomed<sub>role</sub>;


<a id="org016c2d1"></a>

### Greenplum ETL

-   <https://greenplum.org/greenplum-etl/>
-   directly to master
-   Pg<sub>dump</sub> -  command line tool that can extract data from a table to a file and restore
-   copy - SQL command of Postgres and Greenplum
-   SDK interface:  libpq, ODBC and JDBC
-   Gpfdist - can load data in parallel on every segment directly without bothering the master


<a id="org3cf1fa6"></a>

### Power BI

-   <https://www.postgresql.org/ftp/odbc/versions/msi/>
-   Driver={PostgreSQL ANSI(x64)};Server=10.77.51.121 address;Port=31412;Database=test;
-   DRIVER={PostgreSQL Unicode(x64)};Server=10.77.51.121;Port=32232;DATABASE=obor;


<a id="org335f1d6"></a>

### Serial


<a id="org195070e"></a>

### userful SQL

-   SELECT \* FROM pg<sub>stat</sub><sub>activity</sub> - Viewing current PostgreSQL queries


<a id="orgdf9a9d7"></a>

## Apache Druid

-   <https://druid.apache.org/docs/latest/design/index.html>


<a id="org5d42311"></a>

## in memory additional DB with replication

move database files to tmpfs


<a id="orgffa543d"></a>

## DB vertica community edition

limited to 1TB of data and 3 database nodes


<a id="orgdef0e1c"></a>

# Oracle


<a id="org7f8ba80"></a>

## Oracle Instant Client

set of libraries and utilites to connecto to Oracle database
 <https://www.oracle.com/database/technologies/instant-client.html>


<a id="orgfbe81b5"></a>

## SQL\* plus

-   export NLS<sub>LANG</sub>=AMERICAN<sub>AMERICA.AL32UTF8</sub>;
-   set colsep '|' set linesize 167 set pagesize 30 set pagesize 1000
-   connection:
    -   sqlplus username/password@host:port/servicex
    -   or username/password@'(DESCRIPTION = (ADDRESS<sub>LIST</sub> = (ADDRESS = (PROTOCOL = TCP)(HOST = ip<sub>or</sub><sub>dns</sub>)(PORT = p))) (CONNECT<sub>DATA</sub> = (SERVICE<sub>NAME</sub> = s)))
    -   or with /opt/oracle/instantclient<sub>19</sub><sub>3</sub>/network/admin/tnsnames.ora - sqlplus x/y@myDb

-   DBever <https://github.com/dbeaver>
    -   Небходим instance client и несколько дополнительных jar библиотек с оф сайта

    myDb  =
     (DESCRIPTION =
       (ADDRESS_LIST =
         (ADDRESS = (PROTOCOL = TCP)(Host = c)(Port =a))
       )
     (CONNECT_DATA =
       (SERVICE_NAME =b)
     )
    )

**SID and SERVICE<sub>NAME</sub>**

-   <https://www.erpgreat.com/oracle-database/finding-oracle-sid-of-a-database.htm>
-   <http://qaru.site/questions/44184/how-sid-is-different-from-service-name-in-oracle-tnsnamesora>


<a id="org586470a"></a>

## Constraints

-   **C:** Check on a table - Column
-   **O:** Read Only on a view - Object
-   **P:** Primary Key - Object
-   **R:** Referential AKA Foreign Key - Column
-   **U:** Unique Key - Column
-   **V:** Check Option on a view - Object
