BI.org
** SQL useful
- http://sql.fliplinux.com/oracle-5.html
- https://en.wikipedia.org/wiki/Oracle_metadata
- dependencies - select * from dba_dependencies where referenced_type='TABLE' and referenced_name='Z#POOLING';
- constrains - SELECT table_name, constraint_name, constraint_type FROM user_constraints;
- поля таблицы - DESC tbname;

#+BEGIN_SRC sql
-- All foregn keys:
SELECT
	c_list.CONSTRAINT_NAME as NAME,
	c_src.TABLE_NAME as SRC_TABLE,
	c_src.COLUMN_NAME as SRC_COLUMN,
	c_dest.TABLE_NAME as DEST_TABLE, -- primary key table
	c_dest.COLUMN_NAME as DEST_COLUMN
FROM ALL_CONSTRAINTS c_list,
     ALL_CONS_COLUMNS c_src,
     ALL_CONS_COLUMNS c_dest
WHERE c_list.CONSTRAINT_NAME = c_src.CONSTRAINT_NAME
  AND c_list.R_CONSTRAINT_NAME = c_dest.CONSTRAINT_NAME
  AND c_list.CONSTRAINT_TYPE = 'R'
  AND c_src.TABLE_NAME = 'Z#NU_AT_DEP_PRC' -- table with foreign keys
GROUP BY c_list.CONSTRAINT_NAME,
	  c_src.TABLE_NAME,
         c_src.COLUMN_NAME,
         c_dest.TABLE_NAME,
         c_dest.COLUMN_NAME;
#+END_SRC

** Memory Architecture
- https://docs.oracle.com/database/121/CNCPT/memory.htm
-
- System global area (SGA) - for one Oracle Database instance - All server and background processes share the
  SGA
  - Database Buffer Cache
  - In-Memory Column Store
  - Redo Log Buffer
  - Shared Pool
  - Large Pool
  - Java Pool
  - Streams Pool
  - Fixed SGA
- Program global area (PGA) - exists for each server process and background process. The collection of
  individual PGAs is the total instance PGA, or instance PGA.
  - пространство стека - это память, хранящая переменные сеансов, массивы сеансов и т.д.
  - информация сеанса - если Oracle работает не в мультинитевом режиме, то информация сеанса хранится в PGA. В
    противном случае, информация сеанса хранится в SGA.
  - приватная SQL-область - это часть PGA, где хранятся связанные переменные и буферы реального времени
- User global area (UGA) - user session
- Software code areas - areas are portions of memory used to store code that is being run or can be run

Процессы:
- пользовательские процессы - управляет вводом и взаимодействует с серверными процессами
- процессы Oracle
  - серверные процессы (выполняющие функции для активных процессов)
  - фоновые процессы (выполняют функции СУРБД в целом).
** cx_Oracle python
https://www.oracle.com/technetwork/articles/dsl/prez-python-queries-101587.html

*INSTALL*
- bashrc:
  - export LD_LIBRARY_PATH=/opt/oracle/instantclient_19_3:$LD_LIBRARY_PATH
  - export PATH=/opt/oracle/instantclient_19_3:$PATH

** characters
- если создать таблицу с именами полей в кавычках, то к ним можно обращаться только в кавычках
- By default, Oracle identifiers (table names, column names, etc.) are case- insensitive.
- You can make them case-sensitive by using quotes around them (eg: SELECT * FROM "My_Table" WHERE
  "my_field" = 1 )
* ETL vs. ELT
- ETL (Extract, Transform, Load) - Extract -> Staging_Area -> T&L
- ELT (Extract, Load, Transform) - Extract&Load -> Hadoop -> Transform -> PureData System for analysisn and analisys
* ETL Extract, Transform, Load- traditional ETL paradigm - batch-driven
- new ETL paradigm - Kafka - Change Data Capture(CDC) - stream - event-driven

** targets
- Привести все данные к единой системе значений и детализации, попутно обеспечив их качество и
  надежность;
- после преобразования можно было понять, из каких именно исходных данных и сумм собралась каждая
  строчка преобразованных данных.

