BI.html
<div id="outline-container-org1b82ae4" class="outline-3">
<h3 id="org1b82ae4"><span class="section-number-3">20.4</span> SQL useful</h3>
<div class="outline-text-3" id="text-20-4">
<ul class="org-ul">
<li><a href="http://sql.fliplinux.com/oracle-5.html">http://sql.fliplinux.com/oracle-5.html</a></li>
<li><a href="https://en.wikipedia.org/wiki/Oracle_metadata">https://en.wikipedia.org/wiki/Oracle_metadata</a></li>
<li>dependencies - select * from dba<sub>dependencies</sub> where referenced<sub>type</sub>='TABLE' and referenced<sub>name</sub>='Z#POOLING';</li>
<li>constrains - SELECT table<sub>name</sub>, constraint<sub>name</sub>, constraint<sub>type</sub> FROM user<sub>constraints</sub>;</li>
<li>поля таблицы - DESC tbname;</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #99968b; font-style: italic;">-- All foregn keys:</span>
<span style="color: #8ac6f2; font-weight: bold;">SELECT</span>
        c_list.<span style="color: #8ac6f2; font-weight: bold;">CONSTRAINT_NAME</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> <span style="color: #8ac6f2; font-weight: bold;">NAME</span>,
        c_src.<span style="color: #8ac6f2; font-weight: bold;">TABLE_NAME</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> SRC_TABLE,
        c_src.<span style="color: #8ac6f2; font-weight: bold;">COLUMN_NAME</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> SRC_COLUMN,
        c_dest.<span style="color: #8ac6f2; font-weight: bold;">TABLE_NAME</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> DEST_TABLE, <span style="color: #99968b; font-style: italic;">-- primary key table</span>
        c_dest.<span style="color: #8ac6f2; font-weight: bold;">COLUMN_NAME</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> DEST_COLUMN
<span style="color: #8ac6f2; font-weight: bold;">FROM</span> ALL_CONSTRAINTS c_list,
     ALL_CONS_COLUMNS c_src,
     ALL_CONS_COLUMNS c_dest
<span style="color: #8ac6f2; font-weight: bold;">WHERE</span> c_list.<span style="color: #8ac6f2; font-weight: bold;">CONSTRAINT_NAME</span> = c_src.<span style="color: #8ac6f2; font-weight: bold;">CONSTRAINT_NAME</span>
  <span style="color: #8ac6f2; font-weight: bold;">AND</span> c_list.R_CONSTRAINT_NAME = c_dest.<span style="color: #8ac6f2; font-weight: bold;">CONSTRAINT_NAME</span>
  <span style="color: #8ac6f2; font-weight: bold;">AND</span> c_list.CONSTRAINT_TYPE = <span style="color: #95e454;">'R'</span>
  <span style="color: #8ac6f2; font-weight: bold;">AND</span> c_src.<span style="color: #8ac6f2; font-weight: bold;">TABLE_NAME</span> = <span style="color: #95e454;">'Z#NU_AT_DEP_PRC'</span> <span style="color: #99968b; font-style: italic;">-- table with foreign keys</span>
<span style="color: #8ac6f2; font-weight: bold;">GROUP</span> <span style="color: #8ac6f2; font-weight: bold;">BY</span> c_list.<span style="color: #8ac6f2; font-weight: bold;">CONSTRAINT_NAME</span>,
          c_src.<span style="color: #8ac6f2; font-weight: bold;">TABLE_NAME</span>,
         c_src.<span style="color: #8ac6f2; font-weight: bold;">COLUMN_NAME</span>,
         c_dest.<span style="color: #8ac6f2; font-weight: bold;">TABLE_NAME</span>,
         c_dest.<span style="color: #8ac6f2; font-weight: bold;">COLUMN_NAME</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc29ab6" class="outline-3">
<h3 id="orgfc29ab6"><span class="section-number-3">20.5</span> Memory Architecture</h3>
<div class="outline-text-3" id="text-20-5">
<ul class="org-ul">
<li><a href="https://docs.oracle.com/database/121/CNCPT/memory.htm">https://docs.oracle.com/database/121/CNCPT/memory.htm</a></li>
<li></li>

<li>System global area (SGA) - for one Oracle Database instance - All server and background processes share the
SGA
<ul class="org-ul">
<li>Database Buffer Cache</li>
<li>In-Memory Column Store</li>
<li>Redo Log Buffer</li>
<li>Shared Pool</li>
<li>Large Pool</li>
<li>Java Pool</li>
<li>Streams Pool</li>
<li>Fixed SGA</li>
</ul></li>
<li>Program global area (PGA) - exists for each server process and background process. The collection of
individual PGAs is the total instance PGA, or instance PGA.
<ul class="org-ul">
<li>пространство стека - это память, хранящая переменные сеансов, массивы сеансов и т.д.</li>
<li>информация сеанса - если Oracle работает не в мультинитевом режиме, то информация сеанса хранится в PGA. В
противном случае, информация сеанса хранится в SGA.</li>
<li>приватная SQL-область - это часть PGA, где хранятся связанные переменные и буферы реального времени</li>
</ul></li>
<li>User global area (UGA) - user session</li>
<li>Software code areas - areas are portions of memory used to store code that is being run or can be run</li>
</ul>

<p>
Процессы:
</p>
<ul class="org-ul">
<li>пользовательские процессы - управляет вводом и взаимодействует с серверными процессами</li>
<li>процессы Oracle
<ul class="org-ul">
<li>серверные процессы (выполняющие функции для активных процессов)</li>
<li>фоновые процессы (выполняют функции СУРБД в целом).</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4534f18" class="outline-3">
<h3 id="org4534f18"><span class="section-number-3">20.6</span> cx<sub>Oracle</sub> python</h3>
<div class="outline-text-3" id="text-20-6">
<p>
<a href="https://www.oracle.com/technetwork/articles/dsl/prez-python-queries-101587.html">https://www.oracle.com/technetwork/articles/dsl/prez-python-queries-101587.html</a>
</p>

<p>
<b>INSTALL</b>
</p>
<ul class="org-ul">
<li>bashrc:
<ul class="org-ul">
<li>export LD<sub>LIBRARY</sub><sub>PATH</sub>=/opt/oracle/instantclient<sub>19</sub><sub>3</sub>:$LD<sub>LIBRARY</sub><sub>PATH</sub></li>
<li>export PATH=/opt/oracle/instantclient<sub>19</sub><sub>3</sub>:$PATH</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org997943d" class="outline-3">
<h3 id="org997943d"><span class="section-number-3">20.7</span> characters</h3>
<div class="outline-text-3" id="text-20-7">
<ul class="org-ul">
<li>если создать таблицу с именами полей в кавычках, то к ним можно обращаться только в кавычках</li>
<li>By default, Oracle identifiers (table names, column names, etc.) are case- insensitive.</li>
<li>You can make them case-sensitive by using quotes around them (eg: SELECT * FROM "My<sub>Table</sub>" WHERE
"my<sub>field</sub>" = 1 )</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org42605db" class="outline-2">
<h2 id="org42605db"><span class="section-number-2">21</span> ETL vs. ELT</h2>
<div class="outline-text-2" id="text-21">
<ul class="org-ul">
<li>ETL (Extract, Transform, Load) - Extract -&gt; Staging<sub>Area</sub> -&gt; T&amp;L</li>
<li>ELT (Extract, Load, Transform) - Extract&amp;Load -&gt; Hadoop -&gt; Transform -&gt; PureData System for analysisn and analisys</li>
</ul>
</div>
</div>
<div id="outline-container-org9830f38" class="outline-2">
<h2 id="org9830f38"><span class="section-number-2">22</span> ETL Extract, Transform, Load- traditional ETL paradigm - batch-driven</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li>new ETL paradigm - Kafka - Change Data Capture(CDC) - stream - event-driven</li>
</ul>
</div>

<div id="outline-container-org8b124c1" class="outline-3">
<h3 id="org8b124c1"><span class="section-number-3">22.1</span> targets</h3>
<div class="outline-text-3" id="text-22-1">
<ul class="org-ul">
<li>Привести все данные к единой системе значений и детализации, попутно обеспечив их качество и
надежность;</li>
<li>после преобразования можно было понять, из каких именно исходных данных и сумм собралась каждая
строчка преобразованных данных.</li>
</ul>
</div>
</div>
