BI.md


<a id="org5f710e2"></a>

## SQL useful

-   <http://sql.fliplinux.com/oracle-5.html>
-   <https://en.wikipedia.org/wiki/Oracle_metadata>
-   dependencies - select \* from dba<sub>dependencies</sub> where referenced<sub>type</sub>='TABLE' and referenced<sub>name</sub>='Z#POOLING';
-   constrains - SELECT table<sub>name</sub>, constraint<sub>name</sub>, constraint<sub>type</sub> FROM user<sub>constraints</sub>;
-   поля таблицы - DESC tbname;

    -- All foregn keys:
    SELECT
    	c_list.CONSTRAINT_NAME as NAME,
    	c_src.TABLE_NAME as SRC_TABLE,
    	c_src.COLUMN_NAME as SRC_COLUMN,
    	c_dest.TABLE_NAME as DEST_TABLE, -- primary key table
    	c_dest.COLUMN_NAME as DEST_COLUMN
    FROM ALL_CONSTRAINTS c_list,
         ALL_CONS_COLUMNS c_src,
         ALL_CONS_COLUMNS c_dest
    WHERE c_list.CONSTRAINT_NAME = c_src.CONSTRAINT_NAME
      AND c_list.R_CONSTRAINT_NAME = c_dest.CONSTRAINT_NAME
      AND c_list.CONSTRAINT_TYPE = 'R'
      AND c_src.TABLE_NAME = 'Z#NU_AT_DEP_PRC' -- table with foreign keys
    GROUP BY c_list.CONSTRAINT_NAME,
    	  c_src.TABLE_NAME,
             c_src.COLUMN_NAME,
             c_dest.TABLE_NAME,
             c_dest.COLUMN_NAME;


<a id="org11a59e5"></a>

## Memory Architecture

-   <https://docs.oracle.com/database/121/CNCPT/memory.htm>
-

-   System global area (SGA) - for one Oracle Database instance - All server and background processes share the
    SGA
    -   Database Buffer Cache
    -   In-Memory Column Store
    -   Redo Log Buffer
    -   Shared Pool
    -   Large Pool
    -   Java Pool
    -   Streams Pool
    -   Fixed SGA
-   Program global area (PGA) - exists for each server process and background process. The collection of
    individual PGAs is the total instance PGA, or instance PGA.
    -   пространство стека - это память, хранящая переменные сеансов, массивы сеансов и т.д.
    -   информация сеанса - если Oracle работает не в мультинитевом режиме, то информация сеанса хранится в PGA. В
        противном случае, информация сеанса хранится в SGA.
    -   приватная SQL-область - это часть PGA, где хранятся связанные переменные и буферы реального времени
-   User global area (UGA) - user session
-   Software code areas - areas are portions of memory used to store code that is being run or can be run

Процессы:

-   пользовательские процессы - управляет вводом и взаимодействует с серверными процессами
-   процессы Oracle
    -   серверные процессы (выполняющие функции для активных процессов)
    -   фоновые процессы (выполняют функции СУРБД в целом).


<a id="org5d86b17"></a>

## cx<sub>Oracle</sub> python

<https://www.oracle.com/technetwork/articles/dsl/prez-python-queries-101587.html>

**INSTALL**

-   bashrc:
    -   export LD<sub>LIBRARY</sub><sub>PATH</sub>=/opt/oracle/instantclient<sub>19</sub><sub>3</sub>:$LD<sub>LIBRARY</sub><sub>PATH</sub>
    -   export PATH=/opt/oracle/instantclient<sub>19</sub><sub>3</sub>:$PATH


<a id="orge4e4168"></a>

## characters

-   если создать таблицу с именами полей в кавычках, то к ним можно обращаться только в кавычках
-   By default, Oracle identifiers (table names, column names, etc.) are case- insensitive.
-   You can make them case-sensitive by using quotes around them (eg: SELECT \* FROM "My<sub>Table</sub>" WHERE
    "my<sub>field</sub>" = 1 )


<a id="org7b12ead"></a>

# ETL vs. ELT

-   ETL (Extract, Transform, Load) - Extract -> Staging<sub>Area</sub> -> T&L
-   ELT (Extract, Load, Transform) - Extract&Load -> Hadoop -> Transform -> PureData System for analysisn and analisys


<a id="orgebd169b"></a>

# ETL Extract, Transform, Load- traditional ETL paradigm - batch-driven

-   new ETL paradigm - Kafka - Change Data Capture(CDC) - stream - event-driven


<a id="orgafc17cd"></a>

## targets

-   Привести все данные к единой системе значений и детализации, попутно обеспечив их качество и
    надежность;
-   после преобразования можно было понять, из каких именно исходных данных и сумм собралась каждая
    строчка преобразованных данных.
