BI.org
** process
- загрузка
- очистка от ошибок - проверяются на корректность и полноту, составляется отчет об ошибках для
  исправления; -> валидационная таблица
- мэппинг со справочниками целевой системы
- консолидация от транзакций до агрегатов - Процесс агрегации данных -
- drill-down из целевой системы


** Full and Incremental Loading
incrementa:
- streaming incremental load
- batch incremental load
** CDC
- Triggers attached to tables -  significant performance impact
- logical Replication - feature of RDBMS
** Spring Cloud Data Flow
for building real-time data pipelines and batch processes
** Talend Open Studio
 limits: https://www.talend.com/products/application-integration/application-integration-compare-all/?_ga=2.8246066.1816291292.1561098962-859926622.1561098962
 - Open Source ETL and Free Data Integration
 cons:
 - windows, mac
** staging tables Промежуточные таблицы
лучше в отдельной базе данных или схеме
** concurrent vs sequential
0) нет ли зависимостей между тасками-сессиями
1) поддерживает ли источник и таргет паралельную загрузку. Concurrent capability
3) restartability - насколько проблематично будет рестартовать, все ли
   таски будут перестартовывать или только та что упала
* Apache Airflow
- https://airflow.readthedocs.io/en/stable/
- https://airflow.apache.org/docs/stable/start.html
- https://github.com/apache/airflow

** terms
- *upstream tasks* t1 >> t2 - t1 upstream for t2
- Dag - graph of tasks-operators - code, define tasks - (no data processing) must executed quickly - seconds
- task - implementation of operator - inherit arguments from dag
  - task_id
  - dag - a reference to the dag the task is attached to (if any)
  - start_date (not required)
- Operator - create object that became node in the dag
- Hooks - keep authentication code and information out of pipelines

** theory
- https://habr.com/ru/company/mailru/blog/339392/
- practice https://github.com/DerekWaiFuChung/DerekWiki/wiki/airflow
- pro https://medium.com/datareply/airflow-lesser-known-tips-tricks-and-best-practises-cf4d4a90f8f
cons:
- is not a data streaming solution. Tasks do not move data from one to the other (though tasks can exchange
  metadata!)
- Workflows are expected to be mostly static or slowly changing

Проблемы:
- limited memory for load of task - чаще, динамический DAG(не ясно), резервированные таски, staging
- сохранять данные которые свалили таску - logging

1) find out Hooks to store connection information
2) look at hooks and install required libraries
3) just write ETL code (separate connections-conn!)
4) create operator with test
5) write DAG

quick:
- pip install 'apache-airflow[mysql]' --user
- add export PATH=$PATH:~/.local/bin
- airflow initdb
- airflow webserver -p 8080
- airflow scheduler ???????

25 дней назад
- Возобновление дага после завершения по dag_timeout возможно, а после принудительной остановки - нет
- чтобы возобновить даг с нужной таски нужнос сначала выставить его статус - Success
- у тасок завершившихся по таймауту дага нет никаких отличий - нужно проверить лог каждой таски
** variables
https://airflow.apache.org/docs/apache-airflow/stable/howto/variable.html
https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#concepts-variables

from airflow.models import Variable
foo = Variable.get("foo")

** Hooks
https://pacuna.io/data-engineering/etl/2018/07/29/etl-postgres-to-postgres.html
- PostgresqlHook <- DbApiHook <- BaseHook
- airflow.hooks.postgres_hook.PostgresHook https://airflow.apache.org/_api/airflow/hooks/postgres_hook/index.html
- airflow/hooks/dbapi_hook.py https://github.com/apache/airflow/blob/master/airflow/hooks/dbapi_hook.py
- airflow/hooks/base_hook.py https://github.com/apache/airflow/blob/master/airflow/hooks/base_hook.py

