BI.html

<div id="outline-container-org0be2666" class="outline-3">
<h3 id="org0be2666"><span class="section-number-3">22.2</span> process</h3>
<div class="outline-text-3" id="text-22-2">
<ul class="org-ul">
<li>загрузка</li>
<li>очистка от ошибок - проверяются на корректность и полноту, составляется отчет об ошибках для
исправления; -&gt; валидационная таблица</li>
<li>мэппинг со справочниками целевой системы</li>
<li>консолидация от транзакций до агрегатов - Процесс агрегации данных -</li>
<li>drill-down из целевой системы</li>
</ul>
</div>
</div>


<div id="outline-container-org4a3b049" class="outline-3">
<h3 id="org4a3b049"><span class="section-number-3">22.3</span> Full and Incremental Loading</h3>
<div class="outline-text-3" id="text-22-3">
<p>
incrementa:
</p>
<ul class="org-ul">
<li>streaming incremental load</li>
<li>batch incremental load</li>
</ul>
</div>
</div>
<div id="outline-container-org36b0d6b" class="outline-3">
<h3 id="org36b0d6b"><span class="section-number-3">22.4</span> CDC</h3>
<div class="outline-text-3" id="text-22-4">
<ul class="org-ul">
<li>Triggers attached to tables -  significant performance impact</li>
<li>logical Replication - feature of RDBMS</li>
</ul>
</div>
</div>
<div id="outline-container-orgebf7b98" class="outline-3">
<h3 id="orgebf7b98"><span class="section-number-3">22.5</span> Spring Cloud Data Flow</h3>
<div class="outline-text-3" id="text-22-5">
<p>
for building real-time data pipelines and batch processes
</p>
</div>
</div>
<div id="outline-container-orgf4280f9" class="outline-3">
<h3 id="orgf4280f9"><span class="section-number-3">22.6</span> Talend Open Studio</h3>
<div class="outline-text-3" id="text-22-6">
<p>
limits: <a href="https://www.talend.com/products/application-integration/application-integration-compare-all/?_ga=2.8246066.1816291292.1561098962-859926622.1561098962">https://www.talend.com/products/application-integration/application-integration-compare-all/?_ga=2.8246066.1816291292.1561098962-859926622.1561098962</a>
</p>
<ul class="org-ul">
<li>Open Source ETL and Free Data Integration</li>
</ul>
<p>
cons:
</p>
<ul class="org-ul">
<li>windows, mac</li>
</ul>
</div>
</div>
<div id="outline-container-org4252565" class="outline-3">
<h3 id="org4252565"><span class="section-number-3">22.7</span> staging tables Промежуточные таблицы</h3>
<div class="outline-text-3" id="text-22-7">
<p>
лучше в отдельной базе данных или схеме
</p>
</div>
</div>
<div id="outline-container-org78a454d" class="outline-3">
<h3 id="org78a454d"><span class="section-number-3">22.8</span> concurrent vs sequential</h3>
<div class="outline-text-3" id="text-22-8">
<ol class="org-ol">
<li>нет ли зависимостей между тасками-сессиями</li>
<li>поддерживает ли источник и таргет паралельную загрузку. Concurrent capability</li>
<li>restartability - насколько проблематично будет рестартовать, все ли
таски будут перестартовывать или только та что упала</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org6433252" class="outline-2">
<h2 id="org6433252"><span class="section-number-2">23</span> Apache Airflow</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li><a href="https://airflow.readthedocs.io/en/stable/">https://airflow.readthedocs.io/en/stable/</a></li>
<li><a href="https://airflow.apache.org/docs/stable/start.html">https://airflow.apache.org/docs/stable/start.html</a></li>
<li><a href="https://github.com/apache/airflow">https://github.com/apache/airflow</a></li>
</ul>
</div>

<div id="outline-container-orgddaf049" class="outline-3">
<h3 id="orgddaf049"><span class="section-number-3">23.1</span> terms</h3>
<div class="outline-text-3" id="text-23-1">
<ul class="org-ul">
<li><b>upstream tasks</b> t1 &gt;&gt; t2 - t1 upstream for t2</li>
<li>Dag - graph of tasks-operators - code, define tasks - (no data processing) must executed quickly - seconds</li>
<li>task - implementation of operator - inherit arguments from dag
<ul class="org-ul">
<li>task<sub>id</sub></li>
<li>dag - a reference to the dag the task is attached to (if any)</li>
<li>start<sub>date</sub> (not required)</li>
</ul></li>
<li>Operator - create object that became node in the dag</li>
<li>Hooks - keep authentication code and information out of pipelines</li>
</ul>
</div>
</div>

<div id="outline-container-orga8d3732" class="outline-3">
<h3 id="orga8d3732"><span class="section-number-3">23.2</span> theory</h3>
<div class="outline-text-3" id="text-23-2">
<ul class="org-ul">
<li><a href="https://habr.com/ru/company/mailru/blog/339392/">https://habr.com/ru/company/mailru/blog/339392/</a></li>
<li>practice <a href="https://github.com/DerekWaiFuChung/DerekWiki/wiki/airflow">https://github.com/DerekWaiFuChung/DerekWiki/wiki/airflow</a></li>
<li>pro <a href="https://medium.com/datareply/airflow-lesser-known-tips-tricks-and-best-practises-cf4d4a90f8f">https://medium.com/datareply/airflow-lesser-known-tips-tricks-and-best-practises-cf4d4a90f8f</a></li>
</ul>
<p>
cons:
</p>
<ul class="org-ul">
<li>is not a data streaming solution. Tasks do not move data from one to the other (though tasks can exchange
metadata!)</li>
<li>Workflows are expected to be mostly static or slowly changing</li>
</ul>

<p>
Проблемы:
</p>
<ul class="org-ul">
<li>limited memory for load of task - чаще, динамический DAG(не ясно), резервированные таски, staging</li>
<li>сохранять данные которые свалили таску - logging</li>

<li>find out Hooks to store connection information</li>
<li>look at hooks and install required libraries</li>
<li>just write ETL code (separate connections-conn!)</li>
<li>create operator with test</li>
<li>write DAG</li>
</ul>

<p>
quick:
</p>
<ul class="org-ul">
<li>pip install 'apache-airflow[mysql]' &#x2013;user</li>
<li>add export PATH=$PATH:~/.local/bin</li>
<li>airflow initdb</li>
<li>airflow webserver -p 8080</li>
<li>airflow scheduler ???????</li>
</ul>

<p>
25 дней назад
</p>
<ul class="org-ul">
<li>Возобновление дага после завершения по dag<sub>timeout</sub> возможно, а после принудительной остановки - нет</li>
<li>чтобы возобновить даг с нужной таски нужнос сначала выставить его статус - Success</li>
<li>у тасок завершившихся по таймауту дага нет никаких отличий - нужно проверить лог каждой таски</li>
</ul>
</div>
</div>
<div id="outline-container-org2b0106c" class="outline-3">
<h3 id="org2b0106c"><span class="section-number-3">23.3</span> variables</h3>
<div class="outline-text-3" id="text-23-3">
<p>
<a href="https://airflow.apache.org/docs/apache-airflow/stable/howto/variable.html">https://airflow.apache.org/docs/apache-airflow/stable/howto/variable.html</a>
<a href="https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#concepts-variables">https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#concepts-variables</a>
</p>

<p>
from airflow.models import Variable
foo = Variable.get("foo")
</p>
</div>
</div>

<div id="outline-container-orge4a8e2b" class="outline-3">
<h3 id="orge4a8e2b"><span class="section-number-3">23.4</span> Hooks</h3>
<div class="outline-text-3" id="text-23-4">
<p>
<a href="https://pacuna.io/data-engineering/etl/2018/07/29/etl-postgres-to-postgres.html">https://pacuna.io/data-engineering/etl/2018/07/29/etl-postgres-to-postgres.html</a>
</p>
<ul class="org-ul">
<li>PostgresqlHook &lt;- DbApiHook &lt;- BaseHook</li>
<li>airflow.hooks.postgres<sub>hook.PostgresHook</sub> <a href="https://airflow.apache.org/_api/airflow/hooks/postgres_hook/index.html">https://airflow.apache.org/_api/airflow/hooks/postgres_hook/index.html</a></li>
<li>airflow/hooks/dbapi<sub>hook.py</sub> <a href="https://github.com/apache/airflow/blob/master/airflow/hooks/dbapi_hook.py">https://github.com/apache/airflow/blob/master/airflow/hooks/dbapi_hook.py</a></li>
<li>airflow/hooks/base<sub>hook.py</sub> <a href="https://github.com/apache/airflow/blob/master/airflow/hooks/base_hook.py">https://github.com/apache/airflow/blob/master/airflow/hooks/base_hook.py</a></li>
</ul>
</div>
</div>
