BI.md


<a id="org716de02"></a>

## process

-   загрузка
-   очистка от ошибок - проверяются на корректность и полноту, составляется отчет об ошибках для
    исправления; -> валидационная таблица
-   мэппинг со справочниками целевой системы
-   консолидация от транзакций до агрегатов - Процесс агрегации данных -
-   drill-down из целевой системы


<a id="orgab2718b"></a>

## Full and Incremental Loading

incrementa:

-   streaming incremental load
-   batch incremental load


<a id="orgdeefc99"></a>

## CDC

-   Triggers attached to tables -  significant performance impact
-   logical Replication - feature of RDBMS


<a id="orgaf12cd3"></a>

## Spring Cloud Data Flow

for building real-time data pipelines and batch processes


<a id="orgd3c32c5"></a>

## Talend Open Studio

limits: <https://www.talend.com/products/application-integration/application-integration-compare-all/?_ga=2.8246066.1816291292.1561098962-859926622.1561098962>

-   Open Source ETL and Free Data Integration

cons:

-   windows, mac


<a id="orgfa2aebf"></a>

## staging tables Промежуточные таблицы

лучше в отдельной базе данных или схеме


<a id="org0795a19"></a>

## concurrent vs sequential

1.  нет ли зависимостей между тасками-сессиями
2.  поддерживает ли источник и таргет паралельную загрузку. Concurrent capability
3.  restartability - насколько проблематично будет рестартовать, все ли
    таски будут перестартовывать или только та что упала


<a id="orgc9ce189"></a>

# Apache Airflow

-   <https://airflow.readthedocs.io/en/stable/>
-   <https://airflow.apache.org/docs/stable/start.html>
-   <https://github.com/apache/airflow>


<a id="orgdd90be9"></a>

## terms

-   **upstream tasks** t1 >> t2 - t1 upstream for t2
-   Dag - graph of tasks-operators - code, define tasks - (no data processing) must executed quickly - seconds
-   task - implementation of operator - inherit arguments from dag
    -   task<sub>id</sub>
    -   dag - a reference to the dag the task is attached to (if any)
    -   start<sub>date</sub> (not required)
-   Operator - create object that became node in the dag
-   Hooks - keep authentication code and information out of pipelines


<a id="org7d04b11"></a>

## theory

-   <https://habr.com/ru/company/mailru/blog/339392/>
-   practice <https://github.com/DerekWaiFuChung/DerekWiki/wiki/airflow>
-   pro <https://medium.com/datareply/airflow-lesser-known-tips-tricks-and-best-practises-cf4d4a90f8f>

cons:

-   is not a data streaming solution. Tasks do not move data from one to the other (though tasks can exchange
    metadata!)
-   Workflows are expected to be mostly static or slowly changing

Проблемы:

-   limited memory for load of task - чаще, динамический DAG(не ясно), резервированные таски, staging
-   сохранять данные которые свалили таску - logging

-   find out Hooks to store connection information
-   look at hooks and install required libraries
-   just write ETL code (separate connections-conn!)
-   create operator with test
-   write DAG

quick:

-   pip install 'apache-airflow[mysql]' &#x2013;user
-   add export PATH=$PATH:~/.local/bin
-   airflow initdb
-   airflow webserver -p 8080
-   airflow scheduler ???????

25 дней назад

-   Возобновление дага после завершения по dag<sub>timeout</sub> возможно, а после принудительной остановки - нет
-   чтобы возобновить даг с нужной таски нужнос сначала выставить его статус - Success
-   у тасок завершившихся по таймауту дага нет никаких отличий - нужно проверить лог каждой таски


<a id="orgedc4c4e"></a>

## variables

<https://airflow.apache.org/docs/apache-airflow/stable/howto/variable.html>
<https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#concepts-variables>

from airflow.models import Variable
foo = Variable.get("foo")


<a id="org48b9f65"></a>

## Hooks

<https://pacuna.io/data-engineering/etl/2018/07/29/etl-postgres-to-postgres.html>

-   PostgresqlHook <- DbApiHook <- BaseHook
-   airflow.hooks.postgres<sub>hook.PostgresHook</sub> <https://airflow.apache.org/_api/airflow/hooks/postgres_hook/index.html>
-   airflow/hooks/dbapi<sub>hook.py</sub> <https://github.com/apache/airflow/blob/master/airflow/hooks/dbapi_hook.py>
-   airflow/hooks/base<sub>hook.py</sub> <https://github.com/apache/airflow/blob/master/airflow/hooks/base_hook.py>
