BI.org
** components
webserver -
scheduler -
database - may be any

Airflow CLI doesn’t depend on the Webserver or Scheduler, but it depends on the DB backend.
** scheduler
- scheduler runs your job one *schedule_interval* AFTER the start date, at the END of the period
- first run created based on start_date, next on schedule_interval

catchup - запуск дага за интервал, если даг был выключен какое-то время.
- используется для инкрементальной загрузки по датам, например.
- если  "depends_on_past": False, - запуск будет запущен и тут же остановлен
** dag
required
- dag_id


not required:
- start_date - начала отсчета
- schedule_interval - start_date+schedule_interval - первый запуск.  - None - @once - @hourly - @daily -
  @weekly - @monthly - @yearly
- max_active_runs
- end_date - прекратить запуски
- default_args: dict - used as constructor keyword parameters when
  initialising operators.
- params (dict) – a dictionary of DAG level parameters that are made accessible in templates,
  namespaced under params. These params can be overridden at the task level.

- concurrency (int) – the number of task instances allowed to run concurrently
- max_active_runs (int) – maximum number of active DAG runs

task dependency
op1 >> [op2,op3] >> op4

1 определить связи - выдилить блоки которые имеют одну зависимость и блоки которые имеют несколько зависимостей
2 построить без отношения многие ко многим
3 реализовать отношение многие ко многим путем повторения связей
*** create dag:
 - mdir ~/airflow/dags
 - touch /airflow/dags/hello.py
 - pkill -F ~/airflow/airflow-webserver.pid ; rm ~/airflow/airflow-webserver.pid
 - airflow initdb
 - airflow webserver -p 8080
 - airflow scheduler
** Operator
- BaseOperator https://github.com/apache/airflow/blob/master/airflow/models/baseoperator.py
- Custom operator https://airflow.apache.org/docs/stable/howto/custom-operator.html
Operators:
- BashOperator - bash command
- PythonOperator - PythonOperator
- EmailOperator
- SimpleHttpOperator - HTTP request
- MySqlOperator, PostgresOperator, JdbcOperator - wrappers for hooks

*** Pipeline difinition:
t1>>[t2,t3]
- t2 is downstream of t1


- depends_on_past = False - a task should not be triggered unless the previous instance of a task completed successfully
- wait_for_downstream = False - wait for preview instance this instance downstream instance! Becouse
  downstrem one may change same data of our task.

*** OracleOperator
https://stackoverflow.com/questions/59785674/airflow-oracle-operator
https://airflow.apache.org/docs/stable/_modules/airflow/operators/oracle_operator.html
*** PythonOperator
 #+BEGIN_SRC python
 def my_sleeping_function(random_base):
     """This is a function that will run within the DAG execution"""
     time.sleep(random_base)

 task = PythonOperator(
         task_id='sleep_for_' + str(i),
         python_callable=my_sleeping_function,
         op_kwargs={'random_base': float(i) / 10},
         dag=dag,
     )
 #+END_SRC

