BI.html

<div id="outline-container-org44a4ccf" class="outline-3">
<h3 id="org44a4ccf"><span class="section-number-3">23.5</span> components</h3>
<div class="outline-text-3" id="text-23-5">
<p>
webserver -
scheduler -
database - may be any
</p>

<p>
Airflow CLI doesn’t depend on the Webserver or Scheduler, but it depends on the DB backend.
</p>
</div>
</div>
<div id="outline-container-org26ab834" class="outline-3">
<h3 id="org26ab834"><span class="section-number-3">23.6</span> scheduler</h3>
<div class="outline-text-3" id="text-23-6">
<ul class="org-ul">
<li>scheduler runs your job one <b>schedule<sub>interval</sub></b> AFTER the start date, at the END of the period</li>
<li>first run created based on start<sub>date</sub>, next on schedule<sub>interval</sub></li>
</ul>

<p>
catchup - запуск дага за интервал, если даг был выключен какое-то время.
</p>
<ul class="org-ul">
<li>используется для инкрементальной загрузки по датам, например.</li>
<li>если  "depends<sub>on</sub><sub>past</sub>": False, - запуск будет запущен и тут же остановлен</li>
</ul>
</div>
</div>
<div id="outline-container-orgc57f0f1" class="outline-3">
<h3 id="orgc57f0f1"><span class="section-number-3">23.7</span> dag</h3>
<div class="outline-text-3" id="text-23-7">
<p>
required
</p>
<ul class="org-ul">
<li>dag<sub>id</sub></li>
</ul>


<p>
not required:
</p>
<ul class="org-ul">
<li>start<sub>date</sub> - начала отсчета</li>
<li>schedule<sub>interval</sub> - start<sub>date</sub>+schedule<sub>interval</sub> - первый запуск.  - None - @once - @hourly - @daily -
@weekly - @monthly - @yearly</li>
<li>max<sub>active</sub><sub>runs</sub></li>
<li>end<sub>date</sub> - прекратить запуски</li>
<li>default<sub>args</sub>: dict - used as constructor keyword parameters when
initialising operators.</li>
<li>params (dict) – a dictionary of DAG level parameters that are made accessible in templates,
namespaced under params. These params can be overridden at the task level.</li>

<li>concurrency (int) – the number of task instances allowed to run concurrently</li>
<li>max<sub>active</sub><sub>runs</sub> (int) – maximum number of active DAG runs</li>
</ul>

<p>
task dependency
op1 &gt;&gt; [op2,op3] &gt;&gt; op4
</p>

<p>
1 определить связи - выдилить блоки которые имеют одну зависимость и блоки которые имеют несколько зависимостей
2 построить без отношения многие ко многим
3 реализовать отношение многие ко многим путем повторения связей
</p>
</div>
<div id="outline-container-org8d93057" class="outline-4">
<h4 id="org8d93057"><span class="section-number-4">23.7.1</span> create dag:</h4>
<div class="outline-text-4" id="text-23-7-1">
<ul class="org-ul">
<li>mdir ~/airflow/dags</li>
<li>touch /airflow/dags/hello.py</li>
<li>pkill -F ~/airflow/airflow-webserver.pid ; rm ~/airflow/airflow-webserver.pid</li>
<li>airflow initdb</li>
<li>airflow webserver -p 8080</li>
<li>airflow scheduler</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb0c0728" class="outline-3">
<h3 id="orgb0c0728"><span class="section-number-3">23.8</span> Operator</h3>
<div class="outline-text-3" id="text-23-8">
<ul class="org-ul">
<li>BaseOperator <a href="https://github.com/apache/airflow/blob/master/airflow/models/baseoperator.py">https://github.com/apache/airflow/blob/master/airflow/models/baseoperator.py</a></li>
<li>Custom operator <a href="https://airflow.apache.org/docs/stable/howto/custom-operator.html">https://airflow.apache.org/docs/stable/howto/custom-operator.html</a></li>
</ul>
<p>
Operators:
</p>
<ul class="org-ul">
<li>BashOperator - bash command</li>
<li>PythonOperator - PythonOperator</li>
<li>EmailOperator</li>
<li>SimpleHttpOperator - HTTP request</li>
<li>MySqlOperator, PostgresOperator, JdbcOperator - wrappers for hooks</li>
</ul>
</div>

<div id="outline-container-org85ab31c" class="outline-4">
<h4 id="org85ab31c"><span class="section-number-4">23.8.1</span> Pipeline difinition:</h4>
<div class="outline-text-4" id="text-23-8-1">
<p>
t1&gt;&gt;[t2,t3]
</p>
<ul class="org-ul">
<li>t2 is downstream of t1</li>
</ul>


<ul class="org-ul">
<li>depends<sub>on</sub><sub>past</sub> = False - a task should not be triggered unless the previous instance of a task completed successfully</li>
<li>wait<sub>for</sub><sub>downstream</sub> = False - wait for preview instance this instance downstream instance! Becouse
downstrem one may change same data of our task.</li>
</ul>
</div>
</div>

<div id="outline-container-org7896aa4" class="outline-4">
<h4 id="org7896aa4"><span class="section-number-4">23.8.2</span> OracleOperator</h4>
<div class="outline-text-4" id="text-23-8-2">
<p>
<a href="https://stackoverflow.com/questions/59785674/airflow-oracle-operator">https://stackoverflow.com/questions/59785674/airflow-oracle-operator</a>
<a href="https://airflow.apache.org/docs/stable/_modules/airflow/operators/oracle_operator.html">https://airflow.apache.org/docs/stable/_modules/airflow/operators/oracle_operator.html</a>
</p>
</div>
</div>
<div id="outline-container-org9dac353" class="outline-4">
<h4 id="org9dac353"><span class="section-number-4">23.8.3</span> PythonOperator</h4>
<div class="outline-text-4" id="text-23-8-3">
<div class="org-src-container">
<pre class="src src-python"> <span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">my_sleeping_function</span>(random_base):
     <span style="color: #f08080; font-style: italic;">"""This is a function that will run within the DAG execution"""</span>
     time.sleep(random_base)

 <span style="color: #cae682;">task</span> = PythonOperator(
         task_id=<span style="color: #95e454;">'sleep_for_'</span> + <span style="color: #e5786d;">str</span>(i),
         python_callable=my_sleeping_function,
         op_kwargs={<span style="color: #95e454;">'random_base'</span>: <span style="color: #e5786d;">float</span>(i) / 10},
         dag=dag,
     )
</pre>
</div>
</div>
</div>
