BI.md


<a id="orga73526f"></a>

## components

webserver -
scheduler -
database - may be any

Airflow CLI doesn’t depend on the Webserver or Scheduler, but it depends on the DB backend.


<a id="orgf8ec12d"></a>

## scheduler

-   scheduler runs your job one **schedule<sub>interval</sub>** AFTER the start date, at the END of the period
-   first run created based on start<sub>date</sub>, next on schedule<sub>interval</sub>

catchup - запуск дага за интервал, если даг был выключен какое-то время.

-   используется для инкрементальной загрузки по датам, например.
-   если  "depends<sub>on</sub><sub>past</sub>": False, - запуск будет запущен и тут же остановлен


<a id="org7820805"></a>

## dag

required

-   dag<sub>id</sub>

not required:

-   start<sub>date</sub> - начала отсчета
-   schedule<sub>interval</sub> - start<sub>date</sub>+schedule<sub>interval</sub> - первый запуск.  - None - @once - @hourly - @daily -
    @weekly - @monthly - @yearly
-   max<sub>active</sub><sub>runs</sub>
-   end<sub>date</sub> - прекратить запуски
-   default<sub>args</sub>: dict - used as constructor keyword parameters when
    initialising operators.
-   params (dict) – a dictionary of DAG level parameters that are made accessible in templates,
    namespaced under params. These params can be overridden at the task level.

-   concurrency (int) – the number of task instances allowed to run concurrently
-   max<sub>active</sub><sub>runs</sub> (int) – maximum number of active DAG runs

task dependency
op1 >> [op2,op3] >> op4

1 определить связи - выдилить блоки которые имеют одну зависимость и блоки которые имеют несколько зависимостей
2 построить без отношения многие ко многим
3 реализовать отношение многие ко многим путем повторения связей


<a id="org00a201d"></a>

### create dag:

-   mdir ~/airflow/dags
-   touch /airflow/dags/hello.py
-   pkill -F ~/airflow/airflow-webserver.pid ; rm ~/airflow/airflow-webserver.pid
-   airflow initdb
-   airflow webserver -p 8080
-   airflow scheduler


<a id="org540bddc"></a>

## Operator

-   BaseOperator <https://github.com/apache/airflow/blob/master/airflow/models/baseoperator.py>
-   Custom operator <https://airflow.apache.org/docs/stable/howto/custom-operator.html>

Operators:

-   BashOperator - bash command
-   PythonOperator - PythonOperator
-   EmailOperator
-   SimpleHttpOperator - HTTP request
-   MySqlOperator, PostgresOperator, JdbcOperator - wrappers for hooks


<a id="org5444a7e"></a>

### Pipeline difinition:

t1>>[t2,t3]

-   t2 is downstream of t1

-   depends<sub>on</sub><sub>past</sub> = False - a task should not be triggered unless the previous instance of a task completed successfully
-   wait<sub>for</sub><sub>downstream</sub> = False - wait for preview instance this instance downstream instance! Becouse
    downstrem one may change same data of our task.


<a id="org0de1b7d"></a>

### OracleOperator

<https://stackoverflow.com/questions/59785674/airflow-oracle-operator>
<https://airflow.apache.org/docs/stable/_modules/airflow/operators/oracle_operator.html>


<a id="org41b4800"></a>

### PythonOperator

    def my_sleeping_function(random_base):
        """This is a function that will run within the DAG execution"""
        time.sleep(random_base)

    task = PythonOperator(
            task_id='sleep_for_' + str(i),
            python_callable=my_sleeping_function,
            op_kwargs={'random_base': float(i) / 10},
            dag=dag,
        )
