BI.org
*** PythonOperator context
 #+BEGIN_SRC python

 {
             'dag': task.dag,
             'ds': ds,
             'next_ds': next_ds,
             'next_ds_nodash': next_ds_nodash,
             'prev_ds': prev_ds,
             'prev_ds_nodash': prev_ds_nodash,
             'ds_nodash': ds_nodash,
             'ts': ts,
             'ts_nodash': ts_nodash,
             'ts_nodash_with_tz': ts_nodash_with_tz,
             'yesterday_ds': yesterday_ds,
             'yesterday_ds_nodash': yesterday_ds_nodash,
             'tomorrow_ds': tomorrow_ds,
             'tomorrow_ds_nodash': tomorrow_ds_nodash,
             'END_DATE': ds,
             'end_date': ds,
             'dag_run': dag_run,
             'run_id': run_id,
             'execution_date': self.execution_date,
             'prev_execution_date': prev_execution_date,
             'next_execution_date': next_execution_date,
             'latest_date': ds,
             'macros': macros,
             'params': params,
             'tables': tables,
             'task': task,
             'task_instance': self,
             'ti': self,
             'task_instance_key_str': ti_key_str,
             'conf': configuration,
             'test_mode': self.test_mode,
             'var': {
                 'value': VariableAccessor(),
                 'json': VariableJsonAccessor()
             },
             'inlets': task.inlets,
             'outlets': task.outlets,
 }
 #+END_SRC

{'conf': <airflow.configuration.AirflowConfigParser object at 0x7fd577193b20>,
'dag': <DAG: t2>,
'ds': '2021-04-07',
'next_ds':
'2021-04-07',
'next_ds_nodash': '20210407',
'prev_ds': '2021-04-07',
'prev_ds_nodash': '20210407',
'ds_nodash': '20210407',
'ts': '2021-04-07T01:20:00+00:00',
'ts_nodash': '20210407T012000',
'ts_nodash_with_tz': '20210407T012000+0000',
'yesterday_ds': '2021-04-06',
 'yesterday_ds_nodash': '20210406',
'tomorrow_ds': '2021-04-08',
'tomorrow_ds_nodash': '20210408',
'END_DATE': '2021-04-07',
'end_date':
'2021-04-07',
'dag_run': <DagRun t2 @ 2021-04-07 01:20:00+00:00: scheduled__2021-04-07T01:20:00+00:00, externally triggered: False>,

'run_id': 'scheduled__2021-04-07T01:20:00+00:00',
'execution_date': <Pendulum [2021-04-07T01:20:00+00:00]>,
'prev_execution_date': <Pendulum [2021-04-07T01:15:00+00:00]>,
'prev_execution_date_success': <Proxy at 0x7fd5723666c0 with factory <function TaskInstance.get_template_context.<locals>.<lambda> at 0x7fd5723c1f70>>,
 'prev_start_date_success': <Proxy at 0x7fd572368c80 with factory <function TaskInstance.get_template_context.<locals>.<lambda> at 0x7fd5723750d0>>,
 'next_execution_date': <Pendulum [2021-04-07T01:25:00+00:00]>,
'latest_date': '2021-04-07',
'macros': <module 'airflow.macros' from '/home/u2/.local/lib/python3.8/site-packages/airflow/macros/__init__.py'>,
'params': {},
'tables': None,
'task': <Task(BranchPythonOperator): branc_op>,
'task_instance': <TaskInstance: t2.branc_op 2021-04-07T01:20:00+00:00 [running]>,
'ti': <TaskInstance: t2.branc_op 2021-04-07T01:20:00+00:00 [running]>,
'task_instance_key_str': 't2__branc_op__20210407',
'test_mode': False,
'var': {'value': None, 'json': None},
'inlets': [],
'outlets': [],
'templates_dict': None}

** Tasks
https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#trigger-rules

