BI.html

<div id="outline-container-org849e045" class="outline-4">
<h4 id="org849e045"><span class="section-number-4">23.8.4</span> PythonOperator context</h4>
<div class="outline-text-4" id="text-23-8-4">
<div class="org-src-container">
<pre class="src src-python">
 {
             <span style="color: #95e454;">'dag'</span>: task.dag,
             <span style="color: #95e454;">'ds'</span>: ds,
             <span style="color: #95e454;">'next_ds'</span>: next_ds,
             <span style="color: #95e454;">'next_ds_nodash'</span>: next_ds_nodash,
             <span style="color: #95e454;">'prev_ds'</span>: prev_ds,
             <span style="color: #95e454;">'prev_ds_nodash'</span>: prev_ds_nodash,
             <span style="color: #95e454;">'ds_nodash'</span>: ds_nodash,
             <span style="color: #95e454;">'ts'</span>: ts,
             <span style="color: #95e454;">'ts_nodash'</span>: ts_nodash,
             <span style="color: #95e454;">'ts_nodash_with_tz'</span>: ts_nodash_with_tz,
             <span style="color: #95e454;">'yesterday_ds'</span>: yesterday_ds,
             <span style="color: #95e454;">'yesterday_ds_nodash'</span>: yesterday_ds_nodash,
             <span style="color: #95e454;">'tomorrow_ds'</span>: tomorrow_ds,
             <span style="color: #95e454;">'tomorrow_ds_nodash'</span>: tomorrow_ds_nodash,
             <span style="color: #95e454;">'END_DATE'</span>: ds,
             <span style="color: #95e454;">'end_date'</span>: ds,
             <span style="color: #95e454;">'dag_run'</span>: dag_run,
             <span style="color: #95e454;">'run_id'</span>: run_id,
             <span style="color: #95e454;">'execution_date'</span>: <span style="color: #8ac6f2; font-weight: bold;">self</span>.execution_date,
             <span style="color: #95e454;">'prev_execution_date'</span>: prev_execution_date,
             <span style="color: #95e454;">'next_execution_date'</span>: next_execution_date,
             <span style="color: #95e454;">'latest_date'</span>: ds,
             <span style="color: #95e454;">'macros'</span>: macros,
             <span style="color: #95e454;">'params'</span>: params,
             <span style="color: #95e454;">'tables'</span>: tables,
             <span style="color: #95e454;">'task'</span>: task,
             <span style="color: #95e454;">'task_instance'</span>: <span style="color: #8ac6f2; font-weight: bold;">self</span>,
             <span style="color: #95e454;">'ti'</span>: <span style="color: #8ac6f2; font-weight: bold;">self</span>,
             <span style="color: #95e454;">'task_instance_key_str'</span>: ti_key_str,
             <span style="color: #95e454;">'conf'</span>: configuration,
             <span style="color: #95e454;">'test_mode'</span>: <span style="color: #8ac6f2; font-weight: bold;">self</span>.test_mode,
             <span style="color: #95e454;">'var'</span>: {
                 <span style="color: #95e454;">'value'</span>: VariableAccessor(),
                 <span style="color: #95e454;">'json'</span>: VariableJsonAccessor()
             },
             <span style="color: #95e454;">'inlets'</span>: task.inlets,
             <span style="color: #95e454;">'outlets'</span>: task.outlets,
 }
</pre>
</div>

<p>
{'conf': &lt;airflow.configuration.AirflowConfigParser object at 0x7fd577193b20&gt;,
'dag': &lt;DAG: t2&gt;,
'ds': '2021-04-07',
'next<sub>ds</sub>':
'2021-04-07',
'next<sub>ds</sub><sub>nodash</sub>': '20210407',
'prev<sub>ds</sub>': '2021-04-07',
'prev<sub>ds</sub><sub>nodash</sub>': '20210407',
'ds<sub>nodash</sub>': '20210407',
'ts': '2021-04-07T01:20:00+00:00',
'ts<sub>nodash</sub>': '20210407T012000',
'ts<sub>nodash</sub><sub>with</sub><sub>tz</sub>': '20210407T012000+0000',
'yesterday<sub>ds</sub>': '2021-04-06',
 'yesterday<sub>ds</sub><sub>nodash</sub>': '20210406',
'tomorrow<sub>ds</sub>': '2021-04-08',
'tomorrow<sub>ds</sub><sub>nodash</sub>': '20210408',
'END<sub>DATE</sub>': '2021-04-07',
'end<sub>date</sub>':
'2021-04-07',
'dag<sub>run</sub>': &lt;DagRun t2 @ 2021-04-07 01:20:00+00:00: scheduled_<sub>2021</sub>-04-07T01:20:00+00:00, externally triggered: False&gt;,
</p>

<p>
'run<sub>id</sub>': 'scheduled_<sub>2021</sub>-04-07T01:20:00+00:00',
'execution<sub>date</sub>': &lt;Pendulum <span class="timestamp-wrapper"><span class="timestamp">[2021-04-07 Wed]</span></span>&gt;,
'prev<sub>execution</sub><sub>date</sub>': &lt;Pendulum <span class="timestamp-wrapper"><span class="timestamp">[2021-04-07 Wed]</span></span>&gt;,
'prev<sub>execution</sub><sub>date</sub><sub>success</sub>': &lt;Proxy at 0x7fd5723666c0 with factory &lt;function TaskInstance.get<sub>template</sub><sub>context</sub>.&lt;locals&gt;.&lt;lambda&gt; at 0x7fd5723c1f70&gt;&gt;,
 'prev<sub>start</sub><sub>date</sub><sub>success</sub>': &lt;Proxy at 0x7fd572368c80 with factory &lt;function TaskInstance.get<sub>template</sub><sub>context</sub>.&lt;locals&gt;.&lt;lambda&gt; at 0x7fd5723750d0&gt;&gt;,
 'next<sub>execution</sub><sub>date</sub>': &lt;Pendulum <span class="timestamp-wrapper"><span class="timestamp">[2021-04-07 Wed]</span></span>&gt;,
'latest<sub>date</sub>': '2021-04-07',
'macros': &lt;module 'airflow.macros' from '<i>home/u2</i>.local/lib/python3.8/site-packages/airflow/macros/_<sub>init</sub>_<sub>.py</sub>'&gt;,
'params': {},
'tables': None,
'task': &lt;Task(BranchPythonOperator): branc<sub>op</sub>&gt;,
'task<sub>instance</sub>': &lt;TaskInstance: t2.branc<sub>op</sub> 2021-04-07T01:20:00+00:00 [running]&gt;,
'ti': &lt;TaskInstance: t2.branc<sub>op</sub> 2021-04-07T01:20:00+00:00 [running]&gt;,
'task<sub>instance</sub><sub>key</sub><sub>str</sub>': 't2_<sub>branc</sub><sub>op</sub>_<sub>20210407</sub>',
'test<sub>mode</sub>': False,
'var': {'value': None, 'json': None},
'inlets': [],
'outlets': [],
'templates<sub>dict</sub>': None}
</p>
</div>
</div>
</div>

<div id="outline-container-orgb99f808" class="outline-3">
<h3 id="orgb99f808"><span class="section-number-3">23.9</span> Tasks</h3>
<div class="outline-text-3" id="text-23-9">
<p>
<a href="https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#trigger-rules">https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#trigger-rules</a>
</p>
</div>
