BI.md


<a id="orge820a90"></a>

### PythonOperator context


    {
                'dag': task.dag,
                'ds': ds,
                'next_ds': next_ds,
                'next_ds_nodash': next_ds_nodash,
                'prev_ds': prev_ds,
                'prev_ds_nodash': prev_ds_nodash,
                'ds_nodash': ds_nodash,
                'ts': ts,
                'ts_nodash': ts_nodash,
                'ts_nodash_with_tz': ts_nodash_with_tz,
                'yesterday_ds': yesterday_ds,
                'yesterday_ds_nodash': yesterday_ds_nodash,
                'tomorrow_ds': tomorrow_ds,
                'tomorrow_ds_nodash': tomorrow_ds_nodash,
                'END_DATE': ds,
                'end_date': ds,
                'dag_run': dag_run,
                'run_id': run_id,
                'execution_date': self.execution_date,
                'prev_execution_date': prev_execution_date,
                'next_execution_date': next_execution_date,
                'latest_date': ds,
                'macros': macros,
                'params': params,
                'tables': tables,
                'task': task,
                'task_instance': self,
                'ti': self,
                'task_instance_key_str': ti_key_str,
                'conf': configuration,
                'test_mode': self.test_mode,
                'var': {
                    'value': VariableAccessor(),
                    'json': VariableJsonAccessor()
                },
                'inlets': task.inlets,
                'outlets': task.outlets,
    }

{'conf': <airflow.configuration.AirflowConfigParser object at 0x7fd577193b20>,
'dag': <DAG: t2>,
'ds': '2021-04-07',
'next<sub>ds</sub>':
'2021-04-07',
'next<sub>ds</sub><sub>nodash</sub>': '20210407',
'prev<sub>ds</sub>': '2021-04-07',
'prev<sub>ds</sub><sub>nodash</sub>': '20210407',
'ds<sub>nodash</sub>': '20210407',
'ts': '2021-04-07T01:20:00+00:00',
'ts<sub>nodash</sub>': '20210407T012000',
'ts<sub>nodash</sub><sub>with</sub><sub>tz</sub>': '20210407T012000+0000',
'yesterday<sub>ds</sub>': '2021-04-06',
 'yesterday<sub>ds</sub><sub>nodash</sub>': '20210406',
'tomorrow<sub>ds</sub>': '2021-04-08',
'tomorrow<sub>ds</sub><sub>nodash</sub>': '20210408',
'END<sub>DATE</sub>': '2021-04-07',
'end<sub>date</sub>':
'2021-04-07',
'dag<sub>run</sub>': <DagRun t2 @ 2021-04-07 01:20:00+00:00: scheduled\_<sub>2021</sub>-04-07T01:20:00+00:00, externally triggered: False>,

'run<sub>id</sub>': 'scheduled\_<sub>2021</sub>-04-07T01:20:00+00:00',
'execution<sub>date</sub>': <Pendulum <span class="timestamp-wrapper"><span class="timestamp">[2021-04-07 Wed]</span></span>>,
'prev<sub>execution</sub><sub>date</sub>': <Pendulum <span class="timestamp-wrapper"><span class="timestamp">[2021-04-07 Wed]</span></span>>,
'prev<sub>execution</sub><sub>date</sub><sub>success</sub>': <Proxy at 0x7fd5723666c0 with factory <function TaskInstance.get<sub>template</sub><sub>context</sub>.<locals>.<lambda> at 0x7fd5723c1f70>>,
 'prev<sub>start</sub><sub>date</sub><sub>success</sub>': <Proxy at 0x7fd572368c80 with factory <function TaskInstance.get<sub>template</sub><sub>context</sub>.<locals>.<lambda> at 0x7fd5723750d0>>,
 'next<sub>execution</sub><sub>date</sub>': <Pendulum <span class="timestamp-wrapper"><span class="timestamp">[2021-04-07 Wed]</span></span>>,
'latest<sub>date</sub>': '2021-04-07',
'macros': <module 'airflow.macros' from '*home/u2*.local/lib/python3.8/site-packages/airflow/macros/\_<sub>init</sub>\_<sub>.py</sub>'>,
'params': {},
'tables': None,
'task': <Task(BranchPythonOperator): branc<sub>op</sub>>,
'task<sub>instance</sub>': <TaskInstance: t2.branc<sub>op</sub> 2021-04-07T01:20:00+00:00 [running]>,
'ti': <TaskInstance: t2.branc<sub>op</sub> 2021-04-07T01:20:00+00:00 [running]>,
'task<sub>instance</sub><sub>key</sub><sub>str</sub>': 't2\_<sub>branc</sub><sub>op</sub>\_<sub>20210407</sub>',
'test<sub>mode</sub>': False,
'var': {'value': None, 'json': None},
'inlets': [],
'outlets': [],
'templates<sub>dict</sub>': None}


<a id="orge2ad553"></a>

## Tasks

<https://airflow.apache.org/docs/apache-airflow/stable/concepts.html#trigger-rules>
