BI.org
*** trigger_rule
    all_success: (default) all parents have succeeded

    all_failed: all parents are in a failed or upstream_failed state

    all_done: all parents are done with their execution

    one_failed: fires as soon as at least one parent has failed, it does not wait for all parents to be done

    one_success: fires as soon as at least one parent succeeds, it does not wait for all parents to be done

    none_failed: all parents have not failed (failed or upstream_failed) i.e. all parents have succeeded or been skipped

    none_failed_or_skipped: all parents have not failed (failed or upstream_failed) and at least one parent has succeeded.

    none_skipped: no parent is in a skipped state, i.e. all parents are in a success, failed, or upstream_failed state

    dummy: dependencies are just for show, trigger at will
** TaskGroup
from airflow.utils.task_group import TaskGroup

with TaskGroup("group1") as group1:
    task1 = DummyOperator(task_id="task1")
    task2 = DummyOperator(task_id="task2")

# or task1 = DummyOperator(task_id="task1", task_group = group1)
task3 = DummyOperator(task_id="task3")

group1 >> task3

** airflow.cfg
Executors:
- SequentialExecutor
- LocalExecutor - good for single node, use parallelism
- CeleryExecutor - distributed
- KubernetesExecutor - temporary pod for each task to run
** best practives
- example dag https://github.com/apache/airflow/tree/master/airflow/example_dags
- https://gtoonstra.github.io/etl-with-airflow/principles.html
  - https://github.com/gtoonstra/etl-with-airflow/tree/master/examples
- https://github.com/astronomer/airflow-guides/blob/master/guides/dag-best-practices.md

- provide atomicy inside task (Airflow can retry a task if it fails)
- tasks should produce the same outcome on every re-run
  - replace INSERT with UPSER
  - Never read the latest available data in a task. Read and write in a specific partition.
  - datetime.now() - should never be used inside a task

*start_date* parameter in a DAG - reexecution of historical data

*** UPSERT in postgresql
#+BEGIN_SRC sql
INSERT INTO customers (NAME, email)
VALUES('Microsoft','hotline@microsoft.com')
ON CONFLICT ON CONSTRAINT customers_name_key
DO NOTHING;
#+END_SRC
** local server
pip3 install apache-airflow --user
cd ~/airflow
airflow initdb # only first time
airflow scheduler &
airflow webserver -p 8080 &
wait

** Incremental Record Filtering
- break out your pipelines into incremental extracts and loads
  + Last Modified Date - each record in your source system contains a column containing the last time the
    record was modified
  + Sequence IDs - last modified date is not available
    - when the source records are only being appended to and never updated
** deployment
- https://towardsdatascience.com/getting-started-with-airflow-locally-and-remotely-d068df7fcb4
- pycharm + docker https://medium.com/ninjavan-tech/setting-up-a-complete-local-development-environment-for-airflow-docker-pycharm-and-tests-3577ddb4ca94
  - https://github.com/ninja-van/airflow-boilerplate

- https://www.gradiant.org/en/blog/apache-airflow-docker-en/
- https://airflow.apache.org/docs/apache-airflow/2.0.2/start/docker.html
cd /home/airflow && docker-compose down && docker-compose up -d
