BI.html

<div id="outline-container-orga262fc3" class="outline-4">
<h4 id="orga262fc3"><span class="section-number-4">23.9.1</span> trigger<sub>rule</sub></h4>
<div class="outline-text-4" id="text-23-9-1">
<p>
all<sub>success</sub>: (default) all parents have succeeded
</p>

<p>
all<sub>failed</sub>: all parents are in a failed or upstream<sub>failed</sub> state
</p>

<p>
all<sub>done</sub>: all parents are done with their execution
</p>

<p>
one<sub>failed</sub>: fires as soon as at least one parent has failed, it does not wait for all parents to be done
</p>

<p>
one<sub>success</sub>: fires as soon as at least one parent succeeds, it does not wait for all parents to be done
</p>

<p>
none<sub>failed</sub>: all parents have not failed (failed or upstream<sub>failed</sub>) i.e. all parents have succeeded or been skipped
</p>

<p>
none<sub>failed</sub><sub>or</sub><sub>skipped</sub>: all parents have not failed (failed or upstream<sub>failed</sub>) and at least one parent has succeeded.
</p>

<p>
none<sub>skipped</sub>: no parent is in a skipped state, i.e. all parents are in a success, failed, or upstream<sub>failed</sub> state
</p>

<p>
dummy: dependencies are just for show, trigger at will
</p>
</div>
</div>
</div>
<div id="outline-container-org4e5cda9" class="outline-3">
<h3 id="org4e5cda9"><span class="section-number-3">23.10</span> TaskGroup</h3>
<div class="outline-text-3" id="text-23-10">
<p>
from airflow.utils.task<sub>group</sub> import TaskGroup
</p>

<p>
with TaskGroup("group1") as group1:
    task1 = DummyOperator(task<sub>id</sub>="task1")
    task2 = DummyOperator(task<sub>id</sub>="task2")
</p>

<p>
task3 = DummyOperator(task<sub>id</sub>="task3")
</p>

<p>
group1 &gt;&gt; task3
</p>
</div>
</div>

<div id="outline-container-org5d83c7f" class="outline-3">
<h3 id="org5d83c7f"><span class="section-number-3">23.11</span> airflow.cfg</h3>
<div class="outline-text-3" id="text-23-11">
<p>
Executors:
</p>
<ul class="org-ul">
<li>SequentialExecutor</li>
<li>LocalExecutor - good for single node, use parallelism</li>
<li>CeleryExecutor - distributed</li>
<li>KubernetesExecutor - temporary pod for each task to run</li>
</ul>
</div>
</div>
<div id="outline-container-org5a9ece5" class="outline-3">
<h3 id="org5a9ece5"><span class="section-number-3">23.12</span> best practives</h3>
<div class="outline-text-3" id="text-23-12">
<ul class="org-ul">
<li>example dag <a href="https://github.com/apache/airflow/tree/master/airflow/example_dags">https://github.com/apache/airflow/tree/master/airflow/example_dags</a></li>
<li><a href="https://gtoonstra.github.io/etl-with-airflow/principles.html">https://gtoonstra.github.io/etl-with-airflow/principles.html</a>
<ul class="org-ul">
<li><a href="https://github.com/gtoonstra/etl-with-airflow/tree/master/examples">https://github.com/gtoonstra/etl-with-airflow/tree/master/examples</a></li>
</ul></li>
<li><a href="https://github.com/astronomer/airflow-guides/blob/master/guides/dag-best-practices.md">https://github.com/astronomer/airflow-guides/blob/master/guides/dag-best-practices.md</a></li>

<li>provide atomicy inside task (Airflow can retry a task if it fails)</li>
<li>tasks should produce the same outcome on every re-run
<ul class="org-ul">
<li>replace INSERT with UPSER</li>
<li>Never read the latest available data in a task. Read and write in a specific partition.</li>
<li>datetime.now() - should never be used inside a task</li>
</ul></li>
</ul>

<p>
<b>start<sub>date</sub></b> parameter in a DAG - reexecution of historical data
</p>
</div>

<div id="outline-container-org02ac20b" class="outline-4">
<h4 id="org02ac20b"><span class="section-number-4">23.12.1</span> UPSERT in postgresql</h4>
<div class="outline-text-4" id="text-23-12-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #8ac6f2; font-weight: bold;">INSERT</span> <span style="color: #8ac6f2; font-weight: bold;">INTO</span> customers (<span style="color: #8ac6f2; font-weight: bold;">NAME</span>, email)
<span style="color: #8ac6f2; font-weight: bold;">VALUES</span>(<span style="color: #95e454;">'Microsoft'</span>,<span style="color: #95e454;">'hotline@microsoft.com'</span>)
<span style="color: #8ac6f2; font-weight: bold;">ON</span> CONFLICT <span style="color: #8ac6f2; font-weight: bold;">ON</span> <span style="color: #8ac6f2; font-weight: bold;">CONSTRAINT</span> customers_name_key
DO NOTHING;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga0ab119" class="outline-3">
<h3 id="orga0ab119"><span class="section-number-3">23.13</span> local server</h3>
<div class="outline-text-3" id="text-23-13">
<p>
pip3 install apache-airflow &#x2013;user
cd ~/airflow
airflow initdb # only first time
airflow scheduler &amp;
airflow webserver -p 8080 &amp;
wait
</p>
</div>
</div>

<div id="outline-container-orgf9a8936" class="outline-3">
<h3 id="orgf9a8936"><span class="section-number-3">23.14</span> Incremental Record Filtering</h3>
<div class="outline-text-3" id="text-23-14">
<ul class="org-ul">
<li>break out your pipelines into incremental extracts and loads
<ul class="org-ul">
<li>Last Modified Date - each record in your source system contains a column containing the last time the
record was modified</li>
<li>Sequence IDs - last modified date is not available
<ul class="org-ul">
<li>when the source records are only being appended to and never updated</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb737ef3" class="outline-3">
<h3 id="orgb737ef3"><span class="section-number-3">23.15</span> deployment</h3>
<div class="outline-text-3" id="text-23-15">
<ul class="org-ul">
<li><a href="https://towardsdatascience.com/getting-started-with-airflow-locally-and-remotely-d068df7fcb4">https://towardsdatascience.com/getting-started-with-airflow-locally-and-remotely-d068df7fcb4</a></li>
<li>pycharm + docker <a href="https://medium.com/ninjavan-tech/setting-up-a-complete-local-development-environment-for-airflow-docker-pycharm-and-tests-3577ddb4ca94">https://medium.com/ninjavan-tech/setting-up-a-complete-local-development-environment-for-airflow-docker-pycharm-and-tests-3577ddb4ca94</a>
<ul class="org-ul">
<li><a href="https://github.com/ninja-van/airflow-boilerplate">https://github.com/ninja-van/airflow-boilerplate</a></li>
</ul></li>

<li><a href="https://www.gradiant.org/en/blog/apache-airflow-docker-en/">https://www.gradiant.org/en/blog/apache-airflow-docker-en/</a></li>
<li><a href="https://airflow.apache.org/docs/apache-airflow/2.0.2/start/docker.html">https://airflow.apache.org/docs/apache-airflow/2.0.2/start/docker.html</a></li>
</ul>
<p>
cd /home/airflow &amp;&amp; docker-compose down &amp;&amp; docker-compose up -d
</p>
</div>
