BI.md


<a id="org7a7370b"></a>

### trigger<sub>rule</sub>

all<sub>success</sub>: (default) all parents have succeeded

all<sub>failed</sub>: all parents are in a failed or upstream<sub>failed</sub> state

all<sub>done</sub>: all parents are done with their execution

one<sub>failed</sub>: fires as soon as at least one parent has failed, it does not wait for all parents to be done

one<sub>success</sub>: fires as soon as at least one parent succeeds, it does not wait for all parents to be done

none<sub>failed</sub>: all parents have not failed (failed or upstream<sub>failed</sub>) i.e. all parents have succeeded or been skipped

none<sub>failed</sub><sub>or</sub><sub>skipped</sub>: all parents have not failed (failed or upstream<sub>failed</sub>) and at least one parent has succeeded.

none<sub>skipped</sub>: no parent is in a skipped state, i.e. all parents are in a success, failed, or upstream<sub>failed</sub> state

dummy: dependencies are just for show, trigger at will


<a id="org609d09c"></a>

## TaskGroup

from airflow.utils.task<sub>group</sub> import TaskGroup

with TaskGroup("group1") as group1:
    task1 = DummyOperator(task<sub>id</sub>="task1")
    task2 = DummyOperator(task<sub>id</sub>="task2")

task3 = DummyOperator(task<sub>id</sub>="task3")

group1 >> task3


<a id="org3d47edc"></a>

## airflow.cfg

Executors:

-   SequentialExecutor
-   LocalExecutor - good for single node, use parallelism
-   CeleryExecutor - distributed
-   KubernetesExecutor - temporary pod for each task to run


<a id="org27061c3"></a>

## best practives

-   example dag <https://github.com/apache/airflow/tree/master/airflow/example_dags>
-   <https://gtoonstra.github.io/etl-with-airflow/principles.html>
    -   <https://github.com/gtoonstra/etl-with-airflow/tree/master/examples>
-   <https://github.com/astronomer/airflow-guides/blob/master/guides/dag-best-practices.md>

-   provide atomicy inside task (Airflow can retry a task if it fails)
-   tasks should produce the same outcome on every re-run
    -   replace INSERT with UPSER
    -   Never read the latest available data in a task. Read and write in a specific partition.
    -   datetime.now() - should never be used inside a task

**start<sub>date</sub>** parameter in a DAG - reexecution of historical data


<a id="org5c38a2a"></a>

### UPSERT in postgresql

    INSERT INTO customers (NAME, email)
    VALUES('Microsoft','hotline@microsoft.com')
    ON CONFLICT ON CONSTRAINT customers_name_key
    DO NOTHING;


<a id="org7f3e4d8"></a>

## local server

pip3 install apache-airflow &#x2013;user
cd ~/airflow
airflow initdb # only first time
airflow scheduler &
airflow webserver -p 8080 &
wait


<a id="orga93ba57"></a>

## Incremental Record Filtering

-   break out your pipelines into incremental extracts and loads
    -   Last Modified Date - each record in your source system contains a column containing the last time the
        record was modified
    -   Sequence IDs - last modified date is not available
        -   when the source records are only being appended to and never updated


<a id="org58b2779"></a>

## deployment

-   <https://towardsdatascience.com/getting-started-with-airflow-locally-and-remotely-d068df7fcb4>
-   pycharm + docker <https://medium.com/ninjavan-tech/setting-up-a-complete-local-development-environment-for-airflow-docker-pycharm-and-tests-3577ddb4ca94>
    -   <https://github.com/ninja-van/airflow-boilerplate>

-   <https://www.gradiant.org/en/blog/apache-airflow-docker-en/>
-   <https://airflow.apache.org/docs/apache-airflow/2.0.2/start/docker.html>

cd /home/airflow && docker-compose down && docker-compose up -d
