BI.org
*** docker-compose
---
version: "3.7"

services:

  backend:
    image: mysql:latest
    restart: unless-stopped
    command: --default-authentication-plugin=mysql_native_password
    networks:
      - internal
    volumes:
      - "backend:/var/lib/mysql"
    env_file:
      - mysql.env

  engine:
    restart: unless-stopped
    build: ./airflow-engine
    depends_on:
      - backend
    init: true
    networks:
      - internal
    volumes:
      - "engine:/root/airflow/"
      - ./dags:/root/airflow/dags
    ports:
      - "8080:8080"
    env_file:
      - mysql.env

networks:
  internal:

volumes:
  engine:
  backend:

*** Dockerfile
# Airflow seems to crash with Python 3.8, it's important to use version 3.7 instead
FROM python:3.7

# Install and setup Airflow
RUN pip3 install 'apache-airflow[mysql,crypto]' mysql-connector-python

# Configure Airflow: connect to backend
WORKDIR /root/airflow/
COPY airflow.sh airflow.sh
RUN chmod +x airflow.sh
COPY fernet.py fernet.py
COPY mysqlconnect.py mysqlconnect.py
CMD ./airflow.sh

*** ferenet.py
from cryptography.fernet import Fernet
import configparser

# Generate a random Fernet key
fernet_key = Fernet.generate_key().decode()

# Store the key
config = configparser.ConfigParser()
config.read('/root/airflow/airflow.cfg')
config['core']['fernet_key'] = fernet_key
with open('/root/airflow/airflow.cfg', 'w') as f:
   config.write(f)

*** mysqlconnect.py
from os import environ as env
import configparser

# Open the Airflow config file
config = configparser.ConfigParser()
config.read('/root/airflow/airflow.cfg')

# Store the URL of the MySQL database
config['core']['sql_alchemy_conn'] = 'mysql://{user}:{password}@backend/{db}'.format(user=env.get('MYSQL_USER'), password=env.get('MYSQL_PASSWORD'), db=env.get('MYSQL_DATABASE'))
config['core']['executor'] = 'LocalExecutor'
with open('/root/airflow/airflow.cfg', 'w') as f:
     config.write(f)

*** airflow.sh
INIT_FILE=.airflowinitialized
if [ ! -f "$INIT_FILE" ]; then
    # Create all Airflow configuration files
    airflow initdb
    rm /root/airflow/airflow.db

    # Secure the storage of connections’ passwords
    python fernet.py

    # Wait until the DB is ready
#    apt update && apt install -y netcat
#    while ! nc -z backend 3306; do
        sleep 20
#    done
#    apt remove -y netcat

    # Setup the DB
    python mysqlconnect.py
    airflow initdb

    # Allow XComs to store objects bigger than 65KB
    apt update && apt install -y default-mysql-client
    echo 'ALTER TABLE xcom MODIFY value LONGBLOB;' | mysql –h backend –u root –p$MYSQL_ROOT_PASSWORD airflowdb
    apt remove -y default-mysql-client

    # This configuration is done only the first time
    touch "$INIT_FILE"
fi

# Run the Airflow webserver and scheduler
airflow scheduler &
airflow webserver &
wait

** test
https://blog.usejournal.com/testing-in-airflow-part-1-dag-validation-tests-dag-definition-tests-and-unit-tests-2aa94970570c

airflow list_dags - show errors

*** operator
#+BEGIN_SRC python
import logging

from airflow.hooks.postgres_hook import PostgresHook
from airflow.hooks.oracle_hook import OracleHook
from airflow.models import BaseOperator
from airflow.utils.decorators import apply_defaults


class PostgresToOracleOperator(BaseOperator):
    @apply_defaults
    def __init__(self, task_id, *args, **kwargs):
        super().__init__(task_id=task_id, *args, **kwargs)

    def execute(self, context):
        print("ok")




# Operator Test
if __name__ == '__main__':
    from airflow import DAG
    from datetime import datetime
    from airflow.models import TaskInstance

    dag = DAG(dag_id='anydag', start_date=datetime.now())
    task = PostgresToOracleOperator(dag=dag, task_id='s')
    ti = TaskInstance(task=task, execution_date=datetime.now())
    task.execute(ti.get_template_context())

#+END_SRC
*** dag test
**** DAG Validation Test
test for import errors

*** task.execute
- reqire database initialized
- $airflow config get-value core sql_alchemy_conn - path to database
