BI.html
<div id="outline-container-org1f52aa2" class="outline-4">
<h4 id="org1f52aa2"><span class="section-number-4">23.15.1</span> docker-compose</h4>
<div class="outline-text-4" id="text-23-15-1">
<p>
&#x2014;
version: "3.7"
</p>

<p>
services:
</p>

<p>
backend:
  image: mysql:latest
  restart: unless-stopped
  command: &#x2013;default-authentication-plugin=mysql<sub>native</sub><sub>password</sub>
  networks:
</p>
<ul class="org-ul">
<li>internal</li>
</ul>
<p>
volumes:
</p>
<ul class="org-ul">
<li>"backend:/var/lib/mysql"</li>
</ul>
<p>
env<sub>file</sub>:
</p>
<ul class="org-ul">
<li>mysql.env</li>
</ul>

<p>
engine:
  restart: unless-stopped
  build: ./airflow-engine
  depends<sub>on</sub>:
</p>
<ul class="org-ul">
<li>backend</li>
</ul>
<p>
init: true
networks:
</p>
<ul class="org-ul">
<li>internal</li>
</ul>
<p>
volumes:
</p>
<ul class="org-ul">
<li>"engine:/root/airflow/"</li>
<li>./dags:/root/airflow/dags</li>
</ul>
<p>
ports:
</p>
<ul class="org-ul">
<li>"8080:8080"</li>
</ul>
<p>
env<sub>file</sub>:
</p>
<ul class="org-ul">
<li>mysql.env</li>
</ul>

<p>
networks:
  internal:
</p>

<p>
volumes:
  engine:
  backend:
</p>
</div>
</div>

<div id="outline-container-org324cd82" class="outline-4">
<h4 id="org324cd82"><span class="section-number-4">23.15.2</span> Dockerfile</h4>
<div class="outline-text-4" id="text-23-15-2">
<p>
FROM python:3.7
</p>

<p>
RUN pip3 install 'apache-airflow[mysql,crypto]' mysql-connector-python
</p>

<p>
WORKDIR <i>root/airflow</i>
COPY airflow.sh airflow.sh
RUN chmod +x airflow.sh
COPY fernet.py fernet.py
COPY mysqlconnect.py mysqlconnect.py
CMD ./airflow.sh
</p>
</div>
</div>

<div id="outline-container-org69785ff" class="outline-4">
<h4 id="org69785ff"><span class="section-number-4">23.15.3</span> ferenet.py</h4>
<div class="outline-text-4" id="text-23-15-3">
<p>
from cryptography.fernet import Fernet
import configparser
</p>

<p>
fernet<sub>key</sub> = Fernet.generate<sub>key</sub>().decode()
</p>

<p>
config = configparser.ConfigParser()
config.read('/root/airflow/airflow.cfg')
config['core']['fernet<sub>key</sub>'] = fernet<sub>key</sub>
with open('/root/airflow/airflow.cfg', 'w') as f:
   config.write(f)
</p>
</div>
</div>

<div id="outline-container-orgdea0efc" class="outline-4">
<h4 id="orgdea0efc"><span class="section-number-4">23.15.4</span> mysqlconnect.py</h4>
<div class="outline-text-4" id="text-23-15-4">
<p>
from os import environ as env
import configparser
</p>

<p>
config = configparser.ConfigParser()
config.read('/root/airflow/airflow.cfg')
</p>

<p>
config['core']['sql<sub>alchemy</sub><sub>conn</sub>'] = 'mysql://{user}:{password}@backend/{db}'.format(user=env.get('MYSQL<sub>USER</sub>'), password=env.get('MYSQL<sub>PASSWORD</sub>'), db=env.get('MYSQL<sub>DATABASE</sub>'))
config['core']['executor'] = 'LocalExecutor'
with open('/root/airflow/airflow.cfg', 'w') as f:
     config.write(f)
</p>
</div>
</div>

<div id="outline-container-org6f1dd51" class="outline-4">
<h4 id="org6f1dd51"><span class="section-number-4">23.15.5</span> airflow.sh</h4>
<div class="outline-text-4" id="text-23-15-5">
<p>
INIT<sub>FILE</sub>=.airflowinitialized
if [ ! -f "$INIT<sub>FILE</sub>" ]; then
</p>

<p>
airflow initdb
rm /root/airflow/airflow.db
</p>

<p>
python fernet.py
</p>

<p>
sleep 20
</p>

<p>
python mysqlconnect.py
airflow initdb
</p>

<p>
apt update &amp;&amp; apt install -y default-mysql-client
echo 'ALTER TABLE xcom MODIFY value LONGBLOB;' | mysql –h backend –u root –p$MYSQL<sub>ROOT</sub><sub>PASSWORD</sub> airflowdb
apt remove -y default-mysql-client
</p>

<p>
    touch "$INIT<sub>FILE</sub>"
fi
</p>

<p>
airflow scheduler &amp;
airflow webserver &amp;
wait
</p>
</div>
</div>
</div>

<div id="outline-container-org69fd841" class="outline-3">
<h3 id="org69fd841"><span class="section-number-3">23.16</span> test</h3>
<div class="outline-text-3" id="text-23-16">
<p>
<a href="https://blog.usejournal.com/testing-in-airflow-part-1-dag-validation-tests-dag-definition-tests-and-unit-tests-2aa94970570c">https://blog.usejournal.com/testing-in-airflow-part-1-dag-validation-tests-dag-definition-tests-and-unit-tests-2aa94970570c</a>
</p>

<p>
airflow list<sub>dags</sub> - show errors
</p>
</div>

<div id="outline-container-org2d8140a" class="outline-4">
<h4 id="org2d8140a"><span class="section-number-4">23.16.1</span> operator</h4>
<div class="outline-text-4" id="text-23-16-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">import</span> logging

<span style="color: #8ac6f2; font-weight: bold;">from</span> airflow.hooks.postgres_hook <span style="color: #8ac6f2; font-weight: bold;">import</span> PostgresHook
<span style="color: #8ac6f2; font-weight: bold;">from</span> airflow.hooks.oracle_hook <span style="color: #8ac6f2; font-weight: bold;">import</span> OracleHook
<span style="color: #8ac6f2; font-weight: bold;">from</span> airflow.models <span style="color: #8ac6f2; font-weight: bold;">import</span> BaseOperator
<span style="color: #8ac6f2; font-weight: bold;">from</span> airflow.utils.decorators <span style="color: #8ac6f2; font-weight: bold;">import</span> apply_defaults


<span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">PostgresToOracleOperator</span>(BaseOperator):
    <span style="color: #92a65e; font-weight: bold;">@apply_defaults</span>
    <span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">__init__</span>(<span style="color: #8ac6f2; font-weight: bold;">self</span>, task_id, *args, **kwargs):
        <span style="color: #e5786d;">super</span>().__init__(task_id=task_id, *args, **kwargs)

    <span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">execute</span>(<span style="color: #8ac6f2; font-weight: bold;">self</span>, context):
        <span style="color: #8ac6f2; font-weight: bold;">print</span>(<span style="color: #95e454;">"ok"</span>)




<span style="color: #fa8072;"># </span><span style="color: #99968b; font-style: italic;">Operator Test</span>
<span style="color: #8ac6f2; font-weight: bold;">if</span> <span style="color: #e5786d;">__name__</span> == <span style="color: #95e454;">'__main__'</span>:
    <span style="color: #8ac6f2; font-weight: bold;">from</span> airflow <span style="color: #8ac6f2; font-weight: bold;">import</span> DAG
    <span style="color: #8ac6f2; font-weight: bold;">from</span> datetime <span style="color: #8ac6f2; font-weight: bold;">import</span> datetime
    <span style="color: #8ac6f2; font-weight: bold;">from</span> airflow.models <span style="color: #8ac6f2; font-weight: bold;">import</span> TaskInstance

    <span style="color: #cae682;">dag</span> = DAG(dag_id=<span style="color: #95e454;">'anydag'</span>, start_date=datetime.now())
    <span style="color: #cae682;">task</span> = PostgresToOracleOperator(dag=dag, task_id=<span style="color: #95e454;">'s'</span>)
    <span style="color: #cae682;">ti</span> = TaskInstance(task=task, execution_date=datetime.now())
    task.execute(ti.get_template_context())

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9d1783" class="outline-4">
<h4 id="orgb9d1783"><span class="section-number-4">23.16.2</span> dag test</h4>
<div class="outline-text-4" id="text-23-16-2">
</div>
<ol class="org-ol">
<li><a id="orgf3ed9ff"></a>DAG Validation Test<br />
<div class="outline-text-5" id="text-23-16-2-1">
<p>
test for import errors
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgdf145df" class="outline-4">
<h4 id="orgdf145df"><span class="section-number-4">23.16.3</span> task.execute</h4>
<div class="outline-text-4" id="text-23-16-3">
<ul class="org-ul">
<li>reqire database initialized</li>
<li>$airflow config get-value core sql<sub>alchemy</sub><sub>conn</sub> - path to database</li>
</ul>
</div>
</div>
</div>
