BI.md


<a id="org9eb2811"></a>

### docker-compose

&#x2014;
version: "3.7"

services:

backend:
  image: mysql:latest
  restart: unless-stopped
  command: &#x2013;default-authentication-plugin=mysql<sub>native</sub><sub>password</sub>
  networks:

-   internal

volumes:

-   "backend:/var/lib/mysql"

env<sub>file</sub>:

-   mysql.env

engine:
  restart: unless-stopped
  build: ./airflow-engine
  depends<sub>on</sub>:

-   backend

init: true
networks:

-   internal

volumes:

-   "engine:/root/airflow/"
-   ./dags:/root/airflow/dags

ports:

-   "8080:8080"

env<sub>file</sub>:

-   mysql.env

networks:
  internal:

volumes:
  engine:
  backend:


<a id="orgb545f67"></a>

### Dockerfile

FROM python:3.7

RUN pip3 install 'apache-airflow[mysql,crypto]' mysql-connector-python

WORKDIR *root/airflow*
COPY airflow.sh airflow.sh
RUN chmod +x airflow.sh
COPY fernet.py fernet.py
COPY mysqlconnect.py mysqlconnect.py
CMD ./airflow.sh


<a id="org2e8a85f"></a>

### ferenet.py

from cryptography.fernet import Fernet
import configparser

fernet<sub>key</sub> = Fernet.generate<sub>key</sub>().decode()

config = configparser.ConfigParser()
config.read('/root/airflow/airflow.cfg')
config['core']['fernet<sub>key</sub>'] = fernet<sub>key</sub>
with open('/root/airflow/airflow.cfg', 'w') as f:
   config.write(f)


<a id="orgd35e986"></a>

### mysqlconnect.py

from os import environ as env
import configparser

config = configparser.ConfigParser()
config.read('/root/airflow/airflow.cfg')

config['core']['sql<sub>alchemy</sub><sub>conn</sub>'] = 'mysql://{user}:{password}@backend/{db}'.format(user=env.get('MYSQL<sub>USER</sub>'), password=env.get('MYSQL<sub>PASSWORD</sub>'), db=env.get('MYSQL<sub>DATABASE</sub>'))
config['core']['executor'] = 'LocalExecutor'
with open('/root/airflow/airflow.cfg', 'w') as f:
     config.write(f)


<a id="orga8635b0"></a>

### airflow.sh

INIT<sub>FILE</sub>=.airflowinitialized
if [ ! -f "$INIT<sub>FILE</sub>" ]; then

airflow initdb
rm /root/airflow/airflow.db

python fernet.py

sleep 20

python mysqlconnect.py
airflow initdb

apt update && apt install -y default-mysql-client
echo 'ALTER TABLE xcom MODIFY value LONGBLOB;' | mysql –h backend –u root –p$MYSQL<sub>ROOT</sub><sub>PASSWORD</sub> airflowdb
apt remove -y default-mysql-client

    touch "$INIT<sub>FILE</sub>"
fi

airflow scheduler &
airflow webserver &
wait


<a id="org3a2a244"></a>

## test

<https://blog.usejournal.com/testing-in-airflow-part-1-dag-validation-tests-dag-definition-tests-and-unit-tests-2aa94970570c>

airflow list<sub>dags</sub> - show errors


<a id="org3cfbace"></a>

### operator

    import logging

    from airflow.hooks.postgres_hook import PostgresHook
    from airflow.hooks.oracle_hook import OracleHook
    from airflow.models import BaseOperator
    from airflow.utils.decorators import apply_defaults


    class PostgresToOracleOperator(BaseOperator):
        @apply_defaults
        def __init__(self, task_id, *args, **kwargs):
            super().__init__(task_id=task_id, *args, **kwargs)

        def execute(self, context):
            print("ok")




    # Operator Test
    if __name__ == '__main__':
        from airflow import DAG
        from datetime import datetime
        from airflow.models import TaskInstance

        dag = DAG(dag_id='anydag', start_date=datetime.now())
        task = PostgresToOracleOperator(dag=dag, task_id='s')
        ti = TaskInstance(task=task, execution_date=datetime.now())
        task.execute(ti.get_template_context())


<a id="org721cd8d"></a>

### dag test

1.  DAG Validation Test

    test for import errors


<a id="org61de219"></a>

### task.execute

-   reqire database initialized
-   $airflow config get-value core sql<sub>alchemy</sub><sub>conn</sub> - path to database
