BI.org
** dynamic dag
- https://habr.com/en/company/mailru/blog/344398/
- https://stackoverflow.com/questions/39133376/airflow-dynamic-dag-and-task-ids
** pass data between operators
*Variables*
- https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py
- Admin-Variables
- baz = Variable.get("baz", default_var=None)

** макросы Jinja в Airflow
- https://habr.com/ru/company/mailru/blog/344398/

Defined in context of BaseOperator.execute(self, context: Any)
- get_template_context  https://github.com/apache/airflow/blob/main/airflow/models/taskinstance.py
- reference https://airflow.apache.org/docs/apache-airflow/stable/macros-ref.html


- "{{ ds }}" - execution date
- task.render_template("{{ ds }}")

dates:
- start_date - от чего вообще начинаем
- end_date - когда больше не будем
- execution_date - как и ds показывается для какой даты сейчас запущен

** parallism config
*dag parameters*:
- max_active_runs=1 - не больше одного дага паралельно запущенного



*config parameters*:
# This defines
# the max number of task instances that should run simultaneously
# on this airflow installation
parallelism = 32

# The number of task instances allowed to run concurrently by the scheduler
dag_concurrency = 16

# Are DAGs paused by default at creation
dags_are_paused_at_creation = True

# When not using pools, tasks are run in the "default pool",
# whose size is guided by this config element
non_pooled_task_slot_count = 128

# The maximum number of active DAG runs per DAG
max_active_runs_per_dag = 16
** skip task
You can leverage a SensorOperator more specifically the FileSensorOperator to check if a file exists. You can
then use the soft_fail arg to mark the tasks as "skipped" when the file does not exist. This will allow the
DAG to succeed while maintaining the proper history of what occurred on the file check.

** stop dag
1) kwargs['dag'].set_dag_runs_state(State.FAILED) # without retry
2) raise AirflowException("asdas!") or ValueError("")
** Executors
Are the mechanism by which task instances get run.
- default - SequentialExecutor

** Cross-DAG Dependencies (subdags)
- visualize https://github.com/ms32035/airflow-dag-dependencies
*** ExternalTaskSensor
- https://towardsdatascience.com/dependencies-between-dags-in-apache-airflow-2f5935cde3f0
- https://airflow.apache.org/docs/apache-airflow/stable/howto/operator/external_task_sensor.html
ExternalTaskSensor
ExternalTaskMarker

trigger_dagrun
*** TODO TriggerDagRunOperator
*** TODO dag.implicit_dependencies = ['dag_1', 'dag_2']
*** SubDagOperator
Astronomer highly recommends staying away from SubDags. Airflow 1.10 has changed the default SubDag
execution method to use the Sequential Executor to work around deadlocks caused by SubDags

Since SubDAGs have been deprecated, the best practice is to use other Airflow features:
- TaskGroups:
- Cross-DAG dependencies - TriggerDagRunOperator, ExternalTaskSensor

https://www.astronomer.io/guides/subdags/
https://www.adoclib.com/blog/airflow-subdagoperator-deadlock.html
https://medium.com/gumgum-tech/implement-dag-dependencies-using-triggerdagrun-operator-318b46036347
** Trigger Dag - JSON
{'kay':'value'}

PythonOperator
has property - provide_context (deafult False)

two ways in which one can access the parameters:
- kwargs['dag_run'].conf - None or {'key':'123'}
- .get('key')
- {{ dag_run.conf['key'] }}
