BI.html
<div id="outline-container-orgbf97d20" class="outline-3">
<h3 id="orgbf97d20"><span class="section-number-3">23.17</span> dynamic dag</h3>
<div class="outline-text-3" id="text-23-17">
<ul class="org-ul">
<li><a href="https://habr.com/en/company/mailru/blog/344398/">https://habr.com/en/company/mailru/blog/344398/</a></li>
<li><a href="https://stackoverflow.com/questions/39133376/airflow-dynamic-dag-and-task-ids">https://stackoverflow.com/questions/39133376/airflow-dynamic-dag-and-task-ids</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgef1bb40" class="outline-3">
<h3 id="orgef1bb40"><span class="section-number-3">23.18</span> pass data between operators</h3>
<div class="outline-text-3" id="text-23-18">
<p>
<b>Variables</b>
</p>
<ul class="org-ul">
<li><a href="https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py">https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py</a></li>
<li>Admin-Variables</li>
<li>baz = Variable.get("baz", default<sub>var</sub>=None)</li>
</ul>
</div>
</div>

<div id="outline-container-org4806efd" class="outline-3">
<h3 id="org4806efd"><span class="section-number-3">23.19</span> макросы Jinja в Airflow</h3>
<div class="outline-text-3" id="text-23-19">
<ul class="org-ul">
<li><a href="https://habr.com/ru/company/mailru/blog/344398/">https://habr.com/ru/company/mailru/blog/344398/</a></li>
</ul>

<p>
Defined in context of BaseOperator.execute(self, context: Any)
</p>
<ul class="org-ul">
<li>get<sub>template</sub><sub>context</sub>  <a href="https://github.com/apache/airflow/blob/main/airflow/models/taskinstance.py">https://github.com/apache/airflow/blob/main/airflow/models/taskinstance.py</a></li>
<li>reference <a href="https://airflow.apache.org/docs/apache-airflow/stable/macros-ref.html">https://airflow.apache.org/docs/apache-airflow/stable/macros-ref.html</a></li>
</ul>


<ul class="org-ul">
<li>"{{ ds }}" - execution date</li>
<li>task.render<sub>template</sub>("{{ ds }}")</li>
</ul>

<p>
dates:
</p>
<ul class="org-ul">
<li>start<sub>date</sub> - от чего вообще начинаем</li>
<li>end<sub>date</sub> - когда больше не будем</li>
<li>execution<sub>date</sub> - как и ds показывается для какой даты сейчас запущен</li>
</ul>
</div>
</div>

<div id="outline-container-orgd07cbed" class="outline-3">
<h3 id="orgd07cbed"><span class="section-number-3">23.20</span> parallism config</h3>
<div class="outline-text-3" id="text-23-20">
<p>
<b>dag parameters</b>:
</p>
<ul class="org-ul">
<li>max<sub>active</sub><sub>runs</sub>=1 - не больше одного дага паралельно запущенного</li>
</ul>



<p>
<b>config parameters</b>:
</p>

<p>
parallelism = 32
</p>

<p>
dag<sub>concurrency</sub> = 16
</p>

<p>
dags<sub>are</sub><sub>paused</sub><sub>at</sub><sub>creation</sub> = True
</p>

<p>
non<sub>pooled</sub><sub>task</sub><sub>slot</sub><sub>count</sub> = 128
</p>

<p>
max<sub>active</sub><sub>runs</sub><sub>per</sub><sub>dag</sub> = 16
</p>
</div>
</div>
<div id="outline-container-orgc846146" class="outline-3">
<h3 id="orgc846146"><span class="section-number-3">23.21</span> skip task</h3>
<div class="outline-text-3" id="text-23-21">
<p>
You can leverage a SensorOperator more specifically the FileSensorOperator to check if a file exists. You can
then use the soft<sub>fail</sub> arg to mark the tasks as "skipped" when the file does not exist. This will allow the
DAG to succeed while maintaining the proper history of what occurred on the file check.
</p>
</div>
</div>

<div id="outline-container-orgfdbd8c7" class="outline-3">
<h3 id="orgfdbd8c7"><span class="section-number-3">23.22</span> stop dag</h3>
<div class="outline-text-3" id="text-23-22">
<ol class="org-ol">
<li>kwargs['dag'].set<sub>dag</sub><sub>runs</sub><sub>state</sub>(State.FAILED) # without retry</li>
<li>raise AirflowException("asdas!") or ValueError("")</li>
</ol>
</div>
</div>
<div id="outline-container-org9eb2440" class="outline-3">
<h3 id="org9eb2440"><span class="section-number-3">23.23</span> Executors</h3>
<div class="outline-text-3" id="text-23-23">
<p>
Are the mechanism by which task instances get run.
</p>
<ul class="org-ul">
<li>default - SequentialExecutor</li>
</ul>
</div>
</div>

<div id="outline-container-org13cd0cc" class="outline-3">
<h3 id="org13cd0cc"><span class="section-number-3">23.24</span> Cross-DAG Dependencies (subdags)</h3>
<div class="outline-text-3" id="text-23-24">
<ul class="org-ul">
<li>visualize <a href="https://github.com/ms32035/airflow-dag-dependencies">https://github.com/ms32035/airflow-dag-dependencies</a></li>
</ul>
</div>
<div id="outline-container-orgf7629dd" class="outline-4">
<h4 id="orgf7629dd"><span class="section-number-4">23.24.1</span> ExternalTaskSensor</h4>
<div class="outline-text-4" id="text-23-24-1">
<ul class="org-ul">
<li><a href="https://towardsdatascience.com/dependencies-between-dags-in-apache-airflow-2f5935cde3f0">https://towardsdatascience.com/dependencies-between-dags-in-apache-airflow-2f5935cde3f0</a></li>
<li><a href="https://airflow.apache.org/docs/apache-airflow/stable/howto/operator/external_task_sensor.html">https://airflow.apache.org/docs/apache-airflow/stable/howto/operator/external_task_sensor.html</a></li>
</ul>
<p>
ExternalTaskSensor
ExternalTaskMarker
</p>

<p>
trigger<sub>dagrun</sub>
</p>
</div>
</div>
<div id="outline-container-orga1ccf9d" class="outline-4">
<h4 id="orga1ccf9d"><span class="section-number-4">23.24.2</span> <span class="todo TODO">TODO</span> TriggerDagRunOperator</h4>
</div>
<div id="outline-container-org7251659" class="outline-4">
<h4 id="org7251659"><span class="section-number-4">23.24.3</span> <span class="todo TODO">TODO</span> dag.implicit<sub>dependencies</sub> = ['dag<sub>1</sub>', 'dag<sub>2</sub>']</h4>
</div>
<div id="outline-container-org1f07399" class="outline-4">
<h4 id="org1f07399"><span class="section-number-4">23.24.4</span> SubDagOperator</h4>
<div class="outline-text-4" id="text-23-24-4">
<p>
Astronomer highly recommends staying away from SubDags. Airflow 1.10 has changed the default SubDag
execution method to use the Sequential Executor to work around deadlocks caused by SubDags
</p>

<p>
Since SubDAGs have been deprecated, the best practice is to use other Airflow features:
</p>
<ul class="org-ul">
<li>TaskGroups:</li>
<li>Cross-DAG dependencies - TriggerDagRunOperator, ExternalTaskSensor</li>
</ul>

<p>
<a href="https://www.astronomer.io/guides/subdags/">https://www.astronomer.io/guides/subdags/</a>
<a href="https://www.adoclib.com/blog/airflow-subdagoperator-deadlock.html">https://www.adoclib.com/blog/airflow-subdagoperator-deadlock.html</a>
<a href="https://medium.com/gumgum-tech/implement-dag-dependencies-using-triggerdagrun-operator-318b46036347">https://medium.com/gumgum-tech/implement-dag-dependencies-using-triggerdagrun-operator-318b46036347</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd6bea96" class="outline-3">
<h3 id="orgd6bea96"><span class="section-number-3">23.25</span> Trigger Dag - JSON</h3>
<div class="outline-text-3" id="text-23-25">
<p>
{'kay':'value'}
</p>

<p>
PythonOperator
has property - provide<sub>context</sub> (deafult False)
</p>

<p>
two ways in which one can access the parameters:
</p>
<ul class="org-ul">
<li>kwargs['dag<sub>run</sub>'].conf - None or {'key':'123'}</li>
<li>.get('key')</li>
<li>{{ dag<sub>run.conf</sub>['key'] }}</li>
</ul>
</div>
</div>
