BI.md


<a id="orgaba278a"></a>

## dynamic dag

-   <https://habr.com/en/company/mailru/blog/344398/>
-   <https://stackoverflow.com/questions/39133376/airflow-dynamic-dag-and-task-ids>


<a id="orgdd40e7e"></a>

## pass data between operators

**Variables**

-   <https://github.com/gtoonstra/etl-with-airflow/blob/master/examples/etl-example/dags/orders_staging.py>
-   Admin-Variables
-   baz = Variable.get("baz", default<sub>var</sub>=None)


<a id="orgd8b3d81"></a>

## макросы Jinja в Airflow

-   <https://habr.com/ru/company/mailru/blog/344398/>

Defined in context of BaseOperator.execute(self, context: Any)

-   get<sub>template</sub><sub>context</sub>  <https://github.com/apache/airflow/blob/main/airflow/models/taskinstance.py>
-   reference <https://airflow.apache.org/docs/apache-airflow/stable/macros-ref.html>

-   "{{ ds }}" - execution date
-   task.render<sub>template</sub>("{{ ds }}")

dates:

-   start<sub>date</sub> - от чего вообще начинаем
-   end<sub>date</sub> - когда больше не будем
-   execution<sub>date</sub> - как и ds показывается для какой даты сейчас запущен


<a id="orgfb44090"></a>

## parallism config

**dag parameters**:

-   max<sub>active</sub><sub>runs</sub>=1 - не больше одного дага паралельно запущенного

**config parameters**:

parallelism = 32

dag<sub>concurrency</sub> = 16

dags<sub>are</sub><sub>paused</sub><sub>at</sub><sub>creation</sub> = True

non<sub>pooled</sub><sub>task</sub><sub>slot</sub><sub>count</sub> = 128

max<sub>active</sub><sub>runs</sub><sub>per</sub><sub>dag</sub> = 16


<a id="orgb2896b4"></a>

## skip task

You can leverage a SensorOperator more specifically the FileSensorOperator to check if a file exists. You can
then use the soft<sub>fail</sub> arg to mark the tasks as "skipped" when the file does not exist. This will allow the
DAG to succeed while maintaining the proper history of what occurred on the file check.


<a id="orgde3e07e"></a>

## stop dag

1.  kwargs['dag'].set<sub>dag</sub><sub>runs</sub><sub>state</sub>(State.FAILED) # without retry
2.  raise AirflowException("asdas!") or ValueError("")


<a id="orga87fc5b"></a>

## Executors

Are the mechanism by which task instances get run.

-   default - SequentialExecutor


<a id="org3c9f783"></a>

## Cross-DAG Dependencies (subdags)

-   visualize <https://github.com/ms32035/airflow-dag-dependencies>


<a id="orgcb05ec9"></a>

### ExternalTaskSensor

-   <https://towardsdatascience.com/dependencies-between-dags-in-apache-airflow-2f5935cde3f0>
-   <https://airflow.apache.org/docs/apache-airflow/stable/howto/operator/external_task_sensor.html>

ExternalTaskSensor
ExternalTaskMarker

trigger<sub>dagrun</sub>


<a id="orgf4a4190"></a>

### TODO TriggerDagRunOperator


<a id="org5648927"></a>

### TODO dag.implicit<sub>dependencies</sub> = ['dag<sub>1</sub>', 'dag<sub>2</sub>']


<a id="orge76c556"></a>

### SubDagOperator

Astronomer highly recommends staying away from SubDags. Airflow 1.10 has changed the default SubDag
execution method to use the Sequential Executor to work around deadlocks caused by SubDags

Since SubDAGs have been deprecated, the best practice is to use other Airflow features:

-   TaskGroups:
-   Cross-DAG dependencies - TriggerDagRunOperator, ExternalTaskSensor

<https://www.astronomer.io/guides/subdags/>
<https://www.adoclib.com/blog/airflow-subdagoperator-deadlock.html>
<https://medium.com/gumgum-tech/implement-dag-dependencies-using-triggerdagrun-operator-318b46036347>


<a id="org37592c7"></a>

## Trigger Dag - JSON

{'kay':'value'}

PythonOperator
has property - provide<sub>context</sub> (deafult False)

two ways in which one can access the parameters:

-   kwargs['dag<sub>run</sub>'].conf - None or {'key':'123'}
-   .get('key')
-   {{ dag<sub>run.conf</sub>['key'] }}
