BI.org
** update 2.0.2
https://airflow.apache.org/docs/apache-airflow/stable/upgrading-to-2.html
3.6+ not 3.9

1)
 airflow initdb -> airflow db init
2)
[webserver] rbac = True
3) airflow users create \
    --role Admin \
    --username admin \
    --firstname FIRST_NAME \
    --lastname LAST_NAME \
    --email EMAIL@example.org
4) add "airflow db init" to airflow.sh
5) run once
6) remove "airflow db init" from airflow.sh
** create connection
   from airflow.models import Connection
from airflow import settings

def create_conn(username, password, host=None):
    new_conn = Connection(conn_id=f'{username}_connection',
                                  login=username,
                                  host=host if host else None)
    new_conn.set_password(password)

    session = settings.Session()
    session.add(new_conn)
    session.commit()

** create user
docker exec -it airflow_engine bash -c 'airflow user create --role Admin --username admin --firstname V
--lastname C --email cv@r.ru'
** restart
docker-compose down && docker-compose up -d
** problems
- execution_timeout is not working
- Own Operators require hard testing
- all Python dependencies from each workflow need to be installed on each Airflow Worker

** how to change config:
- connect to running airflow_engine and cat airflow.cfg
- change config
** rest API
- authentication https://airflow.apache.org/docs/apache-airflow/stable/security/api.html
- https://airflow.apache.org/docs/apache-airflow/stable/stable-rest-api-ref.html
- https://airflow.apache.org/docs/apache-airflow/1.10.2/api.html
: [api]
: auth_backends = airflow.api.auth.backend.basic_auth

check:
: $ airflow config get-value api auth_backends
: airflow.api.auth.backend.basic_auth

Необходимо подождать некоторое время, авторизация возможно не сразу включается.

#+begin_src sh
ENDPOINT_URL="http://localhost:8080/"
curl -X GET --insecure --user "username:password" \
    "${ENDPOINT_URL}/api/v1/pools"

#+end_src

** logs
logging.Logger - 4 loggers by default:
- root
- flask_appbuilder
- airflow.processor
- airflow.task

logging.Formatter
- airflow_colored
- airflow

locations:
- Scheduler logs: /usr/local/airflow/logs/scheduler
- Webserver logs appear in the console by default: docker logs <webserver_container_id>
- Metadata database logs: docker logs <postgres_container_id>
- docker logs <triggerer_container_id>
- Task logs are in /usr/local/airflow/logs/

links:
- https://www.astronomer.io/guides/logging/
- https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-architecture.html
- https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-tasks.html#serving-logs-from-workers


** Database of Airflow
recent runs
#+begin_src sql
SELECT
    dag_run.dag_id,
    dag_run.state
FROM dag_run
INNER JOIN (SELECT
                dag_id,
                MAX(execution_date) AS date
            FROM dag_run
            GROUP BY dag_id) mx
    ON
    dag_run.dag_id = mx.dag_id
    AND dag_run.execution_date = mx.date
JOIN dag ON dag.dag_id = dag_run.dag_id AND is_active = 1 AND is_paused = 0
#+end_src

* TODO dbt - ETL
- writing test
- generate documentation
- SQL, yaml
A dbt model is basically a .sql file with a SELECT statement.
