BI.html
<div id="outline-container-orgf54b99d" class="outline-3">
<h3 id="orgf54b99d"><span class="section-number-3">23.26</span> update 2.0.2</h3>
<div class="outline-text-3" id="text-23-26">
<p>
<a href="https://airflow.apache.org/docs/apache-airflow/stable/upgrading-to-2.html">https://airflow.apache.org/docs/apache-airflow/stable/upgrading-to-2.html</a>
3.6+ not 3.9
</p>

<ol class="org-ol">
<li>airflow initdb -&gt; airflow db init</li>
<li></li>
</ol>
<p>
[webserver] rbac = True
</p>
<ol class="org-ol">
<li>airflow users create \
&#x2013;role Admin \
&#x2013;username admin \
&#x2013;firstname FIRST<sub>NAME</sub> \
&#x2013;lastname LAST<sub>NAME</sub> \
&#x2013;email EMAIL@example.org</li>
<li>add "airflow db init" to airflow.sh</li>
<li>run once</li>
<li>remove "airflow db init" from airflow.sh</li>
</ol>
</div>
</div>
<div id="outline-container-org496d8ee" class="outline-3">
<h3 id="org496d8ee"><span class="section-number-3">23.27</span> create connection</h3>
<div class="outline-text-3" id="text-23-27">
<p>
   from airflow.models import Connection
from airflow import settings
</p>

<p>
def create<sub>conn</sub>(username, password, host=None):
    new<sub>conn</sub> = Connection(conn<sub>id</sub>=f'{username}<sub>connection</sub>',
                                  login=username,
                                  host=host if host else None)
    new<sub>conn.set</sub><sub>password</sub>(password)
</p>

<p>
session = settings.Session()
session.add(new<sub>conn</sub>)
session.commit()
</p>
</div>
</div>

<div id="outline-container-org35e4485" class="outline-3">
<h3 id="org35e4485"><span class="section-number-3">23.28</span> create user</h3>
<div class="outline-text-3" id="text-23-28">
<p>
docker exec -it airflow<sub>engine</sub> bash -c 'airflow user create &#x2013;role Admin &#x2013;username admin &#x2013;firstname V
&#x2013;lastname C &#x2013;email cv@r.ru'
</p>
</div>
</div>
<div id="outline-container-org23ff811" class="outline-3">
<h3 id="org23ff811"><span class="section-number-3">23.29</span> restart</h3>
<div class="outline-text-3" id="text-23-29">
<p>
docker-compose down &amp;&amp; docker-compose up -d
</p>
</div>
</div>
<div id="outline-container-org4d9cbb2" class="outline-3">
<h3 id="org4d9cbb2"><span class="section-number-3">23.30</span> problems</h3>
<div class="outline-text-3" id="text-23-30">
<ul class="org-ul">
<li>execution<sub>timeout</sub> is not working</li>
<li>Own Operators require hard testing</li>
<li>all Python dependencies from each workflow need to be installed on each Airflow Worker</li>
</ul>
</div>
</div>

<div id="outline-container-org08a472a" class="outline-3">
<h3 id="org08a472a"><span class="section-number-3">23.31</span> how to change config:</h3>
<div class="outline-text-3" id="text-23-31">
<ul class="org-ul">
<li>connect to running airflow<sub>engine</sub> and cat airflow.cfg</li>
<li>change config</li>
</ul>
</div>
</div>
<div id="outline-container-org99b048b" class="outline-3">
<h3 id="org99b048b"><span class="section-number-3">23.32</span> rest API</h3>
<div class="outline-text-3" id="text-23-32">
<ul class="org-ul">
<li>authentication <a href="https://airflow.apache.org/docs/apache-airflow/stable/security/api.html">https://airflow.apache.org/docs/apache-airflow/stable/security/api.html</a></li>
<li><a href="https://airflow.apache.org/docs/apache-airflow/stable/stable-rest-api-ref.html">https://airflow.apache.org/docs/apache-airflow/stable/stable-rest-api-ref.html</a></li>
<li><a href="https://airflow.apache.org/docs/apache-airflow/1.10.2/api.html">https://airflow.apache.org/docs/apache-airflow/1.10.2/api.html</a></li>
</ul>
<pre class="example">
[api]
auth_backends = airflow.api.auth.backend.basic_auth

</pre>

<p>
check:
</p>
<pre class="example">
$ airflow config get-value api auth_backends
airflow.api.auth.backend.basic_auth

</pre>

<p>
Необходимо подождать некоторое время, авторизация возможно не сразу включается.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #cae682;">ENDPOINT_URL</span>=<span style="color: #95e454;">"http://localhost:8080/"</span>
curl -X GET --insecure --user <span style="color: #95e454;">"username:password"</span> <span style="color: #95e454;">\</span>
    <span style="color: #95e454;">"${ENDPOINT_URL}/api/v1/pools"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8bb0cb" class="outline-3">
<h3 id="orgd8bb0cb"><span class="section-number-3">23.33</span> logs</h3>
<div class="outline-text-3" id="text-23-33">
<p>
logging.Logger - 4 loggers by default:
</p>
<ul class="org-ul">
<li>root</li>
<li>flask<sub>appbuilder</sub></li>
<li>airflow.processor</li>
<li>airflow.task</li>
</ul>

<p>
logging.Formatter
</p>
<ul class="org-ul">
<li>airflow<sub>colored</sub></li>
<li>airflow</li>
</ul>

<p>
locations:
</p>
<ul class="org-ul">
<li>Scheduler logs: /usr/local/airflow/logs/scheduler</li>
<li>Webserver logs appear in the console by default: docker logs &lt;webserver<sub>container</sub><sub>id</sub>&gt;</li>
<li>Metadata database logs: docker logs &lt;postgres<sub>container</sub><sub>id</sub>&gt;</li>
<li>docker logs &lt;triggerer<sub>container</sub><sub>id</sub>&gt;</li>
<li>Task logs are in <i>usr/local/airflow/logs</i></li>
</ul>

<p>
links:
</p>
<ul class="org-ul">
<li><a href="https://www.astronomer.io/guides/logging/">https://www.astronomer.io/guides/logging/</a></li>
<li><a href="https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-architecture.html">https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-architecture.html</a></li>
<li><a href="https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-tasks.html#serving-logs-from-workers">https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-tasks.html#serving-logs-from-workers</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8a6422f" class="outline-3">
<h3 id="org8a6422f"><span class="section-number-3">23.34</span> Database of Airflow</h3>
<div class="outline-text-3" id="text-23-34">
<p>
recent runs
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #8ac6f2; font-weight: bold;">SELECT</span>
    dag_run.dag_id,
    dag_run.<span style="color: #8ac6f2; font-weight: bold;">state</span>
<span style="color: #8ac6f2; font-weight: bold;">FROM</span> dag_run
<span style="color: #8ac6f2; font-weight: bold;">INNER</span> <span style="color: #8ac6f2; font-weight: bold;">JOIN</span> (<span style="color: #8ac6f2; font-weight: bold;">SELECT</span>
                dag_id,
                <span style="color: #e5786d;">MAX</span>(execution_date) <span style="color: #8ac6f2; font-weight: bold;">AS</span> <span style="color: #92a65e; font-weight: bold;">date</span>
            <span style="color: #8ac6f2; font-weight: bold;">FROM</span> dag_run
            <span style="color: #8ac6f2; font-weight: bold;">GROUP</span> <span style="color: #8ac6f2; font-weight: bold;">BY</span> dag_id) mx
    <span style="color: #8ac6f2; font-weight: bold;">ON</span>
    dag_run.dag_id = mx.dag_id
    <span style="color: #8ac6f2; font-weight: bold;">AND</span> dag_run.execution_date = mx.<span style="color: #92a65e; font-weight: bold;">date</span>
<span style="color: #8ac6f2; font-weight: bold;">JOIN</span> dag <span style="color: #8ac6f2; font-weight: bold;">ON</span> dag.dag_id = dag_run.dag_id <span style="color: #8ac6f2; font-weight: bold;">AND</span> is_active = 1 <span style="color: #8ac6f2; font-weight: bold;">AND</span> is_paused = 0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org20df5b4" class="outline-2">
<h2 id="org20df5b4"><span class="section-number-2">24</span> <span class="todo TODO">TODO</span> dbt - ETL</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>writing test</li>
<li>generate documentation</li>
<li>SQL, yaml</li>
</ul>
<p>
A dbt model is basically a .sql file with a SELECT statement.
</p>
</div>
</div>
