BI.md


<a id="org02ef843"></a>

## update 2.0.2

<https://airflow.apache.org/docs/apache-airflow/stable/upgrading-to-2.html>
3.6+ not 3.9

1.  airflow initdb -> airflow db init
2.

[webserver] rbac = True

1.  airflow users create \\
    &#x2013;role Admin \\
    &#x2013;username admin \\
    &#x2013;firstname FIRST<sub>NAME</sub> \\
    &#x2013;lastname LAST<sub>NAME</sub> \\
    &#x2013;email EMAIL@example.org
2.  add "airflow db init" to airflow.sh
3.  run once
4.  remove "airflow db init" from airflow.sh


<a id="orga718ffa"></a>

## create connection

   from airflow.models import Connection
from airflow import settings

def create<sub>conn</sub>(username, password, host=None):
    new<sub>conn</sub> = Connection(conn<sub>id</sub>=f'{username}<sub>connection</sub>',
                                  login=username,
                                  host=host if host else None)
    new<sub>conn.set</sub><sub>password</sub>(password)

session = settings.Session()
session.add(new<sub>conn</sub>)
session.commit()


<a id="org9bf050a"></a>

## create user

docker exec -it airflow<sub>engine</sub> bash -c 'airflow user create &#x2013;role Admin &#x2013;username admin &#x2013;firstname V
&#x2013;lastname C &#x2013;email cv@r.ru'


<a id="orgcac9a08"></a>

## restart

docker-compose down && docker-compose up -d


<a id="org725b365"></a>

## problems

-   execution<sub>timeout</sub> is not working
-   Own Operators require hard testing
-   all Python dependencies from each workflow need to be installed on each Airflow Worker


<a id="org71da0a1"></a>

## how to change config:

-   connect to running airflow<sub>engine</sub> and cat airflow.cfg
-   change config


<a id="orgf3c97e7"></a>

## rest API

-   authentication <https://airflow.apache.org/docs/apache-airflow/stable/security/api.html>
-   <https://airflow.apache.org/docs/apache-airflow/stable/stable-rest-api-ref.html>
-   <https://airflow.apache.org/docs/apache-airflow/1.10.2/api.html>

    [api]
    auth_backends = airflow.api.auth.backend.basic_auth

check:

    $ airflow config get-value api auth_backends
    airflow.api.auth.backend.basic_auth

Необходимо подождать некоторое время, авторизация возможно не сразу включается.

    ENDPOINT_URL="http://localhost:8080/"
    curl -X GET --insecure --user "username:password" \
        "${ENDPOINT_URL}/api/v1/pools"


<a id="org32d8393"></a>

## logs

logging.Logger - 4 loggers by default:

-   root
-   flask<sub>appbuilder</sub>
-   airflow.processor
-   airflow.task

logging.Formatter

-   airflow<sub>colored</sub>
-   airflow

locations:

-   Scheduler logs: /usr/local/airflow/logs/scheduler
-   Webserver logs appear in the console by default: docker logs <webserver<sub>container</sub><sub>id</sub>>
-   Metadata database logs: docker logs <postgres<sub>container</sub><sub>id</sub>>
-   docker logs <triggerer<sub>container</sub><sub>id</sub>>
-   Task logs are in *usr/local/airflow/logs*

links:

-   <https://www.astronomer.io/guides/logging/>
-   <https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-architecture.html>
-   <https://airflow.apache.org/docs/apache-airflow/stable/logging-monitoring/logging-tasks.html#serving-logs-from-workers>


<a id="org8a1f449"></a>

## Database of Airflow

recent runs

    SELECT
        dag_run.dag_id,
        dag_run.state
    FROM dag_run
    INNER JOIN (SELECT
                    dag_id,
                    MAX(execution_date) AS date
                FROM dag_run
                GROUP BY dag_id) mx
        ON
        dag_run.dag_id = mx.dag_id
        AND dag_run.execution_date = mx.date
    JOIN dag ON dag.dag_id = dag_run.dag_id AND is_active = 1 AND is_paused = 0


<a id="orgdd58e7d"></a>

# TODO dbt - ETL

-   writing test
-   generate documentation
-   SQL, yaml

A dbt model is basically a .sql file with a SELECT statement.
