BI.org
* Data Lake (Озеро данных)
это система или репозиторий данных , хранящихся в естественном / необработанном формате

A болото данных - это испорченное и неуправляемое озеро данных, которое либо недоступно для предполагаемых пользователей, либо представляет небольшую ценность. Википедия  site:wikichi.ru

Джеймс Диксон Pentaho, придумал этот термин, чтобы противопоставить его витрине данных , который
представляет собой небольшое хранилище интересных атрибутов

использование
- Озеро данных было помечено как резервуар необработанных данных или хаб для разгрузки ETL
- Озеро данных было определено как центральный узел для самообслуживания.

может включать
- структурированные данные из реляционных баз данных (строки и столбцы)
- полуструктурированные данные (CSV , журналы, XML , JSON )
- неструктурированные данные (электронные письма, документы, PDF-файлы)
- двоичные данные (изображения, аудио , видео)

terms
- источники — sources;
- настройки каналов — pipelines;
- регулярность обновлений — schedulers;
- владельцы — custodians;
- время хранения — retention time;
- метаданные — другие «данные о данных».

хранилища данных (HDFS, EDW, IMDG, Cloud и т.д.)
- Google Cloud Storage и Amazon S3
- распределенную файловую систему, такую ​​как Apache Хадуп

** критика
Мы видим, как заказчики создают кладбища больших данных, сбрасывают все в распределенную файловую
систему Hadoop (HDFS) и надеются что-то с этим сделать в будущем. Но затем они просто теряют из виду
то, что там есть
* Управленческий учет
- https://en.wikipedia.org/wiki/Management_accounting
areas:
- Strategic management
- Performance management
- Risk management
* TODO Юнит-экономика (unit-экономика, unit economics)
метод экономического моделирования, который помогает определить прибыльность бизнеса через расчет прибыльности
бизнес-юнита (единицы товара или одного клиента). Эффективен для digital-проектов.

позволяет увидеть, сколько вы зарабатываете с потока клиентов — поток состоит из юнитов


** Зачем считать юнит-экономику
- Определить эффективность основных каналов продаж.
- Оценить перспективы компании, понять, куда она движется.
- Чтобы определить прибыльность бизнеса на этапе идеи.
- Найти точку безубыточности и просчитать доходность инвестиций.
- Понять, сколько нужно привлечь клиентов; узнать, сколько будет стоить каждый из них.
- Объективно рассказать инвесторам о перспективах бизнеса.

С помощью юнит-экономики вы можете рассчитать, сколько единиц товара нужно продать, чтобы покрыть постоянные затраты.
** Когда
- Вы хотите привлечь инвесторов.
- Вы планируете масштабировать бизнес.
- Вы запускаете стартап.
- Основные затраты на привлечение клиента и совершение сделки — продвижение и реклама.
** Как
Юнит-экономика основана на принципах управленческого учета и микроэкономики

формула прибыли:
- Прибыль = Маржинальная прибыль - Постоянные затраты
- Маржинальная прибыль = Выручка - Переменные затраты
- Прибыль = Выручка - Переменные затраты - Постоянные

Если маржинальная прибыль выше постоянных затрат, бизнес успешен

совокупная маржинальная прибыль определяется как общее число проданных товаров, умноженное на их цену за вычетом себестоимости.

прибыль или убыток с одной единицы товара
- Цена продажи - Расходы = Прибыль (Убыток)

расчета точки безубыточности используется
- Постоянные затраты / Прибыль с 1 продажи = Необходимое

COGS (Cost of Good Sold) - Затраты на каждую продажу, ее себестоимость. Это переменные затраты, которые
увеличиваются пропорционально объемам продаж. Например, сюда относится доставка.

1sCOGS (First sale COGS) - Дополнительные расходы, которые приходится нести, чтобы совершить первую продажу.


** Когортный анализ
инструмент аналитики, при котором пользователи рассматриваются в группах, связанных по определенному признаку.


** links
- https://www.uplab.ru/blog/unit-economics-how-to-evaluate-the-success-of-the-business/
