BI.html
<div id="outline-container-org9fc2854" class="outline-2">
<h2 id="org9fc2854"><span class="section-number-2">25</span> Data Lake (Озеро данных)</h2>
<div class="outline-text-2" id="text-25">
<p>
это система или репозиторий данных , хранящихся в естественном / необработанном формате
</p>

<p>
A болото данных - это испорченное и неуправляемое озеро данных, которое либо недоступно для предполагаемых пользователей, либо представляет небольшую ценность. Википедия  site:wikichi.ru
</p>

<p>
Джеймс Диксон Pentaho, придумал этот термин, чтобы противопоставить его витрине данных , который
представляет собой небольшое хранилище интересных атрибутов
</p>

<p>
использование
</p>
<ul class="org-ul">
<li>Озеро данных было помечено как резервуар необработанных данных или хаб для разгрузки ETL</li>
<li>Озеро данных было определено как центральный узел для самообслуживания.</li>
</ul>

<p>
может включать
</p>
<ul class="org-ul">
<li>структурированные данные из реляционных баз данных (строки и столбцы)</li>
<li>полуструктурированные данные (CSV , журналы, XML , JSON )</li>
<li>неструктурированные данные (электронные письма, документы, PDF-файлы)</li>
<li>двоичные данные (изображения, аудио , видео)</li>
</ul>

<p>
terms
</p>
<ul class="org-ul">
<li>источники — sources;</li>
<li>настройки каналов — pipelines;</li>
<li>регулярность обновлений — schedulers;</li>
<li>владельцы — custodians;</li>
<li>время хранения — retention time;</li>
<li>метаданные — другие «данные о данных».</li>
</ul>

<p>
хранилища данных (HDFS, EDW, IMDG, Cloud и т.д.)
</p>
<ul class="org-ul">
<li>Google Cloud Storage и Amazon S3</li>
<li>распределенную файловую систему, такую ​​как Apache Хадуп</li>
</ul>
</div>

<div id="outline-container-org0a220a3" class="outline-3">
<h3 id="org0a220a3"><span class="section-number-3">25.1</span> критика</h3>
<div class="outline-text-3" id="text-25-1">
<p>
Мы видим, как заказчики создают кладбища больших данных, сбрасывают все в распределенную файловую
систему Hadoop (HDFS) и надеются что-то с этим сделать в будущем. Но затем они просто теряют из виду
то, что там есть
</p>
</div>
</div>
</div>
<div id="outline-container-orga1e8f35" class="outline-2">
<h2 id="orga1e8f35"><span class="section-number-2">26</span> Управленческий учет</h2>
<div class="outline-text-2" id="text-26">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Management_accounting">https://en.wikipedia.org/wiki/Management_accounting</a></li>
</ul>
<p>
areas:
</p>
<ul class="org-ul">
<li>Strategic management</li>
<li>Performance management</li>
<li>Risk management</li>
</ul>
</div>
</div>
<div id="outline-container-org4fa38cd" class="outline-2">
<h2 id="org4fa38cd"><span class="section-number-2">27</span> <span class="todo TODO">TODO</span> Юнит-экономика (unit-экономика, unit economics)</h2>
<div class="outline-text-2" id="text-27">
<p>
метод экономического моделирования, который помогает определить прибыльность бизнеса через расчет прибыльности
бизнес-юнита (единицы товара или одного клиента). Эффективен для digital-проектов.
</p>

<p>
позволяет увидеть, сколько вы зарабатываете с потока клиентов — поток состоит из юнитов
</p>
</div>


<div id="outline-container-orgbff0a09" class="outline-3">
<h3 id="orgbff0a09"><span class="section-number-3">27.1</span> Зачем считать юнит-экономику</h3>
<div class="outline-text-3" id="text-27-1">
<ul class="org-ul">
<li>Определить эффективность основных каналов продаж.</li>
<li>Оценить перспективы компании, понять, куда она движется.</li>
<li>Чтобы определить прибыльность бизнеса на этапе идеи.</li>
<li>Найти точку безубыточности и просчитать доходность инвестиций.</li>
<li>Понять, сколько нужно привлечь клиентов; узнать, сколько будет стоить каждый из них.</li>
<li>Объективно рассказать инвесторам о перспективах бизнеса.</li>
</ul>

<p>
С помощью юнит-экономики вы можете рассчитать, сколько единиц товара нужно продать, чтобы покрыть постоянные затраты.
</p>
</div>
</div>
<div id="outline-container-org3dbfbf4" class="outline-3">
<h3 id="org3dbfbf4"><span class="section-number-3">27.2</span> Когда</h3>
<div class="outline-text-3" id="text-27-2">
<ul class="org-ul">
<li>Вы хотите привлечь инвесторов.</li>
<li>Вы планируете масштабировать бизнес.</li>
<li>Вы запускаете стартап.</li>
<li>Основные затраты на привлечение клиента и совершение сделки — продвижение и реклама.</li>
</ul>
</div>
</div>
<div id="outline-container-org8b73c86" class="outline-3">
<h3 id="org8b73c86"><span class="section-number-3">27.3</span> Как</h3>
<div class="outline-text-3" id="text-27-3">
<p>
Юнит-экономика основана на принципах управленческого учета и микроэкономики
</p>

<p>
формула прибыли:
</p>
<ul class="org-ul">
<li>Прибыль = Маржинальная прибыль - Постоянные затраты</li>
<li>Маржинальная прибыль = Выручка - Переменные затраты</li>
<li>Прибыль = Выручка - Переменные затраты - Постоянные</li>
</ul>

<p>
Если маржинальная прибыль выше постоянных затрат, бизнес успешен
</p>

<p>
совокупная маржинальная прибыль определяется как общее число проданных товаров, умноженное на их цену за вычетом себестоимости.
</p>

<p>
прибыль или убыток с одной единицы товара
</p>
<ul class="org-ul">
<li>Цена продажи - Расходы = Прибыль (Убыток)</li>
</ul>

<p>
расчета точки безубыточности используется
</p>
<ul class="org-ul">
<li>Постоянные затраты / Прибыль с 1 продажи = Необходимое</li>
</ul>

<p>
COGS (Cost of Good Sold) - Затраты на каждую продажу, ее себестоимость. Это переменные затраты, которые
увеличиваются пропорционально объемам продаж. Например, сюда относится доставка.
</p>

<p>
1sCOGS (First sale COGS) - Дополнительные расходы, которые приходится нести, чтобы совершить первую продажу.
</p>
</div>
</div>


<div id="outline-container-org9474713" class="outline-3">
<h3 id="org9474713"><span class="section-number-3">27.4</span> Когортный анализ</h3>
<div class="outline-text-3" id="text-27-4">
<p>
инструмент аналитики, при котором пользователи рассматриваются в группах, связанных по определенному признаку.
</p>
</div>
</div>


<div id="outline-container-org10fc4d8" class="outline-3">
<h3 id="org10fc4d8"><span class="section-number-3">27.5</span> links</h3>
<div class="outline-text-3" id="text-27-5">
<ul class="org-ul">
<li><a href="https://www.uplab.ru/blog/unit-economics-how-to-evaluate-the-success-of-the-business/">https://www.uplab.ru/blog/unit-economics-how-to-evaluate-the-success-of-the-business/</a></li>
</ul>
</div>
</div>
</div>
