BI.org
* mail

Data warehouse:

- Greenplum BD

designed to manage large-scale analytic data warehouses and business intelligence workloads.
- на основе PostgreSQL - лучше MySQL
- massively parallel processing (MPP)
- PostgreSQL interface
- performs best with a denormalized schema design
- Greenplum provides both row-oriented and *column-oriented* table types
- logically partition table data, either by range or by a list of values - each partition of a single table
  can utilize its own storage method (row vs. column orientation)

- MariaBD

for a wide variety of use cases as replacement for MySQL
- single server or multi-server
- columnar storage optimized for interactive
- ad hoc analytics
- scaling out as needed

Bad:  Vertica CE (limited to 1TB of data and 3 database nodes), Clickhouse (сырая, недокум-ные Upd/Del),

Report system:

- Power BI Desktop

один из лучших, отчет сохраняется в виде файла и открывается в том виде как был создан.
-cons:
- Windows на одном рабочем месте, нужно предварительно установить и проверить соединение с базой

- Metabase

можно развернуть в докере и дать доступ через веб.
- cons: мало инструментов и нет Slicer

- Microstrategy Desktop Free - аналог Power BI, требует изучение

- Saiku Analytics - нужно присмотреться, есть ограничения https://www.meteorite.bi/saiku-product-comparison


Bad: Apahce SuperSet (нельзя изменить названия полей),
Pentaho BI Suite (много ограничений по функционалу, поменялась компания 2017. 2017 stable),
Vertica CE (limited to 1TB of data and 3 database nodes),
Exasol CE(Can store up to 200 GB or raw data, single machine)

* Congos
IBM® Cognos Business Intelligence - комплект программ для бизнес-аналитики
IBM Cognos Analytics - инструмент бизнес-аналитики
IBM Cognos
