BI.html
<div id="outline-container-org0a1213c" class="outline-2">
<h2 id="org0a1213c"><span class="section-number-2">28</span> mail</h2>
<div class="outline-text-2" id="text-28">
<p>
Data warehouse:
</p>

<ul class="org-ul">
<li>Greenplum BD</li>
</ul>

<p>
designed to manage large-scale analytic data warehouses and business intelligence workloads.
</p>
<ul class="org-ul">
<li>на основе PostgreSQL - лучше MySQL</li>
<li>massively parallel processing (MPP)</li>
<li>PostgreSQL interface</li>
<li>performs best with a denormalized schema design</li>
<li>Greenplum provides both row-oriented and <b>column-oriented</b> table types</li>
<li>logically partition table data, either by range or by a list of values - each partition of a single table
can utilize its own storage method (row vs. column orientation)</li>

<li>MariaBD</li>
</ul>

<p>
for a wide variety of use cases as replacement for MySQL
</p>
<ul class="org-ul">
<li>single server or multi-server</li>
<li>columnar storage optimized for interactive</li>
<li>ad hoc analytics</li>
<li>scaling out as needed</li>
</ul>

<p>
Bad:  Vertica CE (limited to 1TB of data and 3 database nodes), Clickhouse (сырая, недокум-ные Upd/Del),
</p>

<p>
Report system:
</p>

<ul class="org-ul">
<li>Power BI Desktop</li>
</ul>

<p>
один из лучших, отчет сохраняется в виде файла и открывается в том виде как был создан.
-cons:
</p>
<ul class="org-ul">
<li>Windows на одном рабочем месте, нужно предварительно установить и проверить соединение с базой</li>

<li>Metabase</li>
</ul>

<p>
можно развернуть в докере и дать доступ через веб.
</p>
<ul class="org-ul">
<li>cons: мало инструментов и нет Slicer</li>

<li>Microstrategy Desktop Free - аналог Power BI, требует изучение</li>

<li>Saiku Analytics - нужно присмотреться, есть ограничения <a href="https://www.meteorite.bi/saiku-product-comparison">https://www.meteorite.bi/saiku-product-comparison</a></li>
</ul>


<p>
Bad: Apahce SuperSet (нельзя изменить названия полей),
Pentaho BI Suite (много ограничений по функционалу, поменялась компания 2017. 2017 stable),
Vertica CE (limited to 1TB of data and 3 database nodes),
Exasol CE(Can store up to 200 GB or raw data, single machine)
</p>
</div>
</div>

<div id="outline-container-org0cb0390" class="outline-2">
<h2 id="org0cb0390"><span class="section-number-2">29</span> Congos</h2>
<div class="outline-text-2" id="text-29">
<p>
IBM® Cognos Business Intelligence - комплект программ для бизнес-аналитики
IBM Cognos Analytics - инструмент бизнес-аналитики
IBM Cognos
</p>
</div>
</div>
