BI.org
* цфт разаботка
- EXEC ibs.EXECUTOR.SET_CONTEXT('DATE_SLEPOK_BEGIN', to_char(trunc(sysdate),'dd/mm/yyyy'));
- EXEC ibs.EXECUTOR.SET_CONTEXT('DATE_SLEPOK_BEGIN', '01/01/2019');
- EXEC ibs.EXECUTOR.SET_CONTEXT('DATE_SLEPOK_END', '03/07/2019');
- SELECT SYS_CONTEXT('IBS_USER','DATE_SLEPOK_BEGIN') FROM DUAL;
#+BEGIN_SRC sql
begin
ibs.EXECUTOR.SET_CONTEXT('DATE_SLEPOK_BEGIN', to_char(trunc(sysdate),'dd/mm/yyyy'));
END;

begin
ibs.EXECUTOR.SET_CONTEXT('DATE_SLEPOK_END', to_char(trunc(sysdate),'dd/mm/yyyy'));
END;

SELECT * FROM VW_RPT_RNB_UU_ACF_BAL_OB;

#+END_SRC

#+BEGIN_SRC sql

SELECT
-- ID -- 0 NUMBER
CLI_ID, -- NUMBER Номер клиента
CLI_INN, -- VARCHAR2(12) ИНН
BS1, -- VARCHAR2(12) БС1
BS2, -- VARCHAR2(5) БС2
BSS, -- VARCHAR2(10) БСС
ACC, -- VARCHAR2(25) ЛС
ACC_FIL, -- VARCHAR2(26) ЛСФ
ACC_NAME, -- VARCHAR2(160) НаименованиеСчета
CLI_NAME, -- VARCHAR2(160) НаименованиеКлиента
CLI_CLASS, -- VARCHAR2(128) ТипКлиента
CUR, -- VARCHAR2(3) ВалютаСчета
VAL, -- VARCHAR2(3) Валюта
FILIAL, -- VARCHAR2(3) Филиал
DEPART, -- VARCHAR2(20) Отделение
MARKET, -- VARCHAR2(300) Рынок
BLOCK, -- VARCHAR2(300) Бизнес блок
-- SEC_UL VARCHAR2(300) СегментЮЛ -
-- SEC_FL VARCHAR2(300) СегментФЛ -
ACC_OTV, -- VARCHAR2(100) Менеджер
ATTR, -- VARCHAR2(300) АктивПассив
ZNAK, -- VARCHAR2(300) ЗНАК
NAME_CB, -- VARCHAR2(300) НаименованиеЦБ
KOD_PROC, -- VARCHAR2(300) КОД_ПРОЦ
SROK1, -- VARCHAR2(300) Срочность1
SROK2, -- VARCHAR2(300) Срочность1
SROK3, -- VARCHAR2(300) Срочность1
REZIDENT, -- VARCHAR2(300) Резидентность
VID_SOBSTV, -- VARCHAR2(300) ВидСобственности
ACC_AMORT, -- VARCHAR2(300) СчетаАмортизации
ACC_RESERV, -- VARCHAR2(300) СчетаРезервов
ACC_REVAL, -- VARCHAR2(300) СчетаПереоценки
RAZDEL, -- VARCHAR2(300) РАЗДЕЛ
SUBRAZD, -- VARCHAR2(300) ПОДРАЗДЕЛ
ARTICLE, -- VARCHAR2(300) СТАТЬЯ
SUBENTRY, -- VARCHAR2(300) ПОДСТАТЬЯ
GRUPPA, -- VARCHAR2(300) ГРУППА
-- SUBGRUP, -- VARCHAR2(300)
PRODUCT, -- VARCHAR2(300) Продукт
VID_PROD, -- ТиповойДоговор VARCHAR2(300),  -- (text) Null, - 12312
NUM_DOG, -- VARCHAR2 НомерДоговора
DATE_BEG, -- DATE Дата_Н
DATE_END, -- DATE Дата_О
SM_NT_BEG, -- NUMBER 01/01/2019
OB_NT_DEB, -- NUMBER ОБОРОТ_Дб_РУБ
OB_NT_CRED, -- NUMBER ОБОРОТ_Кт_РУБ
SM_END, -- NUMBER ИСХОД_ВАЛ
SM_NT_END -- NUMBER ИСХОД_РУБ
-- DELTA NUMBER
FROM VW_RPT_RNB_UU_ACF_BAL_OB;


#+END_SRC

q
#+BEGIN_SRC sql
SELECT
-- ID -- 0 NUMBER
CLI_ID as НомерКлиента, -- NUMBER
CLI_INN as ИНН, -- VARCHAR2(12)
BS1 as БС1, -- VARCHAR2(12)
BS2 as БС2, -- VARCHAR2(5)
BSS as БСС, -- VARCHAR2(10)
ACC as ЛС, -- VARCHAR2(25)
ACC_FIL as ЛСФ, -- VARCHAR2(26)
ACC_NAME as НаименованиеСчета, -- VARCHAR2(160)
CLI_NAME as НаименованиеКлиента, -- VARCHAR2(160)
CLI_CLASS as ТипКлиента, -- VARCHAR2(128)
CUR as ВалютаСчета, -- VARCHAR2(3)
VAL as Валюта, -- VARCHAR2(3)
FILIAL as Филиал, -- VARCHAR2(3)
DEPART as Отделение, -- VARCHAR2(20)
MARKET as Рынок, -- VARCHAR2(300)
BLOCK as БизнесБлок, -- VARCHAR2(300)
-- SEC_UL VARCHAR2(300) СегментЮЛ -
-- SEC_FL VARCHAR2(300) СегментФЛ -
ACC_OTV as Менеджер,  -- VARCHAR2(100)
ATTR as АктивПассив, -- VARCHAR2(300)
ZNAK as ЗНАК, -- VARCHAR2(300)
NAME_CB as НаименованиеЦБ, -- VARCHAR2(300)
KOD_PROC as КОД_ПРОЦ, -- VARCHAR2(300)
SROK1 as Срочность1, -- VARCHAR2(300)
SROK2 as Срочность2, -- VARCHAR2(300)
SROK3 as Срочность3, -- VARCHAR2(300)
REZIDENT as Резидентность, -- VARCHAR2(300)
VID_SOBSTV as ВидСобственности, -- VARCHAR2(300)
ACC_AMORT as СчетаАмортизации, -- VARCHAR2(300)
ACC_RESERV as СчетаРезервов, -- VARCHAR2(300)
ACC_REVAL as СчетаПереоценки, -- VARCHAR2(300)
RAZDEL as РАЗДЕЛ, -- VARCHAR2(300)
SUBRAZD as ПОДРАЗДЕЛ, -- VARCHAR2(300)
ARTICLE as СТАТЬЯ, -- VARCHAR2(300)
SUBENTRY as ПОДСТАТЬЯ, -- VARCHAR2(300)
GRUPPA as ГРУППА, -- VARCHAR2(300)
-- SUBGRUP, -- VARCHAR2(300)
PRODUCT as Продукт, -- VARCHAR2(300)
VID_PROD as ТиповойДоговор, -- VARCHAR2(300),  -- (text) Null, - 12312
NUM_DOG as НомерДоговора, -- VARCHAR2
DATE_BEG as Дата_Н, -- DATE
DATE_END as Дата_О, -- DATE
SM_NT_BEG as 01/01/2019, -- NUMBER
OB_NT_DEB as ОБОРОТ_Дб_РУБ, -- NUMBER
OB_NT_CRED as ОБОРОТ_Кт_РУБ, -- NUMBER
SM_END as ИСХОД_ВАЛ, -- NUMBER
SM_NT_END as ИСХОД_РУБ -- NUMBER
-- DELTA NUMBER
FROM VW_RPT_RNB_UU_ACF_BAL_OB;
#+END_SRC

green create
#+BEGIN_SRC sql
-- CREATE TABLE c(a int PRIMARY KEY, b text)  DISTRIBUTED BY(a);
CREATE TABLE test (
Дата date,
НомерКлиента bigint, -- NUMBER
ИНН varchar(12), -- VARCHAR2(12)
БС1 varchar(12), -- VARCHAR2(12)
БС2 varchar(5), -- VARCHAR2(5)
БСС varchar(10), -- VARCHAR2(10)
ЛС varchar(12), -- VARCHAR2(25)
ЛСФ varchar(26), -- VARCHAR2(26)
НаименованиеСчета varchar(160), -- VARCHAR2(160)
НаименованиеКлиента varchar(160), -- VARCHAR2(160)
ТипКлиента varchar(128), -- VARCHAR2(128)
ВалютаСчета varchar(3), -- VARCHAR2(3)
Валюта varchar(3), -- VARCHAR2(3)
Филиал varchar(3), -- VARCHAR2(3)
Отделение varchar(20), -- VARCHAR2(20)
Рынок varchar(300), -- VARCHAR2(300)
БизнесБлок varchar(300), -- VARCHAR2(300)
-- SEC_UL VARCHAR2(300) СегментЮЛ -
-- SEC_FL VARCHAR2(300) СегментФЛ -
Менеджер varchar(100),  -- VARCHAR2(100)
АктивПассив varchar(300), -- VARCHAR2(300)
ЗНАК varchar(300), -- VARCHAR2(300)
НаименованиеЦБ varchar(300), -- VARCHAR2(300)
КОД_ПРОЦ varchar(300), -- VARCHAR2(300)
Срочность1 varchar(300), -- VARCHAR2(300)
Срочность2 varchar(300), -- VARCHAR2(300)
Срочность3 varchar(300), -- VARCHAR2(300)
Резидентность varchar(300), -- VARCHAR2(300)
ВидСобственности varchar(300), -- VARCHAR2(300)
СчетаАмортизации varchar(300), -- VARCHAR2(300)
СчетаРезервов varchar(300), -- VARCHAR2(300)
СчетаПереоценки varchar(300), -- VARCHAR2(300)
РАЗДЕЛ varchar(300), -- VARCHAR2(300)
ПОДРАЗДЕЛ varchar(300), -- VARCHAR2(300)
СТАТЬЯ varchar(300), -- VARCHAR2(300)
ПОДСТАТЬЯ varchar(300), -- VARCHAR2(300)
ГРУППА varchar(300), -- VARCHAR2(300)
-- SUBGRUP, -- VARCHAR2(300)
Продукт varchar(300), -- VARCHAR2(300)
ТиповойДоговор varchar(300), -- VARCHAR2(300),  -- (text) Null, - 12312
НомерДоговора varchar, -- VARCHAR2
Дата_Н date, -- DATE
Дата_О date, -- DATE
main money, -- NUMBER
ОБОРОТ_Дб_РУБ money, -- NUMBER
ОБОРОТ_Кт_РУБ money, -- NUMBER
ИСХОД_ВАЛ money, -- NUMBER
ИСХОД_РУБ money -- NUMBER
)
WITH (appendonly=true, orientation=column) DISTRIBUTED BY(a)
#+END_SRC
