BI.html
<div id="outline-container-org042ebc1" class="outline-2">
<h2 id="org042ebc1"><span class="section-number-2">30</span> цфт разаботка</h2>
<div class="outline-text-2" id="text-30">
<ul class="org-ul">
<li>EXEC ibs.EXECUTOR.SET<sub>CONTEXT</sub>('DATE<sub>SLEPOK</sub><sub>BEGIN</sub>', to<sub>char</sub>(trunc(sysdate),'dd/mm/yyyy'));</li>
<li>EXEC ibs.EXECUTOR.SET<sub>CONTEXT</sub>('DATE<sub>SLEPOK</sub><sub>BEGIN</sub>', '01/01/2019');</li>
<li>EXEC ibs.EXECUTOR.SET<sub>CONTEXT</sub>('DATE<sub>SLEPOK</sub><sub>END</sub>', '03/07/2019');</li>
<li>SELECT SYS<sub>CONTEXT</sub>('IBS<sub>USER</sub>','DATE<sub>SLEPOK</sub><sub>BEGIN</sub>') FROM DUAL;</li>
</ul>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #8ac6f2; font-weight: bold;">begin</span>
ibs.EXECUTOR.SET_CONTEXT(<span style="color: #95e454;">'DATE_SLEPOK_BEGIN'</span>, to_char(trunc(sysdate),<span style="color: #95e454;">'dd/mm/yyyy'</span>));
<span style="color: #8ac6f2; font-weight: bold;">END</span>;

<span style="color: #8ac6f2; font-weight: bold;">begin</span>
ibs.EXECUTOR.SET_CONTEXT(<span style="color: #95e454;">'DATE_SLEPOK_END'</span>, to_char(trunc(sysdate),<span style="color: #95e454;">'dd/mm/yyyy'</span>));
<span style="color: #8ac6f2; font-weight: bold;">END</span>;

<span style="color: #8ac6f2; font-weight: bold;">SELECT</span> * <span style="color: #8ac6f2; font-weight: bold;">FROM</span> VW_RPT_RNB_UU_ACF_BAL_OB;

</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql">
<span style="color: #8ac6f2; font-weight: bold;">SELECT</span>
<span style="color: #99968b; font-style: italic;">-- ID -- 0 NUMBER</span>
CLI_ID, <span style="color: #99968b; font-style: italic;">-- NUMBER &#1053;&#1086;&#1084;&#1077;&#1088; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;</span>
CLI_INN, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(12) &#1048;&#1053;&#1053;</span>
BS1, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(12) &#1041;&#1057;1</span>
BS2, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(5) &#1041;&#1057;2</span>
BSS, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(10) &#1041;&#1057;&#1057;</span>
ACC, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(25) &#1051;&#1057;</span>
ACC_FIL, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(26) &#1051;&#1057;&#1060;</span>
ACC_NAME, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(160) &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1057;&#1095;&#1077;&#1090;&#1072;</span>
CLI_NAME, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(160) &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;</span>
CLI_CLASS, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(128) &#1058;&#1080;&#1087;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;</span>
CUR, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3) &#1042;&#1072;&#1083;&#1102;&#1090;&#1072;&#1057;&#1095;&#1077;&#1090;&#1072;</span>
VAL, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3) &#1042;&#1072;&#1083;&#1102;&#1090;&#1072;</span>
FILIAL, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3) &#1060;&#1080;&#1083;&#1080;&#1072;&#1083;</span>
DEPART, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(20) &#1054;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</span>
MARKET, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1056;&#1099;&#1085;&#1086;&#1082;</span>
BLOCK, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1041;&#1080;&#1079;&#1085;&#1077;&#1089; &#1073;&#1083;&#1086;&#1082;</span>
<span style="color: #99968b; font-style: italic;">-- SEC_UL VARCHAR2(300) &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1070;&#1051; -</span>
<span style="color: #99968b; font-style: italic;">-- SEC_FL VARCHAR2(300) &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1060;&#1051; -</span>
ACC_OTV, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(100) &#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;</span>
ATTR, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1040;&#1082;&#1090;&#1080;&#1074;&#1055;&#1072;&#1089;&#1089;&#1080;&#1074;</span>
ZNAK, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1047;&#1053;&#1040;&#1050;</span>
NAME_CB, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1062;&#1041;</span>
KOD_PROC, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1050;&#1054;&#1044;_&#1055;&#1056;&#1054;&#1062;</span>
SROK1, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;1</span>
SROK2, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;1</span>
SROK3, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;1</span>
REZIDENT, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1056;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;</span>
VID_SOBSTV, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1042;&#1080;&#1076;&#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;</span>
ACC_AMORT, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1095;&#1077;&#1090;&#1072;&#1040;&#1084;&#1086;&#1088;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;</span>
ACC_RESERV, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1095;&#1077;&#1090;&#1072;&#1056;&#1077;&#1079;&#1077;&#1088;&#1074;&#1086;&#1074;</span>
ACC_REVAL, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1095;&#1077;&#1090;&#1072;&#1055;&#1077;&#1088;&#1077;&#1086;&#1094;&#1077;&#1085;&#1082;&#1080;</span>
RAZDEL, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1056;&#1040;&#1047;&#1044;&#1045;&#1051;</span>
SUBRAZD, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1055;&#1054;&#1044;&#1056;&#1040;&#1047;&#1044;&#1045;&#1051;</span>
ARTICLE, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1057;&#1058;&#1040;&#1058;&#1068;&#1071;</span>
SUBENTRY, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1055;&#1054;&#1044;&#1057;&#1058;&#1040;&#1058;&#1068;&#1071;</span>
GRUPPA, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1043;&#1056;&#1059;&#1055;&#1055;&#1040;</span>
<span style="color: #99968b; font-style: italic;">-- SUBGRUP, -- VARCHAR2(300)</span>
PRODUCT, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300) &#1055;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;</span>
VID_PROD, <span style="color: #99968b; font-style: italic;">-- &#1058;&#1080;&#1087;&#1086;&#1074;&#1086;&#1081;&#1044;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088; VARCHAR2(300),  -- (text) Null, - 12312</span>
NUM_DOG, <span style="color: #99968b; font-style: italic;">-- VARCHAR2 &#1053;&#1086;&#1084;&#1077;&#1088;&#1044;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;</span>
DATE_BEG, <span style="color: #99968b; font-style: italic;">-- DATE &#1044;&#1072;&#1090;&#1072;_&#1053;</span>
DATE_END, <span style="color: #99968b; font-style: italic;">-- DATE &#1044;&#1072;&#1090;&#1072;_&#1054;</span>
SM_NT_BEG, <span style="color: #99968b; font-style: italic;">-- NUMBER 01/01/2019</span>
OB_NT_DEB, <span style="color: #99968b; font-style: italic;">-- NUMBER &#1054;&#1041;&#1054;&#1056;&#1054;&#1058;_&#1044;&#1073;_&#1056;&#1059;&#1041;</span>
OB_NT_CRED, <span style="color: #99968b; font-style: italic;">-- NUMBER &#1054;&#1041;&#1054;&#1056;&#1054;&#1058;_&#1050;&#1090;_&#1056;&#1059;&#1041;</span>
SM_END, <span style="color: #99968b; font-style: italic;">-- NUMBER &#1048;&#1057;&#1061;&#1054;&#1044;_&#1042;&#1040;&#1051;</span>
SM_NT_END <span style="color: #99968b; font-style: italic;">-- NUMBER &#1048;&#1057;&#1061;&#1054;&#1044;_&#1056;&#1059;&#1041;</span>
<span style="color: #99968b; font-style: italic;">-- DELTA NUMBER</span>
<span style="color: #8ac6f2; font-weight: bold;">FROM</span> VW_RPT_RNB_UU_ACF_BAL_OB;


</pre>
</div>

<p>
q
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #8ac6f2; font-weight: bold;">SELECT</span>
<span style="color: #99968b; font-style: italic;">-- ID -- 0 NUMBER</span>
CLI_ID <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1053;&#1086;&#1084;&#1077;&#1088;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
CLI_INN <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1048;&#1053;&#1053;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(12)</span>
BS1 <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1041;&#1057;1, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(12)</span>
BS2 <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1041;&#1057;2, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(5)</span>
BSS <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1041;&#1057;&#1057;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(10)</span>
ACC <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1051;&#1057;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(25)</span>
ACC_FIL <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1051;&#1057;&#1060;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(26)</span>
ACC_NAME <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1057;&#1095;&#1077;&#1090;&#1072;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(160)</span>
CLI_NAME <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(160)</span>
CLI_CLASS <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1058;&#1080;&#1087;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(128)</span>
CUR <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1042;&#1072;&#1083;&#1102;&#1090;&#1072;&#1057;&#1095;&#1077;&#1090;&#1072;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3)</span>
VAL <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1042;&#1072;&#1083;&#1102;&#1090;&#1072;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3)</span>
FILIAL <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1060;&#1080;&#1083;&#1080;&#1072;&#1083;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3)</span>
DEPART <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1054;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(20)</span>
MARKET <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1056;&#1099;&#1085;&#1086;&#1082;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
BLOCK <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1041;&#1080;&#1079;&#1085;&#1077;&#1089;&#1041;&#1083;&#1086;&#1082;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
<span style="color: #99968b; font-style: italic;">-- SEC_UL VARCHAR2(300) &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1070;&#1051; -</span>
<span style="color: #99968b; font-style: italic;">-- SEC_FL VARCHAR2(300) &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1060;&#1051; -</span>
ACC_OTV <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;,  <span style="color: #99968b; font-style: italic;">-- VARCHAR2(100)</span>
ATTR <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1040;&#1082;&#1090;&#1080;&#1074;&#1055;&#1072;&#1089;&#1089;&#1080;&#1074;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
ZNAK <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1047;&#1053;&#1040;&#1050;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
NAME_CB <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1062;&#1041;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
KOD_PROC <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1050;&#1054;&#1044;_&#1055;&#1056;&#1054;&#1062;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
SROK1 <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;1, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
SROK2 <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;2, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
SROK3 <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;3, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
REZIDENT <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1056;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
VID_SOBSTV <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1042;&#1080;&#1076;&#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
ACC_AMORT <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1095;&#1077;&#1090;&#1072;&#1040;&#1084;&#1086;&#1088;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
ACC_RESERV <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1095;&#1077;&#1090;&#1072;&#1056;&#1077;&#1079;&#1077;&#1088;&#1074;&#1086;&#1074;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
ACC_REVAL <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1095;&#1077;&#1090;&#1072;&#1055;&#1077;&#1088;&#1077;&#1086;&#1094;&#1077;&#1085;&#1082;&#1080;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
RAZDEL <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1056;&#1040;&#1047;&#1044;&#1045;&#1051;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
SUBRAZD <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1055;&#1054;&#1044;&#1056;&#1040;&#1047;&#1044;&#1045;&#1051;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
ARTICLE <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1057;&#1058;&#1040;&#1058;&#1068;&#1071;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
SUBENTRY <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1055;&#1054;&#1044;&#1057;&#1058;&#1040;&#1058;&#1068;&#1071;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
GRUPPA <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1043;&#1056;&#1059;&#1055;&#1055;&#1040;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
<span style="color: #99968b; font-style: italic;">-- SUBGRUP, -- VARCHAR2(300)</span>
PRODUCT <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1055;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
VID_PROD <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1058;&#1080;&#1087;&#1086;&#1074;&#1086;&#1081;&#1044;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300),  -- (text) Null, - 12312</span>
NUM_DOG <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1053;&#1086;&#1084;&#1077;&#1088;&#1044;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072;, <span style="color: #99968b; font-style: italic;">-- VARCHAR2</span>
DATE_BEG <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1044;&#1072;&#1090;&#1072;_&#1053;, <span style="color: #99968b; font-style: italic;">-- DATE</span>
DATE_END <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1044;&#1072;&#1090;&#1072;_&#1054;, <span style="color: #99968b; font-style: italic;">-- DATE</span>
SM_NT_BEG <span style="color: #8ac6f2; font-weight: bold;">as</span> 01/01/2019, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
OB_NT_DEB <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1054;&#1041;&#1054;&#1056;&#1054;&#1058;_&#1044;&#1073;_&#1056;&#1059;&#1041;, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
OB_NT_CRED <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1054;&#1041;&#1054;&#1056;&#1054;&#1058;_&#1050;&#1090;_&#1056;&#1059;&#1041;, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
SM_END <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1048;&#1057;&#1061;&#1054;&#1044;_&#1042;&#1040;&#1051;, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
SM_NT_END <span style="color: #8ac6f2; font-weight: bold;">as</span> &#1048;&#1057;&#1061;&#1054;&#1044;_&#1056;&#1059;&#1041; <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
<span style="color: #99968b; font-style: italic;">-- DELTA NUMBER</span>
<span style="color: #8ac6f2; font-weight: bold;">FROM</span> VW_RPT_RNB_UU_ACF_BAL_OB;
</pre>
</div>

<p>
green create
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #99968b; font-style: italic;">-- CREATE TABLE c(a int PRIMARY KEY, b text)  DISTRIBUTED BY(a);</span>
<span style="color: #8ac6f2; font-weight: bold;">CREATE</span> <span style="color: #8ac6f2; font-weight: bold;">TABLE</span> <span style="color: #cae682; font-size: 110%; font-weight: bold;">test</span> (
&#1044;&#1072;&#1090;&#1072; <span style="color: #92a65e; font-weight: bold;">date</span>,
&#1053;&#1086;&#1084;&#1077;&#1088;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072; bigint, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
&#1048;&#1053;&#1053; <span style="color: #92a65e; font-weight: bold;">varchar</span>(12), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(12)</span>
&#1041;&#1057;1 <span style="color: #92a65e; font-weight: bold;">varchar</span>(12), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(12)</span>
&#1041;&#1057;2 <span style="color: #92a65e; font-weight: bold;">varchar</span>(5), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(5)</span>
&#1041;&#1057;&#1057; <span style="color: #92a65e; font-weight: bold;">varchar</span>(10), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(10)</span>
&#1051;&#1057; <span style="color: #92a65e; font-weight: bold;">varchar</span>(12), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(25)</span>
&#1051;&#1057;&#1060; <span style="color: #92a65e; font-weight: bold;">varchar</span>(26), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(26)</span>
&#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1057;&#1095;&#1077;&#1090;&#1072; <span style="color: #92a65e; font-weight: bold;">varchar</span>(160), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(160)</span>
&#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072; <span style="color: #92a65e; font-weight: bold;">varchar</span>(160), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(160)</span>
&#1058;&#1080;&#1087;&#1050;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072; <span style="color: #92a65e; font-weight: bold;">varchar</span>(128), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(128)</span>
&#1042;&#1072;&#1083;&#1102;&#1090;&#1072;&#1057;&#1095;&#1077;&#1090;&#1072; <span style="color: #92a65e; font-weight: bold;">varchar</span>(3), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3)</span>
&#1042;&#1072;&#1083;&#1102;&#1090;&#1072; <span style="color: #92a65e; font-weight: bold;">varchar</span>(3), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3)</span>
&#1060;&#1080;&#1083;&#1080;&#1072;&#1083; <span style="color: #92a65e; font-weight: bold;">varchar</span>(3), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(3)</span>
&#1054;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; <span style="color: #92a65e; font-weight: bold;">varchar</span>(20), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(20)</span>
&#1056;&#1099;&#1085;&#1086;&#1082; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1041;&#1080;&#1079;&#1085;&#1077;&#1089;&#1041;&#1083;&#1086;&#1082; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
<span style="color: #99968b; font-style: italic;">-- SEC_UL VARCHAR2(300) &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1070;&#1051; -</span>
<span style="color: #99968b; font-style: italic;">-- SEC_FL VARCHAR2(300) &#1057;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1060;&#1051; -</span>
&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; <span style="color: #92a65e; font-weight: bold;">varchar</span>(100),  <span style="color: #99968b; font-style: italic;">-- VARCHAR2(100)</span>
&#1040;&#1082;&#1090;&#1080;&#1074;&#1055;&#1072;&#1089;&#1089;&#1080;&#1074; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1047;&#1053;&#1040;&#1050; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1062;&#1041; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1050;&#1054;&#1044;_&#1055;&#1056;&#1054;&#1062; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;1 <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;2 <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1088;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;3 <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1056;&#1077;&#1079;&#1080;&#1076;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1042;&#1080;&#1076;&#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1095;&#1077;&#1090;&#1072;&#1040;&#1084;&#1086;&#1088;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1095;&#1077;&#1090;&#1072;&#1056;&#1077;&#1079;&#1077;&#1088;&#1074;&#1086;&#1074; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1095;&#1077;&#1090;&#1072;&#1055;&#1077;&#1088;&#1077;&#1086;&#1094;&#1077;&#1085;&#1082;&#1080; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1056;&#1040;&#1047;&#1044;&#1045;&#1051; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1055;&#1054;&#1044;&#1056;&#1040;&#1047;&#1044;&#1045;&#1051; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1057;&#1058;&#1040;&#1058;&#1068;&#1071; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1055;&#1054;&#1044;&#1057;&#1058;&#1040;&#1058;&#1068;&#1071; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1043;&#1056;&#1059;&#1055;&#1055;&#1040; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
<span style="color: #99968b; font-style: italic;">-- SUBGRUP, -- VARCHAR2(300)</span>
&#1055;&#1088;&#1086;&#1076;&#1091;&#1082;&#1090; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300)</span>
&#1058;&#1080;&#1087;&#1086;&#1074;&#1086;&#1081;&#1044;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088; <span style="color: #92a65e; font-weight: bold;">varchar</span>(300), <span style="color: #99968b; font-style: italic;">-- VARCHAR2(300),  -- (text) Null, - 12312</span>
&#1053;&#1086;&#1084;&#1077;&#1088;&#1044;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1072; <span style="color: #92a65e; font-weight: bold;">varchar</span>, <span style="color: #99968b; font-style: italic;">-- VARCHAR2</span>
&#1044;&#1072;&#1090;&#1072;_&#1053; <span style="color: #92a65e; font-weight: bold;">date</span>, <span style="color: #99968b; font-style: italic;">-- DATE</span>
&#1044;&#1072;&#1090;&#1072;_&#1054; <span style="color: #92a65e; font-weight: bold;">date</span>, <span style="color: #99968b; font-style: italic;">-- DATE</span>
main money, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
&#1054;&#1041;&#1054;&#1056;&#1054;&#1058;_&#1044;&#1073;_&#1056;&#1059;&#1041; money, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
&#1054;&#1041;&#1054;&#1056;&#1054;&#1058;_&#1050;&#1090;_&#1056;&#1059;&#1041; money, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
&#1048;&#1057;&#1061;&#1054;&#1044;_&#1042;&#1040;&#1051; money, <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
&#1048;&#1057;&#1061;&#1054;&#1044;_&#1056;&#1059;&#1041; money <span style="color: #99968b; font-style: italic;">-- NUMBER</span>
)
<span style="color: #8ac6f2; font-weight: bold;">WITH</span> (appendonly=<span style="color: #8ac6f2; font-weight: bold;">true</span>, orientation=<span style="color: #8ac6f2; font-weight: bold;">column</span>) DISTRIBUTED <span style="color: #8ac6f2; font-weight: bold;">BY</span>(a)
</pre>
</div>
</div>
</div>
