BI.html
<div id="outline-container-org71b971b" class="outline-2">
<h2 id="org71b971b"><span class="section-number-2">31</span> Data Science</h2>
<div class="outline-text-2" id="text-31">
<p>
-<a href="https://www.kdnuggets.com/2018/06/data-science-predicting-future.html">https://www.kdnuggets.com/2018/06/data-science-predicting-future.html</a>
</p>

<p>
When and Why:
</p>
<ul class="org-ul">
<li>When: after BI reports</li>
<li>Why you need it: reports and dashboards business insights, Predictive Analytics</li>
</ul>

<p>
Fraud detection: machine learning, specifically supervised learning. When these models detect even the
slightest probability of theft, they flag the transactions, and prevent the fraud in real time.
</p>

<p>
Client retention: ‘personal touch’ - minimizing marketing costs and maximizing profits
</p>
</div>
</div>

<div id="outline-container-org1374f63" class="outline-2">
<h2 id="org1374f63"><span class="section-number-2">32</span> BI Platform video</h2>
<div class="outline-text-2" id="text-32">
<p>
У BI платформы - Когда больше 1000? пользовтелей и 1000? строк - Внезапная деградация производительности
</p>

<ol class="org-ol">
<li>Разрозненные источники</li>
<li>Информационно-аналитическая система</li>
<li>Аналитические отчеты</li>
</ol>

<p>
Самывй крутой подход:
BI Platform (ROLAM Engine) -sql&gt; DataWarehouse
</p>
<ul class="org-ul">
<li>медленно</li>
<li>низкое использование кэши</li>
</ul>

<p>
Другой подход:
До террабайта данные поднимаются в in-Memory OLAP Engine
</p>

<p>
Ентерпрайс - оба подхода - горячие данные в InMemory холодные из DataWarehouse
</p>
<ul class="org-ul">
<li>необходимо разделить данные на холодные горячие</li>
</ul>

<p>
тестирование аналитической нагрузки
TPC-H - типовые запросы
</p>

<p>
Способы оптимизации под аналитические запросы
</p>
<ul class="org-ul">
<li>колоночное хранение
<ul class="org-ul">
<li>эффективное использование кэша процессора</li>
</ul></li>
<li>сжатие в IN-NEMORY OLAP
<ul class="org-ul">
<li>LZ4</li>
<li>RLE RUN-LENGTH ENCODING - на данных с низкой кординальностью(повторяется одно и то же)
<ul class="org-ul">
<li>все данные отсортировать не возможно и не нужно</li>
</ul></li>
</ul></li>
<li>векторные инструкции процессоров</li>
<li>поздняя материализация - при выполнении SQL - поздный JOIN столбцов</li>
<li>Эвристические оптимизаци BI платформы:
<ul class="org-ul">
<li>автоматическая нормализация-денормализация таблиц</li>
<li>сортировка по календарному измерению - НЕ ИСПОЛЬЗОВАТЬ ДАТУ В ВИДЕ СТРОКИ</li>
<li>разделяемый пользовательский кэш - несолько позователей у BI</li>
<li>разделяемый кэш подзапросов</li>
<li>обратные индексы для строковых полей</li>
</ul></li>
</ul>

<p>
Как убить IN-MEMORY OLAP
</p>
<ul class="org-ul">
<li>Применять выражения, на которых плохо работает векторизация(нелинейное вырожение используещее много строк)</li>
<li>Использовать вложенные запросы с большим промежуточным результатом (заставляет ранюю материализацию)</li>
<li>часто обновлять данные, не используя специальные инструменты для Real-time(заст частую инвалидацию и низ эфф кэша)</li>
<li>оставлять маленький запас свободной RAM</li>
<li>Грузить в BI поля с высокой кардинальностью - комментарии к заказу, сообщения</li>
</ul>

<p>
Реалтайм если нужен его лучше выделить в отдельный виджет - за отдельный час там
</p>

<p>
Было бы здорово - Измерить прямую заполнения кэша у BI платформы - редка позволяют
</p>

<p>
медленно изменяющиеся измерения - один сотрудник меняет должность что-то
</p>
<ul class="org-ul">
<li>срезы - по квартально (когда меняется структура статей финансовых и локаций)</li>
<li>таблицы фактов с именениями - каждый переход сотрудника - это факт</li>
</ul>

<p>
INMEMORY better then MOLAP
</p>

<p>
BI имеющие in-memory
visiolagy
ploimatic
</p>

<p>
для мониторинга событий - SCADA - специальные системы
</p>

<p>
пределы in-memory
</p>
<ul class="org-ul">
<li>сотен тысяч записей - начинаются проблемы</li>
<li>единиц милионов - проблемы</li>
</ul>

<p>
GPU для in-memory - неочень эффекивно есть вероятность потерять быстродейтвие для ряда задач
</p>

<p>
в ClickHouse есть специализация под разные виды запросов это и дает оптимизацию
</p>
</div>
</div>
<div id="outline-container-org20f5a51" class="outline-2">
<h2 id="org20f5a51"><span class="section-number-2">33</span> Big Data</h2>
<div class="outline-text-2" id="text-33">
</div>
<div id="outline-container-org225c5f9" class="outline-3">
<h3 id="org225c5f9"><span class="section-number-3">33.1</span> кодекс этики</h3>
<div class="outline-text-3" id="text-33-1">
<p>
<a href="https://ac.gov.ru/projects/project/kodeks-etiki-ispolzovania-dannyh-5">https://ac.gov.ru/projects/project/kodeks-etiki-ispolzovania-dannyh-5</a>
</p>

<p>
«Яндекс», Mail.ru Group, Сбербанк, Газпромбанк, «МегаФон», «Ростелеком» и другие компании
</p>
</div>
</div>
<div id="outline-container-org18f8ffe" class="outline-3">
<h3 id="org18f8ffe"><span class="section-number-3">33.2</span> news</h3>
<div class="outline-text-3" id="text-33-2">
<p>
По оценке АБД, российский рынок больших данных на данный момент составляет 10–30 млрд рублей в год, а к 2024 году он достигнет 300 млрд рублей.
</p>
</div>
</div>
</div>
<div id="outline-container-org16e52f4" class="outline-2">
<h2 id="org16e52f4"><span class="section-number-2">34</span> Аналитическая платформа - система принятия решений</h2>
<div class="outline-text-2" id="text-34">
<ul class="org-ul">
<li>numerical-analysis software <a href="https://en.wikipedia.org/wiki/List_of_numerical-analysis_software">https://en.wikipedia.org/wiki/List_of_numerical-analysis_software</a></li>
<li><a href="https://en.wikipedia.org/wiki/Automated_machine_learning">https://en.wikipedia.org/wiki/Automated_machine_learning</a></li>
<li><a href="https://en.wikipedia.org/wiki/Business_intelligence">https://en.wikipedia.org/wiki/Business_intelligence</a></li>
</ul>

<p>
Aналитическая платформа Loginom
</p>
<ul class="org-ul">
<li>хранилище данных</li>
<li>стетистический анализ</li>
<li>репозиторий моделей</li>
</ul>

<p>
Weka (machine learning)
</p>
<ul class="org-ul">
<li>data mining tasks, more specifically, data preprocessing, clustering, classification, regression,
visualization, and feature selection</li>
<li>access to SQL databases using Java Database Connectivity</li>
<li>provides access to deep learning with Deeplearning4j</li>
</ul>
</div>
</div>

<div id="outline-container-orgcca645b" class="outline-2">
<h2 id="orgcca645b"><span class="section-number-2">35</span> система управления активами (ITAM)</h2>
<div class="outline-text-2" id="text-35">
<p>
ИТ-активы — это и оборудование, и лицензии на программное обеспечение.
</p>
<ul class="org-ul">
<li>собрать все сведения об ИТ-ресурсах в одном месте, установить связи между активами, услугами, договорами, задачами</li>
</ul>
</div>
</div>
