BI.md


<a id="org0d0c46e"></a>

# Data Science

-<https://www.kdnuggets.com/2018/06/data-science-predicting-future.html>

When and Why:

-   When: after BI reports
-   Why you need it: reports and dashboards business insights, Predictive Analytics

Fraud detection: machine learning, specifically supervised learning. When these models detect even the
slightest probability of theft, they flag the transactions, and prevent the fraud in real time.

Client retention: ‘personal touch’ - minimizing marketing costs and maximizing profits


<a id="org45f398e"></a>

# BI Platform video

У BI платформы - Когда больше 1000? пользовтелей и 1000? строк - Внезапная деградация производительности

1.  Разрозненные источники
2.  Информационно-аналитическая система
3.  Аналитические отчеты

Самывй крутой подход:
BI Platform (ROLAM Engine) -sql> DataWarehouse

-   медленно
-   низкое использование кэши

Другой подход:
До террабайта данные поднимаются в in-Memory OLAP Engine

Ентерпрайс - оба подхода - горячие данные в InMemory холодные из DataWarehouse

-   необходимо разделить данные на холодные горячие

тестирование аналитической нагрузки
TPC-H - типовые запросы

Способы оптимизации под аналитические запросы

-   колоночное хранение
    -   эффективное использование кэша процессора
-   сжатие в IN-NEMORY OLAP
    -   LZ4
    -   RLE RUN-LENGTH ENCODING - на данных с низкой кординальностью(повторяется одно и то же)
        -   все данные отсортировать не возможно и не нужно
-   векторные инструкции процессоров
-   поздняя материализация - при выполнении SQL - поздный JOIN столбцов
-   Эвристические оптимизаци BI платформы:
    -   автоматическая нормализация-денормализация таблиц
    -   сортировка по календарному измерению - НЕ ИСПОЛЬЗОВАТЬ ДАТУ В ВИДЕ СТРОКИ
    -   разделяемый пользовательский кэш - несолько позователей у BI
    -   разделяемый кэш подзапросов
    -   обратные индексы для строковых полей

Как убить IN-MEMORY OLAP

-   Применять выражения, на которых плохо работает векторизация(нелинейное вырожение используещее много строк)
-   Использовать вложенные запросы с большим промежуточным результатом (заставляет ранюю материализацию)
-   часто обновлять данные, не используя специальные инструменты для Real-time(заст частую инвалидацию и низ эфф кэша)
-   оставлять маленький запас свободной RAM
-   Грузить в BI поля с высокой кардинальностью - комментарии к заказу, сообщения

Реалтайм если нужен его лучше выделить в отдельный виджет - за отдельный час там

Было бы здорово - Измерить прямую заполнения кэша у BI платформы - редка позволяют

медленно изменяющиеся измерения - один сотрудник меняет должность что-то

-   срезы - по квартально (когда меняется структура статей финансовых и локаций)
-   таблицы фактов с именениями - каждый переход сотрудника - это факт

INMEMORY better then MOLAP

BI имеющие in-memory
visiolagy
ploimatic

для мониторинга событий - SCADA - специальные системы

пределы in-memory

-   сотен тысяч записей - начинаются проблемы
-   единиц милионов - проблемы

GPU для in-memory - неочень эффекивно есть вероятность потерять быстродейтвие для ряда задач

в ClickHouse есть специализация под разные виды запросов это и дает оптимизацию


<a id="org46f860a"></a>

# Big Data


<a id="org27808e0"></a>

## кодекс этики

<https://ac.gov.ru/projects/project/kodeks-etiki-ispolzovania-dannyh-5>

«Яндекс», Mail.ru Group, Сбербанк, Газпромбанк, «МегаФон», «Ростелеком» и другие компании


<a id="orgcd2c35f"></a>

## news

По оценке АБД, российский рынок больших данных на данный момент составляет 10–30 млрд рублей в год, а к 2024 году он достигнет 300 млрд рублей.


<a id="org18f723d"></a>

# Аналитическая платформа - система принятия решений

-   numerical-analysis software <https://en.wikipedia.org/wiki/List_of_numerical-analysis_software>
-   <https://en.wikipedia.org/wiki/Automated_machine_learning>
-   <https://en.wikipedia.org/wiki/Business_intelligence>

Aналитическая платформа Loginom

-   хранилище данных
-   стетистический анализ
-   репозиторий моделей

Weka (machine learning)

-   data mining tasks, more specifically, data preprocessing, clustering, classification, regression,
    visualization, and feature selection
-   access to SQL databases using Java Database Connectivity
-   provides access to deep learning with Deeplearning4j


<a id="org09413e6"></a>

# система управления активами (ITAM)

ИТ-активы — это и оборудование, и лицензии на программное обеспечение.

-   собрать все сведения об ИТ-ресурсах в одном месте, установить связи между активами, услугами, договорами, задачами
