BI.org
* Digital Marketing metrics
- CLV - customer lifetime value - is a prognostication of the net profit contributed to the whole future
  relationship with a customer.
- ARPU - Average revenue per account/user/customer - total revenue divided by the number of subscribers. per
  unit time, typically per year or month.
- ARPDAU or ARPAU (Average Revenue Per Daily Active User) - how much revenue is generated from daily active users over
  a 24-hour period. To see how some changes or events are affecting your revenue.
- Conversion Rate (CR) - Number of conversions / Total number of visitors × 100%
- Click-Through Rate (CTR) - Number of clicks / Number of impressions × 100%
- Cost per Click (CPC) -  = Ad costs / Number of clicks
- Cost per Action (CPA) - = number of actions completed / Ad costs . see "CPA case study"
- Cost per Lead (CPL) - Ad costs / Number of acquired leads - you pay for the contact information of a person
  potentially interested in your offer.
- Customer Acquisition Cost (CAC) - is the cost of convincing someone to buy. = cost + cost + cost
- Abandon Rate - calls/carts = Abandoned calls / Total number of inbound calls × 100%
- Return on Ad Spend (ROAS) - measuring ad performance = Revenue derived from the ad / Cost of the ad
- Return on Investment (ROI, or ROMI for marketing) = ((Gain from investment — Cost of investment) / Cost of
  investment )× 100%
  - for almost every process
- Time to Payback CAC - how long it’ll take to earn back marketing costs spent on acquiring a customer
  - = Customer acquisition cost (CAC) / (Average revenue per account (ARPA) × Gross profit)
  - Gross Profit = Revenue — Cost of goods/services sold
- Monthly Recurring Revenue (MRR)
  - = Total fees paid by customers monthly
  - or = ARPA per month × Total number of customers per month
- Churn Rate - percentage of customers or subscribers who discontinue their subscriptions during a given
  period.
  - Customer Churn - percentage of customers that stopped using your company's product
  - = number of churned customers in the given period / total number of customers at the start of the perion
- Revenue Churn (MRR) - monthly recurring revenue = (Churned MRR in the period / MRR at the start of the
  period) × 100%
- Share of Market (SOM) - how big your share of the market is. = (Company sales / Sales in the entire market)
  × 100%
- Share of Wallet (SOW) - percentage of dollars in customers’ pockets that they spend on you
  - = (Total cost of purchases a customer has made from your company / Total cost of purchases the customer
    has made in the same product or service class) × 100%
- Customer Retention Rate (CRR) or reversed customer churn - percentage of customers retained over a period of
  time. Though a 100% customer retention rate is idea.
  - = (Total customers at end of period - new customers acquired) / customers at begining of period * 100
  - = (Number of customers at the start of the period - number of customers acquired during the period) /
    number of customers at the end of the period * 100 - ?????7
- DAU/MAU ratio (stickiness) - daily active users to monthly active users ratio, measures the number of days
  per month that users engage with an application. For example, if the DAU/MAU ratio is 75%, users are
  engaging with an app 75% of the time or 22.5 days per month, on average. A 100% DAU/MAU score means users
  are visiting an app every day.
  - active user is a customer that completes one or more actions on an app
  - Average DAU - Sum of each day's unique users / Number of days in the month
  - Average MAU = Sum of each month's unique users / 12
- Cohort retention -
- Customer acquisition cost - how much money, resources, time and effort it takes to attract prospects and turn them into paying customers
- Customer churn rate - rate at which customers cease subscribing to a service or supporting a business
- Conversion rate - rate at which a user who is visiting a website becomes a paying customer by making a purchase
** terms
- marketing/purchase/customer/sales/conversion funnel - consumer-focused: Awareness -> Interest -> Desire ->
  Action -> Loyalty

* tmp
