BI.html

<div id="outline-container-org1b8b437" class="outline-2">
<h2 id="org1b8b437"><span class="section-number-2">36</span> Digital Marketing metrics</h2>
<div class="outline-text-2" id="text-36">
<ul class="org-ul">
<li>CLV - customer lifetime value - is a prognostication of the net profit contributed to the whole future
relationship with a customer.</li>
<li>ARPU - Average revenue per account/user/customer - total revenue divided by the number of subscribers. per
unit time, typically per year or month.</li>
<li>ARPDAU or ARPAU (Average Revenue Per Daily Active User) - how much revenue is generated from daily active users over
a 24-hour period. To see how some changes or events are affecting your revenue.</li>
<li>Conversion Rate (CR) - Number of conversions / Total number of visitors × 100%</li>
<li>Click-Through Rate (CTR) - Number of clicks / Number of impressions × 100%</li>
<li>Cost per Click (CPC) -  = Ad costs / Number of clicks</li>
<li>Cost per Action (CPA) - = number of actions completed / Ad costs . see "CPA case study"</li>
<li>Cost per Lead (CPL) - Ad costs / Number of acquired leads - you pay for the contact information of a person
potentially interested in your offer.</li>
<li>Customer Acquisition Cost (CAC) - is the cost of convincing someone to buy. = cost + cost + cost</li>
<li>Abandon Rate - calls/carts = Abandoned calls / Total number of inbound calls × 100%</li>
<li>Return on Ad Spend (ROAS) - measuring ad performance = Revenue derived from the ad / Cost of the ad</li>
<li>Return on Investment (ROI, or ROMI for marketing) = ((Gain from investment — Cost of investment) / Cost of
investment )× 100%
<ul class="org-ul">
<li>for almost every process</li>
</ul></li>
<li>Time to Payback CAC - how long it’ll take to earn back marketing costs spent on acquiring a customer
<ul class="org-ul">
<li>= Customer acquisition cost (CAC) / (Average revenue per account (ARPA) × Gross profit)</li>
<li>Gross Profit = Revenue — Cost of goods/services sold</li>
</ul></li>
<li>Monthly Recurring Revenue (MRR)
<ul class="org-ul">
<li>= Total fees paid by customers monthly</li>
<li>or = ARPA per month × Total number of customers per month</li>
</ul></li>
<li>Churn Rate - percentage of customers or subscribers who discontinue their subscriptions during a given
period.
<ul class="org-ul">
<li>Customer Churn - percentage of customers that stopped using your company's product</li>
<li>= number of churned customers in the given period / total number of customers at the start of the perion</li>
</ul></li>
<li>Revenue Churn (MRR) - monthly recurring revenue = (Churned MRR in the period / MRR at the start of the
period) × 100%</li>
<li>Share of Market (SOM) - how big your share of the market is. = (Company sales / Sales in the entire market)
× 100%</li>
<li>Share of Wallet (SOW) - percentage of dollars in customers’ pockets that they spend on you
<ul class="org-ul">
<li>= (Total cost of purchases a customer has made from your company / Total cost of purchases the customer
has made in the same product or service class) × 100%</li>
</ul></li>
<li>Customer Retention Rate (CRR) or reversed customer churn - percentage of customers retained over a period of
time. Though a 100% customer retention rate is idea.
<ul class="org-ul">
<li>= (Total customers at end of period - new customers acquired) / customers at begining of period * 100</li>
<li>= (Number of customers at the start of the period - number of customers acquired during the period) /
number of customers at the end of the period * 100 - ?????7</li>
</ul></li>
<li>DAU/MAU ratio (stickiness) - daily active users to monthly active users ratio, measures the number of days
per month that users engage with an application. For example, if the DAU/MAU ratio is 75%, users are
engaging with an app 75% of the time or 22.5 days per month, on average. A 100% DAU/MAU score means users
are visiting an app every day.
<ul class="org-ul">
<li>active user is a customer that completes one or more actions on an app</li>
<li>Average DAU - Sum of each day's unique users / Number of days in the month</li>
<li>Average MAU = Sum of each month's unique users / 12</li>
</ul></li>
<li>Cohort retention -</li>
<li>Customer acquisition cost - how much money, resources, time and effort it takes to attract prospects and turn them into paying customers</li>
<li>Customer churn rate - rate at which customers cease subscribing to a service or supporting a business</li>
<li>Conversion rate - rate at which a user who is visiting a website becomes a paying customer by making a purchase</li>
</ul>
</div>
<div id="outline-container-orga9d0e83" class="outline-3">
<h3 id="orga9d0e83"><span class="section-number-3">36.1</span> terms</h3>
<div class="outline-text-3" id="text-36-1">
<ul class="org-ul">
<li>marketing/purchase/customer/sales/conversion funnel - consumer-focused: Awareness -&gt; Interest -&gt; Desire -&gt;
Action -&gt; Loyalty</li>
</ul>
</div>
</div>
</div>
