BI.html

<div id="outline-container-orga655f2c" class="outline-2">
<h2 id="orga655f2c"><span class="section-number-2">37</span> tmp</h2>
<div class="outline-text-2" id="text-37">
</div>
<div id="outline-container-orgd13ba05" class="outline-3">
<h3 id="orgd13ba05"><span class="section-number-3">37.1</span> resume BI</h3>
<div class="outline-text-3" id="text-37-1">
<p>
Technology:
PostgreSQL, Pentaho data integration, Pentaho report designer, apachesuperset, MS power BI.
</p>


<p>
автоматизация ETL процедур посредством Apache Airflow
разработка и внедрение дашбордов с использованием ApacheSuperset
</p>


<p>
Корпоративноехранилищеданных(PostgreSQL, Pentaho BI, ApacheSuperset)
</p>


<p>
Рабочий процесс: Airflow Apache, Superset, Doсker
</p>

<p>
Технологии: PostgreSQL,PentahoDI, HP Vertica
</p>

<p>
Генерация гипотез о поведении пользователей и факторах влияющих на ключевые метрики (LTV, ARPU, ARPAU, Retention, ROMI и т.п.);
</p>


<p>
Разработка процессов извлечения, обработки и хранения данных (ETL) с использованием Python и Ruby скриптов. Оптимизация запросов к БД (Redshift, Vertica) и проектирование структуры хранения данных из разных источников (логи сервера, события из web и мобильных приложений, данные из production базы).
</p>

<p>
Пилотное внедрениехранилищданныхна основе Clickhouse и Exasol.
</p>


<p>
ETL Инструментарий: Oracle 11gR2, Informatica PowerCenter 9.x, Perl, Python 2.x, AIX shell,PentahoData Integration.
</p>


<p>
Внедрение аналитической системы прототипированием, перевод и рефакторинг всей имевшейся производственной отчетности за 3 мес (Oracle BI +PentahoDI + MS)
</p>


<p>
• разработка отчётов для одного из крупнейших интеграторов в РФ (Pentaho, Saiku);
</p>


<p>
Ашан: Используемые инструменты: Microstrategy, Oracle PL\SQL, SQL, Sparx EA, Talend Studio
</p>

<p>
(vertica, clickhouse, exasol, python, qlikview).
</p>

<p>
Работа с : Greenplum, Aginity
</p>

<p>
<a href="https://habr.com/ru/post/444758/">https://habr.com/ru/post/444758/</a>
</p>

<p>
<a href="https://arenadata.tech/products/aaw/">https://arenadata.tech/products/aaw/</a>
</p>
</div>
</div>

<div id="outline-container-org9092711" class="outline-3">
<h3 id="org9092711"><span class="section-number-3">37.2</span> my review</h3>
<div class="outline-text-3" id="text-37-2">
<p>
<b>Data warehouse:</b>
</p>

<ul class="org-ul">
<li><span class="underline">Greenplum BD</span></li>
</ul>

<p>
designed to manage large-scale analytic data warehouses and business intelligence workloads.
</p>
<ul class="org-ul">
<li>на основе PostgreSQL</li>
<li>massively parallel processing (MPP)</li>
<li>PostgreSQL interface</li>
<li>performs best with a denormalized schema design</li>
<li>Greenplum provides both row-oriented and <b>column-oriented</b> table types</li>
<li>logically partition table data, either by range or by a list of values - each partition of a single table
can utilize its own storage method (row vs. column orientation)</li>

<li><span class="underline">MariaBD</span></li>
</ul>

<p>
for a wide variety of use cases as replacement for MySQL
</p>
<ul class="org-ul">
<li>single server or multi-server</li>
<li>columnar storage optimized for interactive</li>
<li>ad hoc analytics</li>
<li>scaling out as needed</li>
</ul>

<p>
Bad:  Vertica CE (limited to 1TB of data and 3 database nodes), Clickhouse (сырая, недокум-ные Upd/Del),
</p>

<p>
<b>Report system:</b>
</p>

<ul class="org-ul">
<li><span class="underline">Power BI Desktop</span></li>
</ul>

<p>
один из лучших, отчет сохраняется в виде файла и открывается в том виде как был создан.
-cons:
</p>
<ul class="org-ul">
<li>Windows на одном рабочем месте, нужно предварительно установить и проверить соединение с базой</li>

<li><span class="underline">Metabase</span></li>
</ul>

<p>
можно развернуть в докере и дать доступ через веб.
-cons: мало средств визуализации, неудобный фильтр
</p>

<ul class="org-ul">
<li><span class="underline">Microstrategy</span> Desktop Free - аналог Power BI, требует изучение</li>

<li><span class="underline">Saiku Analytics</span> - web c ограничениями <a href="https://www.meteorite.bi/saiku-product-comparison">https://www.meteorite.bi/saiku-product-comparison</a></li>
</ul>


<p>
Bad: Apahce <span class="underline">SuperSet</span> (нельзя изменить названия полей),
<span class="underline">Pentaho</span> BI Suite (много ограничений по функционалу, поменялась компания 2017. 2017 stable),
<span class="underline">Vertica</span> CE (limited to 1TB of data and 3 database nodes),
<span class="underline">Exasol</span> CE(Can store up to 200 GB or raw data, single machine)
</p>

<p>
Отметил ELT интсрументы Apache Airflow и Talend Open Studio
</p>
</div>
</div>
<div id="outline-container-org2c09e07" class="outline-3">
<h3 id="org2c09e07"><span class="section-number-3">37.3</span> my review2</h3>
<div class="outline-text-3" id="text-37-3">
<p>
Qlik Sense Desktop (Windows) аналог Power BI
</p>
<ul class="org-ul">
<li>limits:</li>
<li>Section Access is not supported - When loading a QlikView App with Section Access an error message will be displayed.</li>
<li>Hidden Script is not supported - Saving an App with hidden script will NOT save the hidden script - Data of hidden script will be lost in the next reload.</li>
</ul>

<p>
Tableau Public (Desktop Windows, mac)
 cons:
</p>
<ul class="org-ul">
<li>Distribution: Cloud (you can not save Tableau Public workbooks locally)</li>
<li>Tableau Public has a limit of 10 million rows of data that is allowed in any single connection</li>
<li>Account Space: Each account holder will be able to save up to 10 gigabytes (GB) of content to Tableau Public</li>
</ul>

<p>
IBM Cognos платный инструмент с многообещающими особенностями. Лицензированием специалистов.
</p>
</div>
</div>
</div>

<div id="outline-container-org31d53c1" class="outline-2">
<h2 id="org31d53c1"><span class="section-number-2">38</span> links</h2>
<div class="outline-text-2" id="text-38">
<p>
<a href="https://dataschool.com/data-governance/">https://dataschool.com/data-governance/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-11-16 Wed 19:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
