BI.md


<a id="org89d6df0"></a>

# tmp


<a id="org3772aeb"></a>

## resume BI

Technology:
PostgreSQL, Pentaho data integration, Pentaho report designer, apachesuperset, MS power BI.

автоматизация ETL процедур посредством Apache Airflow
разработка и внедрение дашбордов с использованием ApacheSuperset

Корпоративноехранилищеданных(PostgreSQL, Pentaho BI, ApacheSuperset)

Рабочий процесс: Airflow Apache, Superset, Doсker

Технологии: PostgreSQL,PentahoDI, HP Vertica

Генерация гипотез о поведении пользователей и факторах влияющих на ключевые метрики (LTV, ARPU, ARPAU, Retention, ROMI и т.п.);

Разработка процессов извлечения, обработки и хранения данных (ETL) с использованием Python и Ruby скриптов. Оптимизация запросов к БД (Redshift, Vertica) и проектирование структуры хранения данных из разных источников (логи сервера, события из web и мобильных приложений, данные из production базы).

Пилотное внедрениехранилищданныхна основе Clickhouse и Exasol.

ETL Инструментарий: Oracle 11gR2, Informatica PowerCenter 9.x, Perl, Python 2.x, AIX shell,PentahoData Integration.

Внедрение аналитической системы прототипированием, перевод и рефакторинг всей имевшейся производственной отчетности за 3 мес (Oracle BI +PentahoDI + MS)

• разработка отчётов для одного из крупнейших интеграторов в РФ (Pentaho, Saiku);

Ашан: Используемые инструменты: Microstrategy, Oracle PL\SQL, SQL, Sparx EA, Talend Studio

(vertica, clickhouse, exasol, python, qlikview).

Работа с : Greenplum, Aginity

<https://habr.com/ru/post/444758/>

<https://arenadata.tech/products/aaw/>


<a id="orgcf4780d"></a>

## my review

**Data warehouse:**

-   <span class="underline">Greenplum BD</span>

designed to manage large-scale analytic data warehouses and business intelligence workloads.

-   на основе PostgreSQL
-   massively parallel processing (MPP)
-   PostgreSQL interface
-   performs best with a denormalized schema design
-   Greenplum provides both row-oriented and **column-oriented** table types
-   logically partition table data, either by range or by a list of values - each partition of a single table
    can utilize its own storage method (row vs. column orientation)

-   <span class="underline">MariaBD</span>

for a wide variety of use cases as replacement for MySQL

-   single server or multi-server
-   columnar storage optimized for interactive
-   ad hoc analytics
-   scaling out as needed

Bad:  Vertica CE (limited to 1TB of data and 3 database nodes), Clickhouse (сырая, недокум-ные Upd/Del),

**Report system:**

-   <span class="underline">Power BI Desktop</span>

один из лучших, отчет сохраняется в виде файла и открывается в том виде как был создан.
-cons:

-   Windows на одном рабочем месте, нужно предварительно установить и проверить соединение с базой

-   <span class="underline">Metabase</span>

можно развернуть в докере и дать доступ через веб.
-cons: мало средств визуализации, неудобный фильтр

-   <span class="underline">Microstrategy</span> Desktop Free - аналог Power BI, требует изучение

-   <span class="underline">Saiku Analytics</span> - web c ограничениями <https://www.meteorite.bi/saiku-product-comparison>

Bad: Apahce <span class="underline">SuperSet</span> (нельзя изменить названия полей),
<span class="underline">Pentaho</span> BI Suite (много ограничений по функционалу, поменялась компания 2017. 2017 stable),
<span class="underline">Vertica</span> CE (limited to 1TB of data and 3 database nodes),
<span class="underline">Exasol</span> CE(Can store up to 200 GB or raw data, single machine)

Отметил ELT интсрументы Apache Airflow и Talend Open Studio


<a id="orgad0814d"></a>

## my review2

Qlik Sense Desktop (Windows) аналог Power BI

-   limits:
-   Section Access is not supported - When loading a QlikView App with Section Access an error message will be displayed.
-   Hidden Script is not supported - Saving an App with hidden script will NOT save the hidden script - Data of hidden script will be lost in the next reload.

Tableau Public (Desktop Windows, mac)
 cons:

-   Distribution: Cloud (you can not save Tableau Public workbooks locally)
-   Tableau Public has a limit of 10 million rows of data that is allowed in any single connection
-   Account Space: Each account holder will be able to save up to 10 gigabytes (GB) of content to Tableau Public

IBM Cognos платный инструмент с многообещающими особенностями. Лицензированием специалистов.


<a id="org1bf4061"></a>

# links

<https://dataschool.com/data-governance/>
